{"Flying Courier": {"abilities": [{"Upgrade Courier": {"special_details": [], "modifiers": {}, "description": "Upgrades your team's Animal Courier to a Flying Courier, granting it swift, unobstructed movement to carry items to and from your team's base.Requires a deployed Animal Courier.", "Mana": "", "ability_special": [], "notes": ["The Flying Courier is not a valid target for most spells. A list of spells which affect the courier can be found below.", "The Flying Courier takes 50% more damage from melee attacks than from ranged attacks.", "It is possible to have multiple Flying Couriers. However, only the first created courier reacts on the courier button.", "All couriers are controllable by the entire team, no matter who buys and deploys the courier.", "When a courier dies, the opposing team's heroes get 175 gold each. If there already is a dead courier, no gold is granted.", ["However, an enemy making the killing blow on a courier always gets the 150 gold bounty."], "The Flying Courier is invulnerable when near its team's fountain.", "When a Flying Courier dies, it respawns in 180 seconds at the team's fountain. While dead, items in its inventory are unaccessable."], "Cooldown": "", "data": [], "types": {"Ability": ["Passive"]}}}, {"Return to Base": {"special_details": [], "modifiers": {}, "description": "Returns the courier to base.", "Mana": "", "ability_special": [], "notes": ["On both,  Radiant and  Dire side, the courier always walks to a spot about 400 range in front of the shop keeper, slightly to its right side."], "Cooldown": "", "data": ["Cast Animation: 0+0"], "types": {"Affects": ["Self"], "Ability": ["No Target"]}}}, {"Go To Secret Shop": {"special_details": [], "modifiers": {}, "description": "Sends the courier to your team's secret shop.", "Mana": "", "ability_special": [], "notes": ["Even when the secret shop on the enemy side of the map is closer, the courier still chooses the secret shop on its team's side of the map.", "The courier walks as close as possible to the shop keeper."], "Cooldown": "", "data": ["Cast Animation: 0+0"], "types": {"Affects": ["Self"], "Ability": ["No Target"]}}}, {"Return Items": {"special_details": [], "modifiers": {"Courier Return Stash Items: Undispellable.": "green"}, "description": "Return items to stash.", "Mana": "", "ability_special": [], "notes": ["When the courier has no items in its inventory, it stands still for a split second when casting this and then continues doing what it was doing previously.", "The courier walks to the same spot as with  Return to Base. But the items are already put into the stash when 700 range away from the shop."], "Cooldown": "", "data": ["Cast Animation: 0+0"], "types": {"Affects": ["Self"], "Ability": ["No Target"]}}}, {"Retrieve Items": {"special_details": [], "modifiers": {"Courier Take Stash Items: Undispellable.": "green"}, "description": "Retrieve items from stash.", "Mana": "", "ability_special": [], "notes": ["When the player has no items in its stash, it gives the \"No Items To Retrieve From Stash\" error message and does not interrupt the courier.", "Retrieves the items from the stash when getting within 700 range of the shop keeper. When the items are retrieved, the courier stops."], "Cooldown": "", "data": ["Cast Animation: 0+0"], "types": {"Affects": ["Self"], "Ability": ["No Target"]}}}, {"Transfer Items": {"special_details": [], "modifiers": {"Courier Transfer Items: Undispellable.": "green"}, "description": "Transfer items to hero.", "Mana": "", "ability_special": [], "notes": ["When the courier has no items in its inventory to transfer, it stands still for a split second when casting this and then continues doing what it was doing previously.", "After delivering the items, the courier automatically gets the  Return to Base order."], "Cooldown": "", "data": ["Cast Animation: 0+0"], "types": {"Affects": ["Self"], "Ability": ["No Target"]}}}, {"Speed Burst": {"special_details": [], "modifiers": {"Courier Burst: Dispellable with any dispel.": "green"}, "description": "The courier gains a burst of speed for 4 seconds.", "Mana": "", "ability_special": [], "notes": ["Applies a haste effect on the courier, which means it cannot be slowed. Not even empty  Bottles can slow it in this state."], "Cooldown": "", "data": ["Cast Animation: 0+0", "Haste Speed: 800", "Duration: 4"], "types": {"Affects": ["Self"], "Ability": ["No Target"]}}}], "availability": [], "cost": "250 (150)", "details": {"Charges": ["1"], "Alert allies?": ["No"], "builds_into": [], "Disassemble?": ["No"], "Active": ["Upgrade Courier"], "builds_from": ["Animal Courier", "Recipe"]}, "lore": "The faithful mount upon which soar the fortunes of battle.", "type": "Consumables", "additional_info": ["Becomes available for purchase at the 3 minute mark.", "It takes 3 minutes for the Flying Courier to replenish in the stock.", "Flying Courier is completely shareable.", "This item acts as a recipe to upgrade the Animal Courier. Buying it automatically upgrades the Animal Courier (wherever it is).\n However, unlike other recipes, it does not combine into one item when the Animal Courier and the Flying Courier items are in the inventory.", "However, unlike other recipes, it does not combine into one item when the Animal Courier and the Flying Courier items are in the inventory."]}, "Skull Basher": {"abilities": [{"Bash": {"special_details": [], "modifiers": {"Bashed: Dispellable with strong dispels.": "red"}, "description": "Grants each attack a chance to stun the target for 1.4 seconds and deal 85 bonus damage, based on whether the equipped hero is ranged or melee.", "Mana": "", "ability_special": ["NOT_UNIQUE_ATTACK_MODIFIER", "ILLUSIONS_CANNOT_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Skull Basher's bash does not stack with the bash of  Abyssal Blade and other Skull Bashers.", "When obtaining multiple items with the bash ability, only the first bought one's bash works while the others are disabled.", "The mini-bash ability of  Monkey King Bar is not treated as a bash, and it works fully independently from other bashes.", "The bonus damage from Bash can be lifestealed off. However, it cannot crit or cleave.", "The damage can be reduced with e.g.  Enfeeble or  Static Link.", ["However, it cannot be amplified with e.g.  Empower or the  Double Damage Rune."], "Adds an average of 21.25 damage to every attack for melee heroes, and 8.5 damage for ranged heroes.", "Does not work against wards and buildings, but works against allied units.", "Bash uses pseudo-random distribution."], "Cooldown": "", "data": ["Proc Chance (Melee): 25%", "Proc Chance (Ranged): 10%", "Damage: 85", "Stun Duration: 1.4"], "types": {"Affects": ["Enemies"], "Ability": ["Passive"], "Damage": ["Magical"]}}}], "availability": [], "cost": "2700 (750)", "details": {"Bonus": ["+10 Strength", "+10 Attack damage"], "Alert allies?": ["No"], "builds_into": ["Abyssal Blade"], "Passive": ["Bash"], "Disassemble?": ["No"], "builds_from": ["Javelin", "Belt of Strength", "Recipe"]}, "lore": "A feared weapon in the right hands, this maul's ability to shatter the defenses of its opponents should not be underestimated.", "type": "Weapons", "additional_info": ["When held by Slardar, Spirit Breaker, Troll Warlord or Faceless Void, Bash cannot proc.", "One Skull Basher grants a total of 200 health, 0.3 health regeneration and 10 (20 to strength heroes) attack damage."]}, "Platemail": {"abilities": [], "availability": ["SECRET_SHOP"], "cost": "1400 ", "details": {"Bonus": ["+10 Armor"], "builds_from": [], "builds_into": ["Assault Cuirass", "Shiva's Guard", "Lotus Orb"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "Thick metal plates that protect the entire upper body. Avoid dropping on feet.", "type": "Secret Shop", "additional_info": []}, "Infused Raindrop": {"abilities": [{"Magical Damage Block": {"special_details": ["NO_PIERCE_SPELL_IMMUNE While spell immune, Infused Raindrop does not react on magical damage."], "modifiers": {}, "description": "Consumes a charge to block 120 magic damage from damage instances over 50 damage. Comes with 5 charges. When the charges are gone, the item disappears.", "Mana": "", "ability_special": ["ILLUSIONS_CANNOT_USE", "NO_PIERCE_SPELL_IMMUNE"], "notes": ["Blocks up to 120 magical damage and completely ignores magical damage lower than 50.", "Neither consumes charges nor blocks any damage while on cooldown.", "Only procs on magical damage equal to or greater than 50 (before reductions), not including self-inflicted damage and damage dealt by allies.", ["Also ignores every form of damage amplification, including spell damage amplification.", "Has the highest priority in the group of damage negating spells, blocking damage before any of them do.", "Has a higher priority than  Dispersion and  Blade Mail, meaning it first blocks damage before they spread it.", "Has a lower priority than  Mana Shield, meaning Mana Shield first reduces damage before Raindrop blocks it."]], "Cooldown": "", "data": ["Minimum Damage Threshold: 50", "Magical Damage Blocked: 120", "Number of Charges: 5"], "types": {"Affects": ["Self"], "Ability": ["Passive"]}}}], "availability": [], "cost": "225 ", "details": {"Charges": ["5"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Magical Damage Block"], "Bonus": ["+0.85 Mana regeneration"], "Disassemble?": ["No"], "builds_from": []}, "lore": "Elemental protection from magical assaults.", "type": "Armaments", "additional_info": ["Becomes available for purchase at the 3 minute mark.", "After that, it has a 1 second restock time.", "Infused Raindrops do not stack in the inventory. Each of them requires its own slot. Their regeneration does stack."]}, "Cloak": {"abilities": [], "availability": ["SIDE_SHOP"], "cost": "550 ", "details": {"Bonus": ["+15% Magic resistance"], "builds_from": [], "builds_into": ["Hood of Defiance", "Glimmer Cape"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "A cloak made of a magical material that works to dispel any magic cast on it.", "type": "Arcane", "additional_info": ["Stacks multiplicatively with other sources of magic resistance."]}, "Tango": {"abilities": [{"Eat a Tree or Ward": {"special_details": [], "modifiers": {"Tango Heal: Undispellable.": "green"}, "description": "Consume a target tree or ward to gradually restore health.Comes with 4 charges. Can be used on an allied hero to give them one Tango.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["When cast on trees, enemy  Observer Wards and  Sentry Wards, it destroys the target and heals the user.", ["When targeting wards or trees placed by  Iron Branch, the heal duration is doubled.", "Restores health in the form of health regeneration, so it heals for 0.72 health in 0.1 second intervals (7.19 health per second).", "One set of Tangoes can heal for up to 460 (920) health.", "Successive uses with the same unit do not stack, but refresh the duration instead.", "Cannot be cast on any other ward than enemy Observer and Sentry Wards."], "When targeting an allied hero, it creates a  Tango (Shared) in the targeted ally's inventory, instead of healing the user.", ["If the targeted ally's inventory is full, the item is dropped on the ground.", "Can also be cast on creep-heroes, only giving Spirit Bear and Familiars a charge, otherwise having no effect."]], "Cooldown": "", "data": ["Cast Range (Tree/Ally): 165", "Cast Range (Ward): 450", "Health Restored (Tree): 115", "Health Restored (Ward): 230", "Duration (Tree): 16", "Duration (Ward): 32"], "types": {"Affects": ["Trees  / Self"], "Ability": ["Target Unit"]}}}], "availability": [], "cost": "125 ", "details": {"Charges": ["4"], "Alert allies?": ["No"], "builds_into": ["Tango Shared"], "Disassemble?": ["No"], "Active": ["Eat a Tree or Ward"], "builds_from": []}, "lore": "Forage to survive on the battlefield.", "type": "Consumables", "additional_info": ["Stacks with itself in inventory, there is no stack limit. The sell-back price adapts based on the number of Tangoes in a stack.", "A set of Tangoes is not shareable. However, it is possible to give allies a Tango charge by casting it on them."]}, "Black King Bar": {"abilities": [{"Avatar": {"special_details": [], "modifiers": {"Black King Bar Immune: Undispellable.": "green"}, "description": "Grants Spell Immunity and 100% Magic Damage Resistance. Duration and cooldown decrease with each use. Some abilities are able to disable through Avatar.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Interrupts the owner's channeling spells upon cast.", "Applies spell immunity for the duration and a basic dispel upon cast.", "During Avatar, the hero cannot be affected by  Ghost Scepter or by  Ethereal Blade. These buffs get removed immediately.", "Causes the user's model size to increase by 30% for its duration. This has no impact on its collision size.", "The duration of Avatar is bound to the hero. Re-buying Black King Bar does not reset it.", "For more details, including a list of spells which are not blocked, see Spell immunity."], "Cooldown": "", "data": ["Duration: 10/9/8/7/6/5"], "types": {"Affects": ["Self"], "Ability": ["No Target"]}}}], "availability": [], "cost": "3975 (1375)", "details": {"Bonus": ["+10 Strength", "+24 Attack damage"], "Alert allies?": ["No"], "builds_into": [], "Disassemble?": ["No"], "Active": ["Avatar"], "builds_from": ["Mithril Hammer", "Ogre Club", "Recipe"]}, "lore": "A powerful staff imbued with the strength of giants.", "type": "Armor", "additional_info": ["One Black King Bar grants a total of 200 health, 0.3 health regeneration and 24 (34 to strength heroes) attack damage."]}, "Dragon Lance": {"abilities": [{"Attack Range Bonus": {"special_details": [], "modifiers": {}, "description": "Increases attack range of ranged heroes by 140.", "Mana": "", "ability_special": ["NOT_UNIQUE_ATTACK_MODIFIER", "ILLUSIONS_CAN_USE"], "notes": ["Attack range bonuses from multiple Dragon Lances or Hurricane Pikes do not stack.", "Stacks with any other source of attack range bonus.", "Affects the cast range of active attack modifiers as well.", "Does not affect the range of secondary attacks like  Moon Glaive,  Split Shot,  Flak Cannon or  Marksmanship.", "Affects the cast range of  Focus Fire as well, so it matches the total attack range."], "Cooldown": "", "data": ["Attack Range Bonus: 140"], "types": {"Affects": ["Self"], "Ability": ["Passive"]}}}], "availability": [], "cost": "1900 ", "details": {"Bonus": ["+13 Strength", "+14 Agility"], "Alert allies?": ["No"], "builds_into": ["Hurricane Pike"], "Passive": ["Attack Range Bonus"], "Disassemble?": ["Yes"], "builds_from": ["Ogre Club", "Band of Elvenskin", "Band of Elvenskin"]}, "lore": "The forward charge of the wyvern host grants no quarter.", "type": "Artifacts", "additional_info": ["One Dragon Lance grants a total of 260 health, 0.39 health regeneration, 2 armor and 14 attack speed (and 13 attack damage to Strength and 14 attack damage to Agility heroes)."]}, "Gem of True Sight": {"abilities": [{"True Sight": {"special_details": ["ILLUSIONS_CAN_USE Illusions that possess Gem of True Sight also provide True Sight around them."], "modifiers": {"Truesight: Undispellable.": "red"}, "description": "Adds the ability to see invisible units and wards to any allied vision within its carrier's range.", "Mana": "", "ability_special": ["ILLUSIONS_CAN_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["The True Sight is provided within the whole area, regardless of the carrier's actual vision. It is fully unobstructed.", "The True Sight is provided by an aura which affects enemies. Its effect lingers for 0.5 seconds.", "Cannot detect units under the effect of  Shadow Dance,  Smoke of Deceit and  Techies' mines within a 125 radius of an  Aghanim's Scepter upgraded  Minefield Sign.", "True Sight does not work when the Gem is in a courier's or in  Lone Druid's Spirit Bear's inventory."], "Cooldown": "", "data": ["Radius: 900"], "types": {"Affects": ["Enemies"], "Ability": ["Aura"]}}}], "availability": [], "cost": "900 ", "details": {"Passive": ["True Sight"], "builds_from": [], "builds_into": [], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "Not one thrall creature of the depths,Nor spirit bound in drowning's keep,Nor Maelrawn the Tentacular,Shall rest till seas, gem comes to sleep.", "type": "Arcane", "additional_info": ["Gem of True Sight is partially shareable.", "The stock takes 10 minutes to replenish.", "This item drops when its wielder dies, unless it has Reincarnation.", "Gem of True Sight cannot be destroyed or sold."]}, "Reaver": {"abilities": [], "availability": ["SECRET_SHOP"], "cost": "3000 ", "details": {"Bonus": ["+25 Strength"], "builds_from": [], "builds_into": ["Heart of Tarrasque", "Satanic"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "A massive axe capable of tearing whole mountains down.", "type": "Secret Shop", "additional_info": ["One Reaver grants a total of 500 health and 0.75 health regeneration (and 25 attack damage to strength heroes)."]}, "Tranquil Boots": {"abilities": [{"Break": {"special_details": ["ILLUSIONS_CAN_USE Illusions always have the broken version in their inventory."], "modifiers": {}, "description": "Whenever you attack or are attacked, the health regeneration and 30 Movement Speed are lost for 13 seconds.", "Mana": "", "ability_special": ["ILLUSIONS_CAN_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Reduces Tranquil Boots stats to +55 movement speed, 0 health regeneration and +3 armor.", "Breaks upon successfully landing an attack on an enemy, or when an enemy successfully lands an attack on you.", ["This means when your or an enemy's attack misses or is disjointed, the boots do not break.", "The actual damage from the attack does not matter, even 0 damage attacks can break the boots.", "The secondary attacks of  Flak Cannon and  Split Shot count, too, but the bounces of  Moon Glaive do not.", "Cleave, splash and  Psi Blades cannot break the boots of secondary targets either."], "When triggered, the item's icon changes and is set on a 13 second cooldown. However, this has only informative purposes.", ["This means that refreshing it ( Refresher Orb,  Rearm) does not skip the broken state.", "This also means it is not affected by the Cooldown Reduction of  Octarine Core and  Arcane Rune."]], "Cooldown": "", "data": ["Health Regeneration Reduction: 12", "Movement Speed Reduction: 30", "Duration: 13"], "types": {"Affects": ["Self"], "Ability": ["Passive"]}}}], "availability": [], "cost": "900 ", "details": {"Bonus": ["+12 Health regeneration", "+3 Armor", "+85 Movement Speed"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Break"], "Disassemble?": ["No"], "builds_from": ["Boots of Speed", "Ring of Protection", "Ring of Regen"]}, "lore": "While they increase the longevity of the wearer, this boot is not particularly reliable.", "type": "Support", "additional_info": ["Movement speed bonuses from multiple pairs of boots do not stack.", "Stacks with all other movement speed bonuses.", "The health regeneration of multiple Tranquil Boots fully stack."]}, "Chainmail": {"abilities": [], "availability": ["SIDE_SHOP"], "cost": "550 ", "details": {"Bonus": ["+5 Armor"], "builds_from": [], "builds_into": ["Assault Cuirass", "Blade Mail", "Medallion of Courage", "Buckler"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "A medium weave of metal chains.", "type": "Armaments", "additional_info": []}, "Ring of Regen": {"abilities": [], "availability": ["SIDE_SHOP"], "cost": "325 ", "details": {"Bonus": ["+2 Health regeneration"], "builds_from": [], "builds_into": ["Headdress", "Hood of Defiance", "Tranquil Boots", "Soul Ring", "Force Staff", "Drum of Endurance"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "This ring is considered a good luck charm among the Gnomes.", "type": "Arcane", "additional_info": ["Ring of Regen is partially shareable."]}, "Mjollnir": {"abilities": [{"Static Charge": {"special_details": ["PARTIAL_PIERCE_SPELL_IMMUNE Can be cast on spell immune allies.Can be procced by spell immune enemies, and attempts to damage them. Cannot hit secondary spell immune enemies."], "modifiers": {"Item Mjollnir Static: Dispellable with any dispel.": "green"}, "description": "Places a charged shield on a target unit which has a 20% chance to release a shocking bolt at a nearby attacker and 4 additional enemies.", "Mana": "", "ability_special": ["PARTIAL_PIERCE_SPELL_IMMUNE"], "notes": ["Double clicking the item casts it on self.", "Successive casts on the same allied refresh the buff duration.", "The radius is centered around the shielded unit.", "Upon proccing, the proccing unit and 4 random enemy units within the radius are hit.", "Static Charge cannot proc more than once per second.", "Does not hit invisible units or units in the Fog of War.", "Despite the description, Static Charge can proc on any damage, including from spells, not only on attacks.", "Can only proc on damage instances of 5 or greater (after reductions).", "Does not trigger on self-inflicted damage, and damage flagged as HP Removal.", "All 5 bolts together can deal up to 1000 damage (before reductions).", "Static Charge uses pseudo-random distribution."], "Cooldown": "", "data": ["Cast Range: 800", "Proc Chance: 20%", "Proc Cooldown: 1", "Search Radius: 900", "Max Number of Targets: 5", "Damage: 200", "Shield Duration: 15"], "types": {"Affects": ["Enemy Units"], "Ability": ["Target Unit"], "Damage": ["Magical"]}}}, {"Chain Lightning": {"special_details": ["PARTIAL_PIERCE_SPELL_IMMUNE Can proc on and attempts to damage spell immune enemies. Cannot bounce to spell immune enemies.", "UNIQUE_ATTACK_MODIFIER Stacks with other attack modifiers, but overrides them when Chain Lightning occurs."], "modifiers": {"Mjollnir Chain: Undispellable.": "green"}, "description": "Grants a chance on attack to release a bolt of electricity that leaps between 12 targets, dealing 150 magical damage to each.", "Mana": "", "ability_special": ["UNIQUE_ATTACK_MODIFIER", "ILLUSIONS_CANNOT_USE", "PARTIAL_PIERCE_SPELL_IMMUNE"], "notes": ["Each Mjollnir in the inventory has an independent chance to proc. If 2 or more proc on one attack, only one chain lightning is released.", "The same applies to Maelstrom and Mjollnir in the same inventory. When both proc on the same hit, Mjollnir has priority.", "The lightning bounces in 0.25 second intervals, so hitting 12 targets takes 2.75 seconds.", "Does not bounce on invisible units or units in the Fog of War.", "Can never hit the same unit twice per proc.", "Can only proc on successfully hit attacks, thus missed attacks cannot proc.", "All bounces together can deal up to 1800 damage (before reductions).", "Chain Lightning uses pseudo-random distribution.", "The Mjollnir Chain buff is a hidden buff required for the lightning to jump."], "Cooldown": "", "data": ["Proc Chance: 25%", "Bounce Distance: 900", "Number of Bounces: 12", "Damage: 150"], "types": {"Affects": ["Enemies"], "Ability": ["Passive"], "Damage": ["Magical"]}}}], "availability": [], "cost": "5700 (900)", "details": {"Bonus": ["+24 Attack damage", "+80 Attack speed"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Chain Lightning"], "Disassemble?": ["Yes"], "Active": ["Static Charge"], "builds_from": ["Hyperstone", "Maelstrom", "Recipe"]}, "lore": "Thor's magical hammer, made for him by the dwarves Brok and Eitri.", "type": "Artifacts", "additional_info": ["The Mjollnir is the highest DPS item in the game and it ignores armor.", "Mjollnir is very effective against heroes with illusions like Naga Siren, Spectre and particularly Phantom Lancer and Chaos Knight that can surround you because the lightning goes all around you compared to cleave.", "This item is very good for pushing, you can apply the Static Charge on a creep to push a lane safely while you jungle and get extra gold.", "The item is situational since the Chain Lightning damage is blocked by spell immunity and it also overrides lifesteal."]}, "Blade Mail": {"abilities": [{"Damage Return": {"special_details": ["PIERCE_SPELL_IMMUNE Returned magical damage is reduced to 0."], "modifiers": {"Item Blade Mail Reflect: Undispellable.": "green"}, "description": "Reflects any damage taken back to the unit that dealt the damage. Lasts 4.5 seconds.", "Mana": "", "ability_special": ["ILLUSIONS_CANNOT_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Interrupts the owner's channeling spells upon cast.", "Returns the same damage type as received.", "Returns incoming damage before all manipulations.", "The return damage which the enemy takes is affected by damage manipulation normally, since it is regular magical/physical/pure damage still.", "Returned damage has the no-reflection flag, preventing its damage from interacting with other sources of damage with the same flag.", "Fully ignores self-inflicted damage, and damage flagged as HP Removal.", "Returns damage back to the source. This means damage done by summons is reflected back to the summons, not to their owner.", "Damage Return has a global range and affects units through the Fog of War or invisibility.", "Does not work against wards, buildings and allied units."], "Cooldown": "", "data": ["Damage Returned: 100%", "Duration: 4.5"], "types": {"Affects": ["Enemies"], "Ability": ["No Target"]}}}], "availability": ["SIDE_SHOP"], "cost": "2200 ", "details": {"Bonus": ["+10 Intelligence", "+22 Attack damage", "+6 Armor"], "Alert allies?": ["No"], "builds_into": [], "Disassemble?": ["No"], "Active": ["Damage Return"], "builds_from": ["Broadsword", "Chainmail", "Robe of the Magi"]}, "lore": "A razor-sharp coat of mail, it is the choice of selfless martyrs in combat.", "type": "Armor", "additional_info": ["One Blade Mail grants a total of 6 armor, 120 mana, 0.4 mana regeneration, 0.625% spell damage and 22 (32 to intelligence heroes) attack damage."]}, "Aghanim's Scepter": {"abilities": [{"Ultimate Upgrade": {"special_details": [], "modifiers": {}, "description": "Upgrades the ultimate and some abilities of certain heroes.", "Mana": "", "ability_special": [], "notes": ["When a hero has an upgrade available, the item's and the upgraded spell's tooltip states what exactly is upgraded.", "When a hero has no upgrades available, the ultimate ability gets a green note reading \"This hero has no upgrade\".", "Single target spells with Aghanim's Scepter upgrades that are reflected by  Lotus Orb depend on whether the hero with the Echo Shell on has Aghanim's Scepter, not the original caster of the spell."], "Cooldown": "", "data": [], "types": {"Affects": ["Self"], "Ability": ["Passive"]}}}], "availability": [], "cost": "4200 ", "details": {"Bonus": ["+10 Strength", "+10 Agility", "+10 Intelligence", "+175 Health", "+175 Mana"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Ultimate Upgrade"], "Disassemble?": ["No"], "builds_from": ["Point Booster", "Ogre Club", "Blade of Alacrity", "Staff of Wizardry"]}, "lore": "The scepter of a wizard with demigod-like powers.", "type": "Caster", "additional_info": ["The following heroes cannot drop or sell Aghanim's Scepter once they have purchased it, due to the nature of the upgrades they get from wielding it:\n Earth Spirit, Lifestealer, Meepo, Morphling, Nyx Assassin, Ogre Magi, Timbersaw, Treant Protector and Tusk.", "Earth Spirit, Lifestealer, Meepo, Morphling, Nyx Assassin, Ogre Magi, Timbersaw, Treant Protector and Tusk.", "One Aghanim's Scepter grants a total of 375 health, 0.3 health regeneration, 1.43 armor, 10 attack speed, 295 mana, 0.4 mana regeneration, 0.625% spell damage and 10 attack damage."]}, "Blades of Attack": {"abilities": [], "availability": ["SIDE_SHOP"], "cost": "420 ", "details": {"Bonus": ["+9 Attack damage"], "builds_from": [], "builds_into": ["Armlet of Mordiggian", "Crystalys", "Phase Boots"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "The damage of these small, concealable blades should not be underestimated.", "type": "Armaments", "additional_info": []}, "Stout Shield": {"abilities": [{"Damage Block": {"special_details": [], "modifiers": {}, "description": "Gives a chance to block damage based on whether the equipped hero is melee or ranged.", "Mana": "", "ability_special": ["ILLUSIONS_CAN_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Does not work against wards ( Plague Ward,  Mass Serpent Ward,  Death Ward).", "Does not reduce physical damage from spells, except from  Moon Glaive and  The Swarm.", "Damage Block uses pseudo-random distribution.", "For more details, see Damage Block."], "Cooldown": "", "data": ["Proc Chance: 50%", "Blocked Damage (Melee): 16", "Blocked Damage (Ranged): 8"], "types": {"Affects": ["Self"], "Ability": ["Passive"]}}}], "availability": ["SIDE_SHOP"], "cost": "200 ", "details": {"Passive": ["Damage Block"], "builds_from": [], "builds_into": ["Poor Man's Shield", "Vanguard"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "One man's wine barrel bottom is another man's shield.", "type": "Armaments", "additional_info": ["In-game model"]}, "Echo Sabre": {"abilities": [{"Echo Strike": {"special_details": ["PARTIAL_PIERCE_SPELL_IMMUNE Can proc on spell immune enemies. Cannot slow spell immune enemies. Slow persists if debuff was placed before spell immunity and when not dispelled."], "modifiers": {"Echo Sabre Debuff: Dispellable with any dispel.": "red"}, "description": "Causes melee attacks to attack twice in quick succession. The double attacks apply a 0.6 second 100% movement and attack speed slow on each strike.", "Mana": "", "ability_special": ["NOT_UNIQUE_ATTACK_MODIFIER", "ILLUSIONS_CANNOT_USE", "PARTIAL_PIERCE_SPELL_IMMUNE"], "notes": ["This ability works exclusively for melee heroes.", "Upon proccing, grants the user 490 attack speed until the next attack.", ["This means it does not provide guaranteed full attack speed and can be countered by strong attack speed slows.", "The attack speed has no set duration. It lasts until the user makes his second attack, no matter how long he waits."], "Since it is a simple attack speed bonus, it is possible to cancel the second attack and \"store\" the attack speed for later.", "The second attack is not an instant attack. It uses regular attack animation times. This means it can proc any attack modifier normally.", "The movement and attack speed slow is applied on the proccing attack and on the attack after the proccing attack.", ["This means it is possible to slow 2 enemies with one proc, by switching attack targets after the proccing attack."], "The slow of multiple instances does not stack, but refreshes the duration instead.", "Procs on anything, including buildings, wards and allies. The slow fully applies to allies, but not to buildings and wards."], "Cooldown": "", "data": ["Attack Speed Bonus: 490", "Number of Attacks: 1", "Move Speed Slow: 100%", "Attack Speed Slow: 100", "Slow Duration: 0.6"], "types": {"Affects": ["Enemies"], "Ability": ["Passive"]}}}], "availability": [], "cost": "2650 ", "details": {"Bonus": ["+10 Strength", "+10 Intelligence", "+75% Mana regeneration", "+15 Attack damage", "+10 Attack speed"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Echo Strike"], "Disassemble?": ["No"], "builds_from": ["Ogre Club", "Oblivion Staff"]}, "lore": "A deceptively swift blade imbued with resonant magic.", "type": "Artifacts", "additional_info": ["One Echo Sabre grants a total of 200 health, 0.3 health regeneration, 10 attack speed, 120 mana, 0.4 (+75%) mana regeneration, 0.625% spell damage and 15 (25 to strength and intelligence heroes) attack damage."]}, "Phase Boots": {"abilities": [{"Phase": {"special_details": [], "modifiers": {"Item Phase Boots Active: Undispellable.": "green"}, "description": "Gives increased movement speed and lets you move through units. The increased movement speed is based on whether the equipped hero is melee or ranged.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Does not interrupt the user's channeling spells upon cast.", "Allows the user to pass through other units, including wards, but not through buildings, and other units to pass through it.", "Checks the user's range type periodically and updates the speed bonus immediately if the range type changes."], "Cooldown": "", "data": ["Move Speed Bonus (Melee): 24%", "Move Speed Bonus (Ranged): 20%", "Duration: 2.5"], "types": {"Affects": ["Self"], "Ability": ["No Target"]}}}], "availability": ["SIDE_SHOP"], "cost": "1240 ", "details": {"Bonus": ["+24 Attack damage", "+45 Movement Speed"], "Alert allies?": ["No"], "builds_into": [], "Disassemble?": ["No"], "Active": ["Phase"], "builds_from": ["Boots of Speed", "Blades of Attack", "Blades of Attack"]}, "lore": "Boots that allow the wearer to travel between the ether.", "type": "Common", "additional_info": ["Movement speed bonuses from multiple pairs of boots do not stack.", "Stacks with all other movement speed bonuses."]}, "Gauntlets of Strength": {"abilities": [], "availability": [], "cost": "150 ", "details": {"Bonus": ["+3 Strength"], "builds_from": [], "builds_into": ["Bracer", "Urn of Shadows"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "Studded leather gloves that add brute strength.", "type": "Attributes", "additional_info": ["One Gauntlets of Strength grants a total of 60 health and 0.09 health regeneration (and 3 attack damage to strength heroes)."]}, "Perseverance": {"abilities": [], "availability": ["SIDE_SHOP"], "cost": "1700 ", "details": {"Bonus": ["+6 Health regeneration", "+125% Mana regeneration", "+10 Attack damage"], "builds_from": ["Ring of Health", "Void Stone"], "builds_into": ["Battle Fury", "Linken's Sphere", "Refresher Orb", "Lotus Orb"], "Alert allies?": ["No"], "Disassemble?": ["Yes"]}, "lore": "A gem that grants heart to the bearer.", "type": "Common", "additional_info": ["Perseverance is partially shareable."]}, "Point Booster": {"abilities": [], "availability": ["SECRET_SHOP"], "cost": "1200 ", "details": {"Bonus": ["+175 Health", "+175 Mana"], "builds_from": [], "builds_into": ["Aghanim's Scepter", "Eye of Skadi", "Soul Booster"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "A perfectly formed amethyst that nourishes body and mind when held.", "type": "Secret Shop", "additional_info": []}, "Pipe of Insight": {"abilities": [{"Barrier": {"special_details": [], "modifiers": {"Item Pipe Barrier: Undispellable.": "green"}, "description": "Gives a shield that blocks 400 spell damage to all allies in a 900 radius.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Interrupts the user's channeling spells upon cast.", "Blocks damage before any reductions, except when spell immune, during which it does not block any magical damage.", "Recasting Barrier refreshes the buff and resets the barrier's absorb capacity.", "Does not stack with other magical damage barriers.", ["If multiple sources of barriers are active on a unit, all of them lose capacity from the same absorbed damage instance."], "Does not share cooldown with  Hood of Defiance."], "Cooldown": "", "data": ["Radius: 900", "Magical Damage Absorbed: 400", "Duration: 12"], "types": {"Affects": ["Allies"], "Ability": ["No Target"]}}}, {"Insight Aura": {"special_details": ["ILLUSIONS_CANNOT_USE Illusions provide the aura, but do not benefit from it."], "modifiers": {"Item Pipe Aura: Undispellable.": "green"}, "description": "Gives allied units 4 health regeneration and 10% magic resistance in a 900 radius.", "Mana": "", "ability_special": ["ILLUSIONS_CANNOT_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Stacks with all other sources of flat health regeneration and magic resistance, except with Insight Aura from multiple Pipes of Insight.", "Does not affect wards, buildings and invulnerable units.", "The aura's buff lingers for 0.5 seconds."], "Cooldown": "", "data": ["Radius: 900", "Health Regeneration Bonus: 4", "Magic Resistance Bonus: 10%"], "types": {"Affects": ["Allies"], "Ability": ["Aura"]}}}], "availability": [], "cost": "3100 (800)", "details": {"Bonus": ["+8 Health regeneration", "+30% Magic resistance"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Insight Aura"], "Disassemble?": ["No"], "Active": ["Barrier"], "builds_from": ["Hood of Defiance", "Headdress", "Recipe"]}, "lore": "A powerful artifact of mysterious origin, it creates barriers against magical forces.", "type": "Support", "additional_info": ["The magic resistance stacks multiplicatively with other sources of magic resistance.", "Pipe of Insight does not inherit the attribute bonuses from Headdress.", "Together with the aura, one Pipe of Insight grants a total of 12 health regeneration to the owner."]}, "Armlet of Mordiggian": {"abilities": [{"Unholy Strength": {"special_details": ["ILLUSIONS_PARTIAL_USE Illusions do not benefit from the attack damage and armor and do not lose health per second. Illusions gain the strength over 0.6 seconds and copy the original's current health, resulting in them having 500 current health more than the hero if it was not at full health as the illusion was created."], "modifiers": {"Item Armlet Unholy Strength: Undispellable.": "green"}, "description": "When active, Unholy Strength grants +31 damage and +25 strength, but drains 45 health per second. You cannot die from the health drain when Unholy Strength is activated, nor from the strength loss when Unholy Strength is deactivated.", "Mana": "", "ability_special": ["ILLUSIONS_PARTIAL_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Does not interrupt the owner's channeling spells upon toggling.", "Upon toggling on, it instantly provides the attack damage and starts draining 5 health in 0.11 second intervals.", "Grants 4.17 strength in 0.1 second intervals, so it needs 0.6 seconds to grant the full strength bonus.", "The armor is granted after the 0.6 seconds, and not instantly.", "Grants a total of 500 health (475 when considering the health drain) and 0.75 health regeneration.", "Does not drain health while invulnerable or hidden.", "Health drain cannot bring the owner's health below 1. Does not toggle itself off when reaching 1 health.", "Considering the passive health regen and the regen gained from the strength, it effectively costs 37.25 health per second.", "When toggling off, all bonuses are instantly lost. However, it cannot bring the user below 1 health.", "Unholy Strength does not persist through the user's death. If it was active upon death, the user respawns with it deactivated.", "Multiple instances of Unholy Strength do not stack.", ["If multiple Armlets are toggled on, turning off any Armlet removes the Unholy Strength buff."]], "Cooldown": "", "data": ["Attack Damage Bonus: 31", "Strength Bonus: 25", "Armor Bonus: 4", "Health Cost per Second: 45"], "types": {"Affects": ["Self"], "Ability": ["Toggle"], "Damage": ["Pure", "HP Removal"]}}}], "availability": [], "cost": "2370 (550)", "details": {"Bonus": ["+7 Health regeneration", "+9 Attack damage", "+5 Armor", "+25 Attack speed"], "Alert allies?": ["No"], "builds_into": [], "Disassemble?": ["No"], "Active": ["Unholy Strength"], "builds_from": ["Helm of Iron Will", "Gloves of Haste", "Blades of Attack", "Recipe"]}, "lore": "Weapon of choice among brutes, the bearer sacrifices his life energy to gain immense strength and power.", "type": "Weapons", "additional_info": ["Attack damage, attack speed, armor and health regeneration bonuses of multiple Armlets of Mordiggian do not stack.", "One Armlet of Mordiggian grants the following:\n While toggled off, grants a total of 7 health regeneration, 5 armor, 25 attack speed and 9 attack damage.\n While toggled on, grants a total of 500 health, 7.75 health regeneration, 9 armor, 25 attack speed and 40 (65 to strength heroes) attack damage.", "While toggled off, grants a total of 7 health regeneration, 5 armor, 25 attack speed and 9 attack damage.", "While toggled on, grants a total of 500 health, 7.75 health regeneration, 9 armor, 25 attack speed and 40 (65 to strength heroes) attack damage."]}, "Dust of Appearance": {"abilities": [{"Reveal": {"special_details": [], "modifiers": {"Item Dustofappearance: Dispellable with any dispel.": "red"}, "description": "Reveals and slows invisible Heroes in a nearby area.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Interrupts the user's channeling spells upon using.", "Places a debuff on enemies (including visible ones) within the radius upon cast. Leaving or entering the area afterwards has no effect.", "Unlike the visual effect, the Reveal debuff is applied within the entire radius instantly upon cast.", "Multiple debuffs do not stack, but refresh the duration instead.", "Can place the debuff on units in the Fog of War and invulnerable units, but not on hidden units or on wards.", "Cannot detect units under the effect of  Shadow Dance and  Smoke of Deceit (although the debuff is still placed on them).", "Only slows units when they actually are invisible. This means during the fade time or fade delay of invisibility, the unit is not slowed."], "Cooldown": "", "data": ["Radius: 1050", "Move Speed Slow: 20%", "Duration: 12"], "types": {"Affects": ["Enemies"], "Ability": ["No Target"]}}}], "availability": [], "cost": "180 ", "details": {"Charges": ["2"], "Alert allies?": ["No"], "builds_into": [], "Disassemble?": ["No"], "Active": ["Reveal"], "builds_from": []}, "lore": "One may hide visage, but never volume.", "type": "Consumables", "additional_info": ["Stacks with itself in the inventory.", "Dust of Appearance is completely shareable."]}, "Silver Edge": {"abilities": [{"Shadow Walk": {"special_details": ["PARTIAL_PIERCE_SPELL_IMMUNE Applies damage on spell immune enemies. Does not apply debuff on spell immune enemies."], "modifiers": {"Silver Edge Debuff: Undispellable.": "green", "Item Silver Edge Windwalk: Undispellable.": "green"}, "description": "Makes you invisible until the duration ends, or until you attack or cast a spell. While invisible, you move 20% faster and can move through units. Attacking to end the invisibility will deal 225 bonus damage to the target, disable their passive abilities, and reduce their damage output.", "Mana": "", "ability_special": ["PARTIAL_PIERCE_SPELL_IMMUNE"], "notes": ["The attack out of Silver Edge's Shadow Walk cannot miss.", "Does not interrupt the owner's channeling spells upon cast.", "The bonus damage is directly added to the attack damage, so it can be reduced with e.g.  Enfeeble or  Static Link.", ["However, it cannot be amplified with e.g.  Empower or the  Double Damage Rune.", "The damage is considered by lifesteal, cleave, splash ( Elder Dragon Form) and  Psi Blades, but not by crits."], "The bonus damage is not applied when attacking wards and buildings out of the invisibility.", "Applies a damage reduction and a break on the target when attacking from invisibility, disabling passive abilities.", "Places the debuff upon before the attack damage is applied, but still relies on the attack (or projectile) to hit.", "Directly reduces any damage the debuffed target deals, before any other reductions. This includes damage from spells.", "The invisibility is lost upon reaching the cast point of spells, or upon finishing an attack (for ranged heroes upon projectile launch).", "Allows the user to pass through other units, including wards, but not through buildings.", "The user can pick up and drop items without breaking the invisibility.", "Shares cooldown with  Shadow Blade."], "Cooldown": "", "data": ["Fade Time: 0.3", "Damage: 225", "Invisibility Duration: 14", "Enemy Damage Reduction: 50%", "Reduction Duration: 5"], "types": {"Affects": ["Self / Enemies"], "Ability": ["No Target"], "Damage": ["Physical"]}}}], "availability": [], "cost": "5100 (300)", "details": {"Bonus": ["+15 Strength", "+15 Agility", "+15 Intelligence", "+30 Attack damage", "+30 Attack speed"], "Alert allies?": ["No"], "builds_into": [], "Disassemble?": ["Yes"], "Active": ["Shadow Walk"], "builds_from": ["Shadow Blade", "Ultimate Orb", "Recipe"]}, "lore": "Once used to slay an unjust king, only to have the kingdom erupt into civil war in the aftermath.", "type": "Weapons", "additional_info": ["One Silver Edge grants a total of 300 health, 0.45 health regeneration, 2.14 armor, 45 attack speed, 180 mana, 0.6 mana regeneration, 0.9375% spell damage and 45 attack damage."]}, "Vitality Booster": {"abilities": [], "availability": ["SECRET_SHOP", "SIDE_SHOP"], "cost": "1100 ", "details": {"Bonus": ["+250 Health"], "builds_from": [], "builds_into": ["Heart of Tarrasque", "Soul Booster", "Rod of Atos", "Vanguard"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "A ruby gemstone that has been passed down through generations of warrior kin.", "type": "Secret Shop", "additional_info": []}, "Headdress": {"abilities": [{"Regeneration Aura": {"special_details": [], "modifiers": {"Item Headdress Aura: Undispellable.": "green"}, "description": "Restores health to allies in a 900 unit radius.Multiple instances of Regeneration Aura do not stack.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Stacks with all other sources of flat health regeneration, except with Regeneration Aura from multiple Headdresses.", "Regenerates up to 180 health in one minute.", "Places the buff on illusions, but they do not benefit from it.", "Does not affect wards, buildings and invulnerable units.", "The aura's buff lingers for 0.5 seconds."], "Cooldown": "", "data": ["Radius: 900", "Health Regeneration Bonus: 3"], "types": {"Affects": ["Allies"], "Ability": ["Aura"]}}}], "availability": [], "cost": "575 (200)", "details": {"Bonus": ["+2 Strength", "+2 Agility", "+2 Intelligence"], "Alert allies?": ["No"], "builds_into": ["Pipe of Insight", "Mekansm", "Vladmir's Offering"], "Passive": ["Regeneration Aura"], "Disassemble?": ["No"], "builds_from": ["Ring of Regen", "Iron Branch", "Recipe"]}, "lore": "Creates a soothing aura that restores allies in battle.", "type": "Support", "additional_info": ["One Headdress grants a total of 40 health, 3.06 health regeneration, 0.29 armor, 2 attack speed, 24 mana, 0.08 mana regeneration, 0.125% spell damage and 2 attack damage."]}, "Eul's Scepter of Divinity": {"abilities": [{"Cyclone": {"special_details": ["PARTIAL_PIERCE_SPELL_IMMUNE Can be cast on self while spell immune.Cannot be cast on spell immune enemies."], "modifiers": {"Eul Cyclone: Dispellable with any dispel.": "green"}, "description": "Sweeps a target unit up into cyclone, making them invulnerable for 2.5 seconds. Cyclone can be cast on yourself. Enemy units take 50 magical damage upon landing.", "Mana": "", "ability_special": ["BLOCKED_BY_LINKEN", "PARTIAL_PIERCE_SPELL_IMMUNE"], "notes": ["Double clicking the item casts it on self.", "Can only target enemies, self or own  Meepo clones and  Tempest Doubles. Cannot target other allies, wards, or buildings.", "Applies a cyclone effect on the target upon cast, so it dispels, turns it invulnerable and fully disables it.", "While in the air, other units may pass below the cycloned unit.", "The damage is applied at the end of the duration. If the cyclone gets purged, it still applies the damage as soon as the target lands.", "The damage is only applied to enemy targets.", "Can be cast on Roshan, but has no effect, since Roshan is immune to forced movement. The damage is still applied."], "Cooldown": "", "data": ["Cast Range: 575", "Damage: 50", "Duration: 2.5"], "types": {"Affects": ["Enemies / Self"], "Ability": ["Target Unit"], "Damage": ["Magical"]}}}], "availability": [], "cost": "2735 (650)", "details": {"Bonus": ["+10 Intelligence", "+150% Mana regeneration", "+40 Movement Speed"], "Alert allies?": ["No"], "builds_into": [], "Disassemble?": ["No"], "Active": ["Cyclone"], "builds_from": ["Staff of Wizardry", "Wind Lace", "Void Stone", "Recipe"]}, "lore": "A mysterious scepter passed down through the ages, its disruptive winds can be used for good or evil.", "type": "Caster", "additional_info": ["Movement speed bonuses from multiple scepters of divinity fully stack.", "Stacks with all other movement speed bonuses.", "One Eul's Scepter of Divinity grants a total of 40 movement speed, 120 mana, 0.4 (+ 150%) mana regeneration and 0.625% spell damage (and 10 attack damage to intelligence heroes)."]}, "Linken's Sphere": {"abilities": [{"Spellblock": {"special_details": [], "modifiers": {}, "description": "Blocks most targeted spells once every 13 seconds.", "Mana": "", "ability_special": ["ILLUSIONS_CANNOT_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Does not block spells cast by allies.", "Does not block  Ion Shell,  Repel,  Toss and  Snowball.", "Does not block  Urn of Shadows,  Medallion of Courage and  Solar Crest.", "For a list of blocked spells, see below."], "Cooldown": "", "data": [], "types": {"Affects": ["Self"], "Ability": ["Passive"]}}}, {"Transfer Spellblock": {"special_details": ["ILLUSIONS_CANNOT_USE The buff can be transfered to illusions, however it does not block a spell for them."], "modifiers": {"Item Sphere Target: Undispellable.": "green"}, "description": "Temporarily removes Spellblock from the item's owner and transfers it to an allied unit.", "Mana": "", "ability_special": ["ILLUSIONS_CANNOT_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Double clicking the item casts it on self. Although targeting self makes no difference.", "Multiple instances of the buff work fully independently from each other.", ["This means it is possible to cast two instances on the same allied hero, and each buff can block one spell.", "This also means that when an ally places the Linken's buff on a hero that has its own Linken's Sphere, both can block a spell. The allied buff is used up first in this case."], "Puts Linken's Sphere on cooldown upon transferring the buff. During this period, it does not block spells on the owner.", "Goes into cooldown once again when the buff blocks a spell on the targeted allied hero.", "Does not go into cooldown when the buff did not block a spell and expired.", "Can be cast on creep-heroes."], "Cooldown": "", "data": ["Cast Range: 700", "Buff Duration: 13"], "types": {"Affects": ["Allied Heroes"], "Ability": ["Target Unit"]}}}], "availability": [], "cost": "4800 (1000)", "details": {"Bonus": ["+15 Strength", "+15 Agility", "+15 Intelligence", "+6 Health regeneration", "+150% Mana regeneration", "+15 Attack damage"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Spellblock"], "Disassemble?": ["No"], "Active": ["Transfer Spellblock"], "builds_from": ["Perseverance", "Ultimate Orb", "Recipe"]}, "lore": "This magical sphere once protected one of the most famous heroes in history.", "type": "Armor", "additional_info": ["One Linken's Sphere grants a total of 300 health, 6.45 health regeneration, 2.14 armor, 15 attack speed, 180 mana, 0.6 (+ 150%) mana regeneration, 0.9375 spell damage and 30 attack damage."]}, "Robe of the Magi": {"abilities": [], "availability": ["SIDE_SHOP"], "cost": "450 ", "details": {"Bonus": ["+6 Intelligence"], "builds_from": [], "builds_into": ["Blade Mail", "Diffusal Blade", "Oblivion Staff", "Power Treads"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "This robe corrupts the soul of the user, but provides wisdom in return.", "type": "Attributes", "additional_info": ["One Robe of the Magi grants a total of 72 mana, 0.24 mana regeneration and 0.375% spell damage (and 6 attack damage to intelligence heroes)."]}, "Oblivion Staff": {"abilities": [], "availability": ["SIDE_SHOP"], "cost": "1650 ", "details": {"Bonus": ["+6 Intelligence", "+75% Mana regeneration", "+15 Attack damage", "+10 Attack speed"], "builds_from": ["Quarterstaff", "Robe of the Magi", "Sage's Mask"], "builds_into": ["Orchid Malevolence", "Echo Sabre"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "Deceptively hidden as an ordinary quarterstaff, it is actually very powerful, much like the Eldritch who originally possessed it.", "type": "Common", "additional_info": ["One Oblivion Staff grants a total of 10 attack speed, 72 mana, 0.24 (+ 75%) mana regeneration, 0.375% spell damage and 15 (21 to intelligence heroes) attack damage."]}, "Bracer": {"abilities": [], "availability": [], "cost": "525 (210)", "details": {"Bonus": ["+6 Strength", "+3 Agility", "+3 Intelligence", "+3 Attack damage"], "builds_from": ["Circlet", "Gauntlets of Strength", "Recipe"], "builds_into": ["Drum of Endurance"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "The bracer is a common choice to toughen up defenses and increase longevity.", "type": "Common", "additional_info": ["One Bracer grants a total of 120 health, 0.18 health regeneration, 0.43 armor, 3 attack speed, 36 mana, 0.12 mana regeneration, 0.1875% spell damage and 6 (9 to strength heroes) attack damage."]}, "Daedalus": {"abilities": [{"Critical Strike": {"special_details": ["ILLUSIONS_CAN_USE Red critical numbers are before illusion and armor reduction."], "modifiers": {}, "description": "Grants each attack a chance to deal additional damage. Critical Strike does not work against buildings.", "Mana": "", "ability_special": ["NOT_UNIQUE_ATTACK_MODIFIER", "ILLUSIONS_CAN_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Increases attack damage by an average of 36%.", "The proc chances of multiple crit sources stack.", ["If two sources of critical strike proc at the same time, the higher multiplier has priority."], "Critical Strike uses pseudo-random distribution.", "Does not work against wards, buildings, and allied units."], "Cooldown": "", "data": ["Proc Chance: 30%", "Critical Damage: 220%"], "types": {"Affects": ["Enemies"], "Ability": ["Passive"]}}}], "availability": [], "cost": "5520 (1000)", "details": {"Bonus": ["+81 Attack damage"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Critical Strike"], "Disassemble?": ["No"], "builds_from": ["Crystalys", "Demon Edge", "Recipe"]}, "lore": "A weapon of incredible power that is difficult for even the strongest of warriors to control.", "type": "Weapons", "additional_info": ["In the original DotA, this item was called the \"Buriza-Do Kyanon\", a reference to a weapon (unique ballista) in Diablo II. \"Buriza-do Kyanon\" means \"Blizzard Cannon\" in Japanese.", "Daedalus is the Latin transcription of the Greek \"Daidalos\" which means \"clever worker\" in Ancient Greek and Daedalus is also one of the characters in Ovid's \"Metamorphoses\" who was a skillful craftsman and artisan.", "Considering Crystalys gives 34.5 + 15% effective damage; if you have 41 or more damage Crystalys is better value for your gold than Demon Edge."]}, "Ogre Club": {"abilities": [], "availability": [], "cost": "1000 ", "details": {"Bonus": ["+10 Strength"], "builds_from": [], "builds_into": ["Aghanim's Scepter", "Black King Bar", "Sange", "Dragon Lance", "Echo Sabre"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "You grow stronger just by holding it.", "type": "Attributes", "additional_info": ["One Ogre Club grants a total of 200 health and 0.3 health regeneration (and 10 attack damage to strength heroes)."]}, "Claymore": {"abilities": [], "availability": [], "cost": "1400 ", "details": {"Bonus": ["+21 Attack damage"], "builds_from": [], "builds_into": ["Battle Fury", "Shadow Blade"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "A sword that can cut through armor, it's a commonly chosen first weapon for budding swordsmen.", "type": "Armaments", "additional_info": []}, "Heaven's Halberd": {"abilities": [{"Disarm": {"special_details": ["NO_PIERCE_SPELL_IMMUNE Disarm persists if debuff was placed before spell immunity and when not dispelled. Can be dispelled by spell immunity only."], "modifiers": {"Heavens Halberd Debuff: Undispellable.": "red"}, "description": "Prevents a target from attacking. Lasts 3 seconds on melee targets, and 5.5 seconds on ranged targets.", "Mana": "", "ability_special": ["BLOCKED_BY_LINKEN", "NO_PIERCE_SPELL_IMMUNE"], "notes": [], "Cooldown": "", "data": ["Cast Range: 600", "Duration (Melee): 3", "Duration (Ranged): 5.5"], "types": {"Affects": ["Enemies"], "Ability": ["Target Unit"]}}}, {"Lesser Maim": {"special_details": ["NO_PIERCE_SPELL_IMMUNE Slow persists if debuff was placed before spell immunity and when not dispelled."], "modifiers": {"Heavens Halberd Buff: Dispellable with any dispel.": "red"}, "description": "Each attack has a chance to slow the enemy's movement and attack speed for 4 seconds. The slow is based on whether the equipped hero is melee or ranged.", "Mana": "", "ability_special": ["NOT_UNIQUE_ATTACK_MODIFIER", "ILLUSIONS_CANNOT_USE", "NO_PIERCE_SPELL_IMMUNE"], "notes": ["Successive procs on the same target do not stack, but refresh the duration instead.", "The proc chances of Lesser Maim from multiple Heaven's Halberds work fully independently from each other.", "Fully stacks with the Lesser Maim from  Sange and the Greater Maim from  Sange and Yasha, including the slow.", "Does not work against wards and buildings. Works against allied units.", "Lesser Maim uses pseudo-random distribution."], "Cooldown": "", "data": ["Proc Chance: 20%", "Move Speed Slow (Melee): 20%", "Attack Speed Slow (Melee): 20", "Move Speed Slow (Ranged): 10%", "Attack Speed Slow (Ranged): 10", "Slow Duration: 4"], "types": {"Affects": ["Enemies"], "Ability": ["Passive"]}}}], "availability": [], "cost": "3750 ", "details": {"Bonus": ["+20 Strength", "+25 Attack damage", "+25% Evasion"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Lesser Maim"], "Disassemble?": ["Yes"], "Active": ["Disarm"], "builds_from": ["Sange", "Talisman of Evasion"]}, "lore": "This halberd moves with the speed of a smaller weapon, allowing the bearer to win duels that a heavy edge would not.", "type": "Weapons", "additional_info": ["The evasion stacks diminishingly with other sources of evasion.", "The evasion uses pseudo-random distribution.", "One Heaven's Halberd grants a total of 400 health, 0.6 health regeneration and 25 (45 to strength heroes) attack damage."]}, "Octarine Core": {"abilities": [{"Cooldown Reduction": {"special_details": [], "modifiers": {}, "description": "Reduces the cooldown time of all spells and items by 25%.", "Mana": "", "ability_special": ["ILLUSIONS_CAN_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Cooldown Reduction of multiple Octarine Cores does not stack.", "Reduces the cooldown of active, passive and item abilities as well as the replenish time of charge-based abilities.", "The cooldown reduction is not updated dynamically. Only abilities cast while having Octarine Core get their cooldowns reduced.", "Visually reduces the cooldown of  Tranquil Boots, but does not affect it.", "Does not affect  Cloak and Dagger and  Drunken Brawler's certain crit/evasion timers.", "When using  Guardian Greaves's Mend while having Octarine Core, its heal restriction timer is reduced by 10 seconds, too.", "Stacks multiplicatively with the cooldown reduction of  Arcane Rune."], "Cooldown": "", "data": ["Ability Cooldown Reduction: 25%"], "types": {"Affects": ["Self"], "Ability": ["Passive"]}}}, {"Spell Lifesteal": {"special_details": [], "modifiers": {}, "description": "A percentage of damage caused by spells is returned to the caster as health.", "Mana": "", "ability_special": ["ILLUSIONS_CAN_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Spell Lifesteal of multiple Octarine Cores does not stack.", "Heals from any damage the owner does (except damage from attacks), against enemies or allies.", "Does not heal from damage done against buildings, wards or self.", "Heals from all three damage types and from many instantly killing effects.", "Heals from damage dealt after all reductions.", "In order for it to heal, the damage source must be the owner. Damage done by its summons (including wards) does not heal."], "Cooldown": "", "data": ["Hero Spell Lifesteal: 25%", "Creep Spell Lifesteal: 5%"], "types": {"Affects": ["Self"], "Ability": ["Passive"]}}}], "availability": ["SECRET_SHOP"], "cost": "5900 ", "details": {"Bonus": ["+25 Intelligence", "+425 Health", "+425 Mana", "+50% Mana regeneration"], "Alert allies?": ["Yes"], "builds_into": [], "Passive": ["Cooldown Reduction", "Spell Lifesteal"], "Disassemble?": ["Yes"], "builds_from": ["Mystic Staff", "Soul Booster"]}, "lore": "At the core of spellcraft are spectrums only the very gifted can sense.", "type": "Caster", "additional_info": ["One Octarine Core grants a total of 425 health, 725 mana, 1 (+ 50%) mana regeneration and 1.5625% spell damage (and 25 attack damage to intelligence heroes)."]}, "Butterfly": {"abilities": [{"Flutter": {"special_details": ["ILLUSIONS_CANNOT_USE Illusions created during Flutter still have evasion and not the movement speed bonus."], "modifiers": {"Item Butterfly Extra: Undispellable.": "green"}, "description": "Trade evasion for 35% additional movement speed for 4 seconds.", "Mana": "", "ability_special": ["ILLUSIONS_CANNOT_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Interrupts the owner's channeling spells upon cast.", "Only evasion granted by all Butterflies in the inventory is lost for the duration. Other sources of evasion still work."], "Cooldown": "", "data": ["Move Speed Bonus: 35%", "Duration: 4"], "types": {"Affects": ["Self"], "Ability": ["No Target"]}}}], "availability": [], "cost": "5775 ", "details": {"Bonus": ["+35 Agility", "+30 Attack damage", "+35% Evasion", "+30 Attack speed"], "Alert allies?": ["No"], "builds_into": [], "Disassemble?": ["No"], "Active": ["Flutter"], "builds_from": ["Eaglesong", "Talisman of Evasion", "Quarterstaff"]}, "lore": "Only the mightiest and most experienced of warriors can wield the Butterfly, but it provides incredible dexterity in combat.", "type": "Weapons", "additional_info": ["The evasion stacks diminishingly with other sources of evasion.", "The evasion uses pseudo-random distribution.", "One Butterfly grants a total of 5 armor, 65 attack speed and 30 (65 to agility heroes) attack damage."]}, "Quelling Blade": {"abilities": [{"Chop Tree or Ward": {"special_details": [], "modifiers": {}, "description": "Destroy a target tree or ward. Chop cast range is increased when targetting wards.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Can only target trees (including  Sprout trees) and enemy  Observer Wards and  Sentry Wards.", "Can also target all of an enemy  Techies' mines, using the same cast range as for wards.", "Does not share cooldown with  Battle Fury or  Iron Talon."], "Cooldown": "", "data": ["Cast Range (Tree): 350", "Cast Range (Ward): 450"], "types": {"Affects": ["Trees  / Enemy Units"], "Ability": ["Target Unit"]}}}, {"Quell": {"special_details": ["ILLUSIONS_CAN_USE The bonus damage is also affected by the illusions' attack damage penalty."], "modifiers": {}, "description": "Increases attack damage against non-hero units, based on whether the equipped hero is ranged or melee. Does not provide bonus damage against Roshan.", "Mana": "", "ability_special": ["NOT_UNIQUE_ATTACK_MODIFIER", "ILLUSIONS_CAN_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Multiple sources of Quell ( Iron Talon,  Battle Fury or another Quelling Blade) do not stack.", "Only increases base damage and that provided by attributes. Attack damage bonuses are not increased.", "The bonus damage does not apply when attacking friendly units (i.e. denying own creeps).", "When the owner's attack type changes to ranged or melee, the attack damage bonus adapts immediately.", "Kunkka doesn't benefit from quell when he does't learn  Tidebringer.", "Quell fully works with crits, cleaves and lifesteal. When having cleave, attacking a creep cleaves the increased damage in the area.", ["However, if the unit has  Tidebringer, the attack which procs it is not increased by Quell.", "When  Tidebringer is on cooldown, the attack will be increased by Quell."], "Elder Dragon Form's splash also splashes the increased damage when attacking a creep.", "The damage  Moon Glaive bounces are not increased, since they are based on the attacker's attack damage value.", "Psi Blades will spread the increased damage when attacking a creep.", "Does not work against wards, buildings, Roshan,  Lone Druid's Spirit Bear and allied units."], "Cooldown": "", "data": ["Attack Damage Bonus (Melee): 40%", "Attack Damage Bonus (Ranged): 15%"], "types": {"Affects": ["Enemy Units"], "Ability": ["Passive"]}}}], "availability": ["SIDE_SHOP"], "cost": "200 ", "details": {"Alert allies?": ["No"], "builds_into": ["Battle Fury", "Iron Talon"], "Passive": ["Quell"], "Disassemble?": ["No"], "Active": ["Chop Tree or Ward"], "builds_from": []}, "lore": "The axe of a fallen gnome, it allows you to effectively maneuver the forest.", "type": "Armaments", "additional_info": ["In-game model"]}, "Broadsword": {"abilities": [], "availability": [], "cost": "1200 ", "details": {"Bonus": ["+18 Attack damage"], "builds_from": [], "builds_into": ["Battle Fury", "Blade Mail", "Crystalys"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "The classic weapon of choice for knights, this blade is sturdy and reliable for slaying enemies.", "type": "Armaments", "additional_info": []}, "Circlet": {"abilities": [], "availability": [], "cost": "165 ", "details": {"Bonus": ["+2 Strength", "+2 Agility", "+2 Intelligence"], "builds_from": [], "builds_into": ["Bracer", "Null Talisman", "Wraith Band", "Magic Wand"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "An elegant circlet designed for human princesses.", "type": "Attributes", "additional_info": ["One Circlet grants a total of 40 health, 0.06 health regeneration, 0.29 armor, 2 attack speed, 24 mana, 0.08 mana regeneration, 0.125% spell damage and 2 attack damage."]}, "Abyssal Blade": {"abilities": [{"Overwhelm": {"special_details": [], "modifiers": {"Bashed: Dispellable with strong dispels.": "red"}, "description": "Stuns a target enemy unit for 2 seconds. Pierces Spell Immunity.", "Mana": "", "ability_special": ["BLOCKED_BY_LINKEN", "PIERCE_SPELL_IMMUNE"], "notes": [], "Cooldown": "", "data": ["Cast Range: 140", "Stun Duration: 2"], "types": {"Affects": ["Enemies"], "Ability": ["Target Unit"]}}}, {"Bash": {"special_details": [], "modifiers": {"Bashed: Dispellable with strong dispels.": "red"}, "description": "Grants each attack a chance to stun the target for 1.4 seconds and deal 85 bonus damage, based on whether the equipped hero is ranged or melee.", "Mana": "", "ability_special": ["NOT_UNIQUE_ATTACK_MODIFIER", "ILLUSIONS_CANNOT_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Abyssal Blade's bash does not stack with the bash of  Skull Basher and other Abyssal Blades.", "When obtaining multiple items with the bash ability, only the first bought one's bash works while the others are disabled.", "The mini-bash ability of  Monkey King Bar is not treated as a bash, and it works fully independently from other bashes.", "The bonus damage from Bash can be lifestealed off. However, it cannot crit or cleave.", "The damage can be reduced with e.g.  Enfeeble or  Static Link.", ["However, it cannot be amplified with e.g.  Empower or the  Double Damage Rune."], "Adds an average of 21.25 damage to every attack for melee heroes, and 8.5 damage for ranged heroes.", "Does not work against wards and buildings, but works against allied units.", "Bash uses pseudo-random distribution."], "Cooldown": "", "data": ["Proc Chance (Melee): 25%", "Proc Chance (Ranged): 10%", "Damage: 85", "Stun Duration: 1.4"], "types": {"Affects": ["Enemies"], "Ability": ["Passive"], "Damage": ["Magical"]}}}, {"Damage Block": {"special_details": [], "modifiers": {}, "description": "Makes the wielder block damage from each incoming attack based on whether the equipped hero is melee or ranged.", "Mana": "", "ability_special": ["ILLUSIONS_CAN_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Does not work against wards ( Plague Ward,  Mass Serpent Ward,  Death Ward).", "Does not reduce physical damage from spells, except from  Moon Glaive and  The Swarm.", "Damage Block uses pseudo-random distribution.", "For more details, see Damage Block."], "Cooldown": "", "data": ["Proc Chance: 100%", "Blocked Damage (Melee): 40", "Blocked Damage (Ranged): 20"], "types": {"Affects": ["Self"], "Ability": ["Passive"]}}}], "availability": [], "cost": "6400 (1550)", "details": {"Bonus": ["+10 Strength", "+250 Health", "+15 Health regeneration", "+10 Attack damage"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Bash", "Damage Block"], "Disassemble?": ["Yes"], "Active": ["Overwhelm"], "builds_from": ["Vanguard", "Skull Basher", "Recipe"]}, "lore": "The lost blade of the Commander of the Abyss, this edge cuts into an enemy's soul.", "type": "Weapons", "additional_info": ["When held by Slardar, Spirit Breaker, Troll Warlord or Faceless Void, Bash cannot proc.", "One Abyssal Blade grants a total of 450 health, 15.3 health regeneration and 10 (20 to strength heroes) attack damage."]}, "Battle Fury": {"abilities": [{"Chop Tree or Ward": {"special_details": [], "modifiers": {}, "description": "Destroy a target tree or ward. Chop cast range is increased when targetting wards.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Can only target trees (including  Sprout trees) and enemy  Observer Wards and  Sentry Wards.", "Can also target all of an enemy  Techies' mines, using the same cast range as for wards.", "Does not share cooldown with  Quelling Blade or  Iron Talon."], "Cooldown": "", "data": ["Cast Range (Tree): 350", "Cast Range (Ward): 450"], "types": {"Affects": ["Trees  / Enemy Units"], "Ability": ["Target Unit"]}}}, {"Quell": {"special_details": ["ILLUSIONS_CAN_USE The bonus damage is also affected by the illusions' attack damage penalty."], "modifiers": {}, "description": "Increases attack damage against non-hero units, based on whether the equipped hero is ranged or melee. Does not provide bonus damage against Roshan.", "Mana": "", "ability_special": ["NOT_UNIQUE_ATTACK_MODIFIER", "ILLUSIONS_CAN_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Multiple sources of Quell ( Quelling Blade,  Iron Talon or another Battle Fury) do not stack.", "Only increases base damage and that provided by attributes. Attack damage bonuses are not increased.", "The bonus damage does not apply when attacking friendly units (i.e. denying own creeps).", "When the owner's attack type changes to ranged or melee, the attack damage bonus adapts immediately.", "Kunkka doesn't benefit from quell when he does't learn  Tidebringer.", "Quell fully works with crits, cleaves and lifesteal. When having cleave, attacking a creep cleaves the increased damage in the area.", ["However, if the unit has  Tidebringer, the attack which procs it is not increased by Quell.", "When  Tidebringer is on cooldown, the attack will be increased by Quell."], "Elder Dragon Form's splash also splashes the increased damage when attacking a creep.", "The damage  Moon Glaive bounces are not increased, since they are based on the attacker's attack damage value.", "Psi Blades will spread the increased damage when attacking a creep.", "Does not work against wards, buildings, Roshan,  Lone Druid's Spirit Bear and allied units."], "Cooldown": "", "data": ["Attack Damage Bonus (Melee): 60%", "Attack Damage Bonus (Ranged): 25%"], "types": {"Affects": ["Enemy Units"], "Ability": ["Passive"]}}}, {"Cleave": {"special_details": ["ILLUSIONS_CANNOT_USE Visual effects and sounds still play when illusions attack."], "modifiers": {}, "description": "Deals a percent of attack damage in a 280 area around the target. Ranged units cannot Cleave.", "Mana": "", "ability_special": ["NOT_UNIQUE_ATTACK_MODIFIER", "ILLUSIONS_CANNOT_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Cleave damage is reduced by armor type but not by armor value.", "Cleave damage is reduced by Damage Block.", "The cleave damages a circular area in front of the owner.", "Fully stacks with other sources of cleaves. Each source of cleave works completely independent.", "Does not cleave upon attacking wards, buildings or allied units. Wards and buildings are unaffected by cleave.", "Despite the visual effect, cleave damage is applied instantly in the whole area.", "Ranged units cannot cleave."], "Cooldown": "", "data": ["Cleave Radius: 280", "Cleave Damage: 35%"], "types": {"Affects": ["Enemies"], "Ability": ["Passive"], "Damage": ["Physical"]}}}], "availability": [], "cost": "4500 ", "details": {"Bonus": ["+6 Health regeneration", "+150% Mana regeneration", "+55 Attack damage"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Cleave", "Quell"], "Disassemble?": ["No"], "Active": ["Chop Tree or Ward"], "builds_from": ["Claymore", "Broadsword", "Perseverance", "Quelling Blade"]}, "lore": "The bearer of this mighty axe gains the ability to cut down swaths of enemies at once.", "type": "Weapons", "additional_info": ["Anti-Mage needs Battle Fury to farm, since he is terrible without items and has trouble farming fast without it. Combined with Blink, he can flash-farm the jungle and quickly build his much needed items if not ganked.", "Phantom Assassin does not necessarily need it, but it helps her farm and build items quicker. Know this will reduce her ability to get early kills so she will have to farm in times she could fight.", "Juggernaut can farm really fast with it when combined with his base attack time. He can pick up the Ring of Health and Void Stone at the side shop during the laning phase, allowing him to use his abilities more often and ignore harrasment.", "Battle Fury is a must for Ember Spirit, since almost his entire damage output relies on Sleight of Fist, which can deal enormous damage with Battle Fury but little without it. Ember Spirit is also the most reliable carrier of multiple Battlefuries, since each one greatly increases his damage and unlike other carries, he stays safe during Sleight of Fist while it greatly weakens the survivability of other carriers by having multiple Battlefuries.", "Tusk can get Battle Fury if he is built to get the most out of his Walrus PUNCH!, which you will see many do. Battlefury gives him the ability to damage more than 1 enemy with his punch, giving \"Carry Tusk\" more teamfight presence", "Troll Warlord can get Battlefury, but this is very situational. Troll Warlord can be a melee hero and can farm the jungle much more efficiently with Battlefury, but he needs items which help him fight and deal damage such as Daedalus and Monkey King Bar. Furthermore, Battlefury's cleave will not work while you are ranged, so you will lose the cleave effect when attacking opponents from range."]}, "Mantle of Intelligence": {"abilities": [], "availability": [], "cost": "150 ", "details": {"Bonus": ["+3 Intelligence"], "builds_from": [], "builds_into": ["Null Talisman"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "A beautiful sapphire mantle worn by generations of queens.", "type": "Attributes", "additional_info": ["One Mantle of Intelligence grants a total of 36 mana, 0.12 mana regeneration and 0.1875% spell damage (and 3 attack damage to intelligence heroes)."]}, "Hood of Defiance": {"abilities": [{"Barrier": {"special_details": [], "modifiers": {"Item Hood Of Defiance Barrier: Undispellable.": "green"}, "description": "Creates a spell shield that absorbs up to 325 magical damage.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Interrupts the user's channeling spells upon cast.", "Blocks damage before any reductions, except when spell immune, during which it does not block any magical damage.", "Recasting the ability refreshes the buff and resets the barrier's absorb capacity.", "Does not stack with other magical damage barriers.", ["If multiple sources of barriers are active on a unit, all of them lose capacity from the same absorbed damage instance."], "Does not share cooldown with  Pipe of Insight."], "Cooldown": "", "data": ["Magical Damage Absorbed: 325", "Duration: 12"], "types": {"Affects": ["Self"], "Ability": ["No Target"]}}}], "availability": ["SIDE_SHOP"], "cost": "1725 ", "details": {"Bonus": ["+8 Health regeneration", "+30% Magic resistance"], "Alert allies?": ["No"], "builds_into": ["Pipe of Insight"], "Disassemble?": ["No"], "Active": ["Barrier"], "builds_from": ["Ring of Health", "Cloak", "Ring of Regen"]}, "lore": "A furred, magic resistant headpiece that is feared by wizards.", "type": "Armor", "additional_info": ["Stacks multiplicatively with other sources of magic resistance."]}, "Shiva's Guard": {"abilities": [{"Arctic Blast": {"special_details": ["NO_PIERCE_SPELL_IMMUNE Slow persists if debuff was placed before spell immunity and when not dispelled."], "modifiers": {"Item Shivas Guard Blast: Dispellable with any dispel.": "red"}, "description": "Emits a freezing wave that deals 200 magical damage to enemies and slows their movement by 40% for 4 seconds.", "Mana": "", "ability_special": ["NO_PIERCE_SPELL_IMMUNE"], "notes": ["Does not interrupt the user's channeling spells upon cast.", "The blast spreads at a speed of 350 and takes 2.57 seconds to reach maximum range and dissipate.", "The area of effect is centered around the owner, so when moving or blinking, the radius moves along.", "The blast is not a ring. It affects every enemy within the blast's expanding area of effect.", ["This means that unlike with  Ravage, it is not possible to avoid the effect by blinking \"over\" the edge towards the caster."], "Provides 800 radius flying vision, following the caster and leaving a trail of vision which lasts for 2 seconds."], "Cooldown": "", "data": ["Radius: 900", "Damage: 200", "Move Speed Slow: 40%", "Slow Duration: 4"], "types": {"Affects": ["Enemies"], "Ability": ["No Target"], "Damage": ["Magical"]}}}, {"Freezing Aura": {"special_details": [], "modifiers": {"Item Shivas Guard Aura: Undispellable.": "red"}, "description": "Reduces the attack speed of all enemies in a 900 radius.", "Mana": "", "ability_special": ["ILLUSIONS_CAN_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Freezing Auras from multiple Shiva's Guards do not stack.", "The aura's debuff lingers for 0.5 seconds.", "The status debuff icon only shows up when the affected unit has vision over the Shiva's holder.", "Affects the attack speed of enemy illusions."], "Cooldown": "", "data": ["Radius: 900", "Attack Speed Slow: 45"], "types": {"Affects": ["Enemies"], "Ability": ["Aura"]}}}], "availability": [], "cost": "4700 (600)", "details": {"Bonus": ["+30 Intelligence", "+15 Armor"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Freezing Aura"], "Disassemble?": ["Yes"], "Active": ["Arctic Blast"], "builds_from": ["Mystic Staff", "Platemail", "Recipe"]}, "lore": "Said to have belonged to a goddess, today it retains much of its former power.", "type": "Armor", "additional_info": ["One Shiva's Guard grants a total of 15 armor, 360 mana, 1.2 mana regeneration and 1.875% spell damage (and 30 attack damage to intelligence heroes)."]}, "Sentry Ward": {"abilities": [{"Place Sentry Ward": {"special_details": [], "modifiers": {}, "description": "Plants a Sentry Ward, an invisible watcher that grants True Sight, the ability to see invisible enemy units and wards, to any existing allied vision within its range. Lasts 4 minutes.\nHold Control to give one Sentry Ward to an allied hero.", "Mana": "", "ability_special": [], "notes": ["Provides 150 radius ground vision at its location for 12 seconds.", "Cannot be placed inside the fountain area (including a small area in front of the ramp), or in Roshan's pit.", "Holding Control allows the owner to give an ally just one ward, instead of the whole stack.", "It is not possible to give couriers or  Lone Druid's Spirit Bear a Sentry Ward by holding Control.", "Sentry Wards can be targeted by enemy  Tangoes and  Quelling Blade (including its upgrades) to be instantly destroyed.", "Creep spawn ranges are shown before placing a ward, allowing camps to be blocked."], "Cooldown": "", "data": ["Cast Range: 500", "Duration: 240"], "types": {"Affects": ["Enemies"], "Ability": ["Target Area"]}}}, {"True Sight": {"special_details": [], "modifiers": {"Truesight: Undispellable.": "red"}, "description": "Adds the ability to see invisible units and wards to any allied vision within the Sentry Ward's range.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["The True Sight is provided in its whole area, it is not obstructed by anything.", "The True Sight is provided by an aura which affects enemies. Its effect lingers for 0.5 seconds.", "Cannot detect units under the effect of  Shadow Dance,  Smoke of Deceit and  Techies' mines within a 125 radius of an  Aghanim's Scepter upgraded  Minefield Sign."], "Cooldown": "", "data": ["Radius: 850"], "types": {"Affects": ["Enemies"], "Ability": ["Aura"]}}}, {"Invisibility": {"special_details": [], "modifiers": {}, "description": "This unit is permanently invisible.", "Mana": "", "ability_special": [], "notes": ["The ability and modifier are not displayed in-game."], "Cooldown": "", "data": ["Fade Time: 0"], "types": {"Affects": ["Self"], "Ability": ["Passive"]}}}], "availability": [], "cost": "200 ", "details": {"Charges": ["2"], "Alert allies?": ["No"], "builds_into": ["Observer and Sentry Wards"], "Disassemble?": ["No"], "Active": ["Place Sentry Ward"], "builds_from": []}, "lore": "A form of plant originally grown in the garden of a fearful king.", "type": "Consumables", "additional_info": ["Stacks with itself and with Observer Wards in inventory.", "Sentry Wards are completely shareable."]}, "Blight Stone": {"abilities": [{"Lesser Corruption": {"special_details": [], "modifiers": {"Blight Stone Buff: Dispellable with any dispel.": "red"}, "description": "Your attacks reduce target's armor for 8 seconds.", "Mana": "", "ability_special": ["UNIQUE_ATTACK_MODIFIER", "ILLUSIONS_CANNOT_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Successive attacks with Blight Stone do not stack the debuff, but refresh the duration instead.", "The target's armor is reduced before the attack damage is dealt, but still relies on the attack not to miss.", "Works against wards and buildings, but does not work against allied units.", "Stacks with the Corruption debuff of  Desolator (however, one hero cannot use both due to them being Unique Attack Modifiers)."], "Cooldown": "", "data": ["Armor Reduction: 2", "Duration: 8"], "types": {"Affects": ["Enemies"], "Ability": ["Passive"]}}}], "availability": ["SIDE_SHOP"], "cost": "300 ", "details": {"Passive": ["Lesser Corruption"], "builds_from": [], "builds_into": ["Desolator", "Medallion of Courage"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "An unnerving stone unearthed beneath the Fields of Endless Carnage.", "type": "Armaments", "additional_info": ["Ideal for a ranged support or ranged carry to harass lanes during the early game.", "Blight Stone is stronger if you can take advantage of how its armor reduction boosts ALL physical damage the target receives, such as that of your laning partner, lane creeps, or summoned units. It is less effective in more straightforward 1v1 scenarios.", "Useful for pushing towers early on, especially when used in tandem with the armor aura from Ring of Basilius and the assistance of additional allies."]}, "Monkey King Bar": {"abilities": [{"Mini-Bash": {"special_details": [], "modifiers": {"Bashed: Dispellable with strong dispels.": "red"}, "description": "Grants each attack a chance to deal bonus damage and deal a mini-stun.", "Mana": "", "ability_special": ["NOT_UNIQUE_ATTACK_MODIFIER", "ILLUSIONS_CANNOT_USE", "NO_PIERCE_SPELL_IMMUNE"], "notes": ["The proc chances of Mini-Bash from multiple Monkey King Bars work fully independently from each other.", ["However, in case of multiple procs happening on the same attack, the damage does not stack."], "The owner can lifesteal off the damage dealt by Mini-Bash. However, it cannot crit or cleave.", "The damage can be reduced with e.g.  Enfeeble or  Static Link.", ["However, it cannot be amplified with e.g.  Empower or the  Double Damage Rune."], "Does not work against wards and buildings, but works against allied units.", "Adds an average of 56 magical damage to every attack.", "Mini-Bash uses pseudo-random distribution."], "Cooldown": "", "data": ["Proc Chance: 35%", "Damage: 160", "Stun Duration: 0.01"], "types": {"Affects": ["Enemies"], "Ability": ["Passive"], "Damage": ["Magical"]}}}, {"True Strike": {"special_details": [], "modifiers": {}, "description": "Prevents your attacks from missing. True Strike does not work when attacking enemy structures.", "Mana": "", "ability_special": ["NOT_UNIQUE_ATTACK_MODIFIER", "ILLUSIONS_CAN_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Projectiles launched with True Strike cannot miss due to evasion or blindness, but can still be disjointed.", "Also prevents ranged attacks from missing due to the 25% uphill miss chance.", "Also prevents melee attacks from missing due to the target leaving the motion buffer range.", ["The motion buffer range is what allows melee attacks to hit their target as long as they stay within 300 range of the attacker."], "Does not work against buildings, works against any other unit, including wards and allied units.", "Does not prevent attacks from getting canceled when the target gets too far away during the attack animation."], "Cooldown": "", "data": [], "types": {"Affects": ["Self"], "Ability": ["Passive"]}}}], "availability": [], "cost": "5400 ", "details": {"Bonus": ["+66 Attack damage", "+15 Attack speed"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Mini-Bash", "True Strike"], "Disassemble?": ["No"], "builds_from": ["Demon Edge", "Javelin", "Javelin"]}, "lore": "A powerful staff used by a master warrior.", "type": "Weapons", "additional_info": ["Monkey King Bar's True Strike works against every form of miss chance, not only evasion. This means it is also a viable pickup when the enemy has sources of blind."]}, "Ring of Protection": {"abilities": [], "availability": [], "cost": "175 ", "details": {"Bonus": ["+2 Armor"], "builds_from": [], "builds_into": ["Ring of Basilius", "Tranquil Boots", "Iron Talon"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "A glimmering ring that defends its bearer.", "type": "Armaments", "additional_info": []}, "Hand of Midas": {"abilities": [{"Transmute": {"special_details": [], "modifiers": {}, "description": "Kills a non-hero target for 190 gold and 2.5x experience. Cannot be used on Ancient Creeps.", "Mana": "", "ability_special": ["NOT_BLOCKED_BY_LINKEN", "PIERCE_SPELL_IMMUNE"], "notes": ["Upon cast, kills the target unit instantly and grants the caster 190 reliable gold and 250% of the target's experience bounty.", "The target's default bounties are not granted. This means that no hero nearby gains the default gold and experience from the death.", "Despite the visual effects, the gold and experience are granted instantly.", "Deals damage equal to the target's current health to kill it. This damage fully ignores any form of reduction or amplification.", "This means that it triggers most on-damage events like (neutral or lane) creep aggro.", "Cannot be cast on couriers, wards, buildings, ancient creeps, Roshan, and  Necronomicon summons."], "Cooldown": "", "data": ["Cast Range: 600", "Gold Bonus: 190", "Experience Bonus Multiplier: 250%"], "types": {"Affects": ["Units"], "Ability": ["Target Unit"], "Damage": ["Pure", "HP Removal"]}}}], "availability": [], "cost": "2050 (1550)", "details": {"Bonus": ["+30 Attack speed"], "Alert allies?": ["No"], "builds_into": [], "Disassemble?": ["No"], "Active": ["Transmute"], "builds_from": ["Gloves of Haste", "Recipe"]}, "lore": "Preserved through unknown magical means, the Hand of Midas is a weapon of greed, sacrificing animals to line the owner's pockets.", "type": "Common", "additional_info": ["Assuming it is always used when off cooldown, it increases the user's GPM by 114, meaning it will take an absolute minimum of 18 minutes to pay for itself, or 13.6 minutes for the recipe."]}, "Soul Booster": {"abilities": [], "availability": ["SECRET_SHOP"], "cost": "3200 ", "details": {"Bonus": ["+425 Health", "+425 Mana", "+50% Mana regeneration"], "builds_from": ["Point Booster", "Vitality Booster", "Energy Booster"], "builds_into": ["Bloodstone", "Octarine Core"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "Regain lost courage.", "type": "Armor", "additional_info": []}, "Helm of the Dominator": {"abilities": [{"Dominate": {"special_details": [], "modifiers": {"Dominated: Undispellable.": "green", "Item Helm Of The Dominator Bonushealth: Dispellable with any dispel.": "green"}, "description": "Take control of a non-hero, non-ancient target unit and sets its movement speed to 350. If a dominated creep's base health is naturally below the health minimum, its base health will be raised to the health minimum.", "Mana": "", "ability_special": ["NOT_BLOCKED_BY_LINKEN", "PIERCE_SPELL_IMMUNE"], "notes": ["Dominating a creep while already having one dominated causes the previous dominated creep to die.", "The dominated creep is directly bound to the item it was dominated with.", ["This means it is possible to get multiple Helms and have a creep dominated with each.", "It also means when the dominated creep changes ownership again (e.g.  Enchant), dominating a new creep still causes it to die.", "When the item gets sold, destroyed, disassembled, or built into a  Satanic, the dominated creep dies.", "The death is not credited to anyone so that no one gets experience from it."], "Sets the target's movement speed to 350, regardless of its default movement speed.", "If the creep's maximum health is below 1400, its health is set to that value.", "If its health is below the minimum base health, it gets fully healed as well. If it is equal or above, then it does not get healed.", "Does not restore the creep's mana.", "Cannot dominate Roshan, ancient creeps,  Necronomicon summons and creep-heroes.", "Although the health buff is dispellable, doing so does not revert its health back to normal."], "Cooldown": "", "data": ["Cast Range: 700", "Max Units: 1", "Minimum Base Health: 1400", "Set Movement Speed: 350"], "types": {"Affects": ["Enemy Units"], "Ability": ["Target Unit"]}}}, {"Lifesteal": {"special_details": ["ILLUSIONS_CANNOT_USE Lifesteal particles are visible on illusions, but they do not gain health from their attacks.", "UNIQUE_ATTACK_MODIFIER Can be combined with Eye of Skadi's Unique Attack Modifier."], "modifiers": {}, "description": "Heals the attacker for a percentage of attack damage dealt.", "Mana": "", "ability_special": ["UNIQUE_ATTACK_MODIFIER", "ILLUSIONS_CANNOT_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["The lifesteal stacks additively with other sources of lifesteal which are not Unique Attack Modifiers.", "Cannot lifesteal off of wards, buildings and allied units."], "Cooldown": "", "data": ["Lifesteal: 15%"], "types": {"Affects": ["Self"], "Ability": ["Passive"]}}}], "availability": ["SIDE_SHOP"], "cost": "1800 ", "details": {"Bonus": ["+3 Health regeneration", "+20 Attack damage", "+5 Armor"], "Alert allies?": ["No"], "builds_into": ["Satanic"], "Passive": ["Lifesteal"], "Disassemble?": ["Yes"], "Active": ["Dominate"], "builds_from": ["Helm of Iron Will", "Morbid Mask"]}, "lore": "The powerful headpiece of a dead necromancer.", "type": "Artifacts", "additional_info": ["Helm of the Dominator adds to Dragon Knight's already considerable armor.", "Combined with the health regeneration from Dragon Blood, lifesteal ensures Dragon Knight will rarely need to return to base."]}, "Enchanted Mango": {"abilities": [{"Eat Mango": {"special_details": [], "modifiers": {}, "description": "Consume the mango to instantly restore 150 mana.Hold Control to use Enchanted Mango on an allied hero.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Interrupts the user's channeling spells upon cast.", "When casting without the Control key, it always casts on self in one click. When holding the Control key, a target has to be selected.", "If the target is more than 650 range away, the caster moves to the target until it is within 400 range before casting.", "Can only target heroes (including illusions) and creep-heroes.", "The owner does not have to face the target to use this on it.", "Restores the amount of mana instantly."], "Cooldown": "", "data": ["Cast Range: 650", "Mana Restored: 150"], "types": {"Affects": ["Self /  Allied Heroes"], "Ability": ["No Target  /  Target Unit"]}}}], "availability": [], "cost": "125 ", "details": {"Charges": ["1"], "Alert allies?": ["No"], "builds_into": [], "Bonus": ["+1 Health regeneration"], "Disassemble?": ["No"], "Active": ["Eat Mango"], "builds_from": []}, "lore": "The bittersweet flavors of Jidi Isle are irresistible to amphibians.", "type": "Consumables", "additional_info": ["Enchanted Mangoes do not stack in the inventory. Each of them requires its own slot. Their regeneration does stack.", "Enchanted Mangoes are not shareable, however, they can be cast on allies."]}, "Magic Wand": {"abilities": [{"Energy Charge": {"special_details": [], "modifiers": {}, "description": "Instantly restores health and mana based on the number of charges stored. Gains a charge (max 17) whenever a nearby visible enemy uses an ability.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Interrupts the user's channeling spells upon cast.", "Gains 1 charge whenever a visible enemy unit, including neutral creeps, uses an ability within the radius.", "Does not gain charges from toggle abilities, active attack modifiers and the abilities listed here.", "Passively triggered spells (e.g.  Quill Spray,  Borrowed Time,  Multicast,  Reincarnation) do not add charges.", "When an enemy casts a spell out of the invisibility from the  Invisibility Rune,  Shadow Walk,  Sand Storm,  Moonlight Shadow,  Nature's Guise or  Spin Web, it does not give a charge.", "Can restore up to 255 health and mana when having the maximum amount of charges.", "Shares cooldown with  Magic Stick.", "When having multiple Magic Wands or Magic Sticks in the inventory, the oldest one gains charges first. If it is full, the second oldest one starts to gain charges.", "Upon upgrading a Magic Stick into a Magic Wand, all its current charges are carried over."], "Cooldown": "", "data": ["Radius: 1200", "Charges per Cast Spell: 1", "Max Charges: 17", "Health and Mana Restored per Charge: 15"], "types": {"Affects": ["Self"], "Ability": ["No Target"]}}}], "availability": [], "cost": "465 ", "details": {"Bonus": ["+4 Strength", "+4 Agility", "+4 Intelligence"], "Alert allies?": ["No"], "builds_into": [], "Disassemble?": ["No"], "Active": ["Energy Charge"], "builds_from": ["Magic Stick", "Iron Branch", "Iron Branch", "Circlet"]}, "lore": "A simple wand used to channel magic energies, it is favored by apprentice wizards and great warlocks alike.", "type": "Common", "additional_info": ["One Magic Wand grants a total of 80 health, 0.12 health regeneration, 0.57 armor, 4 attack speed, 48 mana, 0.16 mana regeneration, 0.25% spell damage and 4 attack damage."]}, "Urn of Shadows": {"abilities": [{"Soul Release": {"special_details": ["PARTIAL_PIERCE_SPELL_IMMUNE Can be cast on spell immune allies.Cannot be cast on spell immune enemies. Attempts to damage if debuff was placed before spell immunity and when not dispelled."], "modifiers": {"Item Urn Heal: Dispellable with any dispel.": "green", "Item Urn Damage: Dispellable with any dispel.": "green"}, "description": "Heals health over time to friendly units, but deals pure damage over time to enemy units. The healing effect is lost if the affected ally takes damage from an enemy hero or tower.Gains charges every time an enemy hero dies within 1400 units. Only the closest Urn to the dying hero will gain a charge.", "Mana": "", "ability_special": ["NOT_BLOCKED_BY_LINKEN", "PARTIAL_PIERCE_SPELL_IMMUNE"], "notes": ["Double clicking the item uses it on self.", "Successive casts on the same target do not stack, but refresh the duration instead.", "Heals 12.5 health in 0.25 second intervals, resulting in 32 heal instances.", "Deals 18.75 damage in 1 second intervals, resulting in 8 damage instances.", "The heal is dispelled by any damage coming from players (before reductions), including self-inflicted damage, and from towers.", "Roshan and attacks by the fountain do not dispel the heal.", "Is not dispelled by damage flagged as HP Removal.", "Can be cast on creep-heroes.", "When having no charges left, the urn gains 2 charges from the next death, instead of 1."], "Cooldown": "", "data": ["Charge Gain Radius: 1400", "Cast Range: 950", "Allied Heal per Second: 50", "Allied Total Heal: 400", "Enemy Damage per Second: 18.75", "Enemy Total Damage: 150", "Heal/Damage Duration: 8"], "types": {"Affects": ["Allied Heroes  /  Enemy Heroes"], "Ability": ["Target Unit"], "Damage": ["Pure"]}}}], "availability": [], "cost": "875 (250)", "details": {"Bonus": ["+6 Strength", "+50% Mana regeneration"], "Alert allies?": ["No"], "builds_into": [], "Disassemble?": ["No"], "Active": ["Soul Release"], "builds_from": ["Sage's Mask", "Gauntlets of Strength", "Gauntlets of Strength", "Recipe"]}, "lore": "Contains the ashes of powerful demons.", "type": "Support", "additional_info": ["One Urn of Shadows grants a total of 120 health, 0.18 health regeneration and 50% mana regeneration (and 6 attack damage to strength heroes)."]}, "Solar Crest": {"abilities": [{"Shine": {"special_details": ["PARTIAL_PIERCE_SPELL_IMMUNE Can be cast on spell immune allies.Cannot be cast on spell immune enemies."], "modifiers": {"Item Solar Crest Armor Addition: Dispellable with any dispel.": "green", "Item Solar Crest Armor Reduction: Dispellable with any dispel.": "green"}, "description": "Temporarily removes the armor and evasion from Solar Crest. When cast on an ally it grants them 10 armor and 25% evasion. When cast on an enemy, it removes 10 of their armor and blinds them, causing them to miss 25% of their attacks. Cannot target magic immune enemies. Armor reduction is halved against Roshan.", "Mana": "", "ability_special": ["NOT_BLOCKED_BY_LINKEN", "PARTIAL_PIERCE_SPELL_IMMUNE"], "notes": ["Cannot be cast on self.", "Shares cooldown with  Medallion of Courage.", "Grants evasion for targeted allies, applies blind to targeted enemies.", "The debuff on self and the buff on allies/debuff on enemies are independent from each other. Dispelling one does not dispel the other.", "Unlike Medallion, Solar Crest does not place a debuff on the caster. Instead, its effects are directly bound to its cooldwown.", ["Its duration is always 7 seconds on the target, while the duration on self can vary when the cooldown gets manipulated.", "This means when the cooldown is reduced, the effects on self are sooner, and disappear immediately when getting refreshed.", "This also means that the effects on self are applied when using Medallion of Courage, since they share a cooldown."], "The armor reduction on self fully stacks. When having multiple Solar Crests, each of them reduce armor when on cooldown.", ["The evasion loss also affects all owned Solar Crests, but not any other source of evasion."], "The target buff and target debuff fully stack with each other. The effects on self also stacks with the target debuff.", ["When a unit is targeted by an allied and an enemy Solar Crest, it effectively has 25% evasion and 25% miss chance on attacks.", "When opposing heroes cast it on each other, they effectively have -20 armor, no evasion from Solar Crest and 25% miss chance.", "Multiple target debuffs or target buffs do not stack, but refresh their durations.", "The target buff, target debuff and self-debuff fully stack with those applied by Medallion of Courage."], "Can be cast on any unit, except on wards and buildings.", "When cast on Roshan, the user still loses 10 armor, not 5."], "Cooldown": "", "data": ["Cast Range: 1000", "Self Armor Reduction: 10", "Enemy Armor Reduction: 10", "Roshan Armor Reduction: 5", "Enemy Miss Chance: 25%", "Ally Armor Bonus: 10", "Ally Evasion Chance: 25%", "Duration: 7"], "types": {"Affects": ["Enemies / Allies"], "Ability": ["Target Unit"]}}}], "availability": [], "cost": "2875 ", "details": {"Bonus": ["+75% Mana regeneration", "+10 Armor", "+25% Evasion"], "Alert allies?": ["No"], "builds_into": [], "Disassemble?": ["Yes"], "Active": ["Shine"], "builds_from": ["Medallion of Courage", "Talisman of Evasion"]}, "lore": "A talisman forged to honor the daytime sky.", "type": "Caster", "additional_info": ["The evasion stacks diminishingly with other sources of evasion.", "The evasion uses pseudo-random distribution.", "Solar Crest does not inherit the passive armor reduction from Blight Stone."]}, "Healing Salve": {"abilities": [{"Regenerate Health": {"special_details": [], "modifiers": {"Flask Healing: Undispellable.": "green"}, "description": "Restores health to the target unit over time. If the unit is attacked, the effect is lost.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Double clicking the item casts it on self.", "If the target is more than 500 range away, the caster moves to the target until it is within 250 range before casting.", "Can only target heroes (including illusions) and creep-heroes.", "The owner does not have to face the target to use this on it.", "Successive casts on the same target do not stack, but refresh the duration instead.", "Restores health in the form of health regeneration, so it heals for 5 health in 0.1 second intervals, which is 50 health per second.", "Is dispelled by any damage equal to or greater than 20 (before reductions), including self-inflicted damage.", "Is not dispelled by damage flagged as HP Removal.", "Is always dispelled by attacks, even when the attack dealt no damage.", "Fully stacks with other health regeneration increasing effects."], "Cooldown": "", "data": ["Cast Range: 500", "Total Health Restored: 400", "Duration: 8"], "types": {"Affects": ["Allied Heroes"], "Ability": ["Target Unit"]}}}], "availability": [], "cost": "110 ", "details": {"Charges": ["1"], "Alert allies?": ["No"], "builds_into": [], "Disassemble?": ["No"], "Active": ["Regenerate Health"], "builds_from": []}, "lore": "A magical salve that can quickly mend even the deepest of wounds.", "type": "Consumables", "additional_info": ["Stacks with itself in inventory, there is no stack limit. The sell-back price adapts based on the number of Salves in a stack.", "Healing Salves are not shareable, however, they can be cast on allies."]}, "Crimson Guard": {"abilities": [{"Guard": {"special_details": [], "modifiers": {"Item Crimson Guard Extra: Dispellable with any dispel.": "green", "Item Crimson Guard Nostack: Undispellable.": "green"}, "description": "Grant nearby allied heroes a 100% chance to block 55 damage from each incoming attack, along with 2 armor. Lasts 10 seconds.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Interrupts the user's channeling spells upon cast.", "Only affects heroes and illusions.", "Does not affect heroes that have been affected by Guard in the last 46 seconds.", ["A status buff icon on affected units shows how much time is left for it to be able to get affected again."], "Guard bonus armor does not stack with the armor gained from  Mekansm and  Buckler active abilities.", "Does not work against wards ( Plague Ward,  Mass Serpent Ward,  Death Ward).", "Does not reduce physical damage from spells, except from  Moon Glaive and  The Swarm.", "Damage Block uses pseudo-random distribution.", "For more details, see Damage Block."], "Cooldown": "", "data": ["Radius: 900", "Blocked Damage: 55", "Armor Bonus: 2", "Buff Duration: 10", "Stack Limit Duration: 46"], "types": {"Affects": ["Allied Heroes"], "Ability": ["No Target"]}}}, {"Damage Block": {"special_details": [], "modifiers": {}, "description": "Makes the wielder block damage from each incoming attack based on whether the equipped hero is melee or ranged.", "Mana": "", "ability_special": ["ILLUSIONS_CAN_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Does not work against wards ( Plague Ward,  Mass Serpent Ward,  Death Ward).", "Does not reduce physical damage from spells, except from  Moon Glaive and  The Swarm.", "Damage Block uses pseudo-random distribution.", "For more details, see Damage Block."], "Cooldown": "", "data": ["Proc Chance: 100%", "Blocked Damage (Melee): 32", "Blocked Damage (Ranged): 16"], "types": {"Affects": ["Self"], "Ability": ["Passive"]}}}], "availability": [], "cost": "3550 (600)", "details": {"Bonus": ["+2 Strength", "+2 Agility", "+2 Intelligence", "+250 Health", "+8 Health regeneration", "+5 Armor"], "Alert allies?": ["Yes"], "builds_into": [], "Passive": ["Damage Block"], "Disassemble?": ["No"], "Active": ["Guard"], "builds_from": ["Vanguard", "Buckler", "Recipe"]}, "lore": "A cuirass originally built to protect against the dreaded Year Beast.", "type": "Armor", "additional_info": ["One Crimson Guard grants a total of 290 health, 8.06 health regeneration, 5.29 armor, 2 attack speed, 24 mana, 0.08 mana regeneration, 0.125% spell damage and 2 attack damage.\n Together with the active ability, it grants a total of 7.29 armor to the owner.", "Together with the active ability, it grants a total of 7.29 armor to the owner."]}, "Maelstrom": {"abilities": [{"Chain Lightning": {"special_details": ["PARTIAL_PIERCE_SPELL_IMMUNE Can proc on and attempts to damage spell immune enemies. Cannot bounce to spell immune enemies.", "UNIQUE_ATTACK_MODIFIER Stacks with other attack modifiers, but overrides them when Chain Lightning occurs."], "modifiers": {"Maelstrom Chain: Undispellable.": "green"}, "description": "Grants a chance on attack to release a bolt of electricity that leaps between 4 targets, dealing 120 magical damage to each.", "Mana": "", "ability_special": ["UNIQUE_ATTACK_MODIFIER", "ILLUSIONS_CANNOT_USE", "PARTIAL_PIERCE_SPELL_IMMUNE"], "notes": ["Each Maelstrom in the inventory has an independent chance to proc. If more than 2 proc on one attack, only one chain lightning is released.", "The same applies to Maelstrom and Mjollnir in the same inventory. When both proc on the same hit, Mjollnir has priority.", "The lightning bounces in 0.25 second intervals, so hitting 4 targets takes 0.75 seconds.", "Does not bounce on invisible units or units in the Fog of War.", "Can never hit the same unit twice per proc.", "Can only proc on successfully hit attacks, thus missed attacks cannot proc", "All bounces together can deal up to 480 damage (before reductions).", "Chain Lightning can proc while a previous chain lightning is still bouncing.", "Chain Lightning uses pseudo-random distribution.", "The Maelstrom Chain buff is a hidden buff required for the lightning to jump."], "Cooldown": "", "data": ["Proc Chance: 25%", "Bounce Distance: 900", "Number of Bounces: 4", "Damage: 120"], "types": {"Affects": ["Enemies"], "Ability": ["Passive"], "Damage": ["Magical"]}}}], "availability": [], "cost": "2800 (700)", "details": {"Bonus": ["+24 Attack damage", "+25 Attack speed"], "Alert allies?": ["No"], "builds_into": ["Mjollnir"], "Passive": ["Chain Lightning"], "Disassemble?": ["No"], "builds_from": ["Mithril Hammer", "Gloves of Haste", "Recipe"]}, "lore": "A hammer forged for the gods themselves, Maelstrom allows its user to harness the power of lightning.", "type": "Artifacts", "additional_info": ["Maelstrom is the most cost effective damage item for heroes with a low Base Attack Time.", "Maelstrom is a very good item for speeding up farming. If the extra experience is not needed, it is good alternative to the Hand of Midas. Since the lightning has a huge bounce range, it can be used to damage multiple camps at once when farming in the woods, if vision over the camps is present.", "It is also great to deal with illusions or mass-summons like Broodmother's spiders, Nature's Prophet's treants, etc, especially useful for ranged heroes that lack area damage, since they cannot make use of cleave.", "The Chain Lightning deals magical, so it ignores armor and Damage Block, making it good against heroes that get a Vanguard, or Tidehunter with his Kraken Shell, and against heroes with high armor like Dragon Knight or Terrorblade.", "To counter someone with a Maelstrom you can buy an Infused Raindrop, it will completely block Chain Lightnings. With a Poor Man's Shield it will allow to reduce the incoming damages a lot."]}, "Smoke of Deceit": {"abilities": [{"Conceal": {"special_details": [], "modifiers": {"Smoke Of Deceit: Undispellable.": "green"}, "description": "Upon activation, the user and all nearby allied player-controlled units gain invisibility and bonus movement speed for a brief time. Minimap icons will also be hidden. Attacking, or moving within 1025 range of an enemy hero or tower, will break the invisibility.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Interrupts the user's channeling spells upon using.", "Affected units can cast spells and use items while invisible without breaking it. However, attacking does break it.", "When attacking, the invisibility is lost upon reaching the attack point, even when the attack misses.", "Invisible units can pick up and drop items without breaking the invisibility.", "True Sight cannot detect units affected by Smoke of Deceit. The only exception is  Chronosphere.", "Only affects player controlled units. Does not affect invulnerable and hidden allies.", ["However, invulnerable and hidden enemy heroes dispel it."], "The effect is only dispelled when approaching enemy heroes (including hero clones, excluding illusions) or towers.", "Can be cast by the courier, but does not affect it."], "Cooldown": "", "data": ["Effect Radius: 1200", "Dispel Radius: 1025", "Fade Time: 0", "Move Speed Bonus: 15%", "Duration: 35"], "types": {"Affects": ["Allies"], "Ability": ["No Target"]}}}], "availability": [], "cost": "50 ", "details": {"Charges": ["1"], "Alert allies?": ["Yes"], "builds_into": [], "Disassemble?": ["No"], "Active": ["Smoke of Deceit"], "builds_from": []}, "lore": "The charlatan wizard Myrddin's only true contribution to the arcane arts.", "type": "Consumables", "additional_info": ["Smoke of Deceit starts with a stock count of 3 and is limited to a count of 3.\n It takes 660 seconds for 1 smoke to replenish in the stock.", "It takes 660 seconds for 1 smoke to replenish in the stock.", "Stacks with itself in the inventory.", "Smoke of Deceit is completely shareable."]}, "Ethereal Blade": {"abilities": [{"Ether Blast": {"special_details": ["NO_PIERCE_SPELL_IMMUNE All effects persist if debuff was placed before spell immunity and when not dispelled.", "BLOCKED_BY_LINKEN Blocked upon impact."], "modifiers": {"Item Ethereal Blade Slow: Dispellable with any dispel.": "green", "Item Ethereal Blade Ethereal: Dispellable with any dispel.": "green"}, "description": "Launches a projectile which converts the target to ethereal form, increasing any incoming magic damage they take, while rendering them immune to physical damage and unable to attack. Can be cast on self. If the target is an enemy, it is also slowed, and takes 2x your primary attribute + 75 as magical damage. Using a Town Portal Scroll or Boots of Travel will not dispel Ethereal Form.", "Mana": "", "ability_special": ["BLOCKED_BY_LINKEN", "NO_PIERCE_SPELL_IMMUNE"], "notes": ["Double clicking the item casts it on self.", "The projectile travels at a speed of 1200 and can be disjointed.", "Damage and slow is only applied when targeting an enemy unit.", "Applies the ethereal effect before dealing its own damage, effectively increasing the damage.", "Reduces most heroes' total magic resistance to -5%, (assuming basic 25% magic resistance).", "Reduces  Meepo's total magic resistance to 9% and  Visage's total magic resistance to -26%.", "Ether Blast's magic resistance reduction does not stack with other ethereal effects, the one with higher value takes priority", "Shares cooldown with  Ghost Scepter."], "Cooldown": "", "data": ["Cast Range: 800", "Base Damage: 75", "Primary Attribute as Damage: 200%", "Move Speed Slow: 80%", "Magic Resistance Reduction: 40%", "Allies/Self Duration: 4", "Enemy Duration: 3"], "types": {"Affects": ["Allies / Enemies"], "Ability": ["Target Unit"], "Damage": ["Magical"]}}}], "availability": [], "cost": "4700 ", "details": {"Bonus": ["+10 Strength", "+40 Agility", "+10 Intelligence"], "Alert allies?": ["No"], "builds_into": [], "Disassemble?": ["Yes"], "Active": ["Ether Blast"], "builds_from": ["Eaglesong", "Ghost Scepter"]}, "lore": "A flickering blade of a ghastly nature, it is capable of dealing damage in both magical and physical planes.", "type": "Weapons", "additional_info": ["One Ethereal Blade grants a total of 200 health, 0.3 health regeneration, 5.71 armor, 40 attack speed, 120 mana, 0.4 mana regeneration, 0.625% spell damage and 10 (40 to agility heroes) attack damage."]}, "Tome of Knowledge": {"abilities": [{"Acquire Knowledge": {"special_details": [], "modifiers": {}, "description": "Grants you experience.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Interrupts the user's channeling spells on cast.", "Grants the experience instantly.", "Cannot be used by the Spirit Bear and couriers.", "Can be used even when already at max level, wasting the item."], "Cooldown": "", "data": ["Experience Gained: 425"], "types": {"Affects": ["Self"], "Ability": ["No Target"]}}}], "availability": [], "cost": "150 ", "details": {"Active": ["Acquire Knowledge"], "builds_from": [], "builds_into": [], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "That which raises beast to man and man to god.", "type": "Consumables", "additional_info": ["Becomes available for purchase at the 10 minute mark.", "Tome of Knowledge is limited to a stock of 3 in the store. It takes 10 minutes for 1 tome to replenish in the stock.", "Stacks with itself in inventory, there is no stack limit. The sell-back price adapts based on the number of Tomes in a stack.", "Tomes of Knowledge are fully sharable."]}, "Ring of Basilius": {"abilities": [{"Basilius Aura": {"special_details": ["ILLUSIONS_CANNOT_USE Illusions provide the aura, but do not benefit from it."], "modifiers": {"Item Ring Of Basilius Aura Bonus: Undispellable.": "green"}, "description": "Grants mana regeneration and armor in a 900 area of effect.Toggle whether the aura affects other non-hero units.Multiple instances of Basilius Aura do not stack.", "Mana": "", "ability_special": ["ILLUSIONS_CANNOT_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Does not interrupt the user's channeling spells upon toggling.", "Restores mana in the form of mana regeneration, so it regenerates 0.065 mana in 0.1 second intervals, which makes 0.65 mana per second.", "The flat mana regen bonus is not considered by percentage mana regeneration increases.", "Regenerates up to 39 mana in one minute.", "The aura bonuses do not stack with the auras from Ring of Basilius,  Ring of Aquila and  Vladmir's Offering.", "The aura's buff lingers for 0.5 seconds.", "Treats creep-heroes as heroes."], "Cooldown": "", "data": ["Radius: 900", "Mana Regeneration Bonus: 0.65", "Armor Bonus: 2"], "types": {"Affects": ["Allies /  Allied Heroes"], "Ability": ["Toggle  /  Aura"]}}}], "availability": [], "cost": "500 ", "details": {"Bonus": ["+7 Attack damage"], "Alert allies?": ["No"], "builds_into": ["Vladmir's Offering", "Ring of Aquila"], "Passive": ["Basilius Aura"], "Disassemble?": ["Yes"], "builds_from": ["Sage's Mask", "Ring of Protection"]}, "lore": "Ring given as a reward to the greatest mages.", "type": "Support", "additional_info": ["When the Basilius Aura is on, allied creeps gain an additional 2 armor, which is useful if you want to push the creep advantage in a lane. The aura should be turned off if you do not want the lane to get pushed.", "In the early game and even into the mid game, the boost of mana regen is extremely useful for heroes with low intelligence growth like Troll Warlord.", "When having 33 or more intelligence, Sage's Mask provides more mana regeneration (0.665) than a Ring of Basilius."]}, "Javelin": {"abilities": [{"Pierce": {"special_details": [], "modifiers": {}, "description": "Grants each attack a chance to deal bonus damage.", "Mana": "", "ability_special": ["NOT_UNIQUE_ATTACK_MODIFIER", "ILLUSIONS_CANNOT_USE", "NO_PIERCE_SPELL_IMMUNE"], "notes": ["The proc chances of Pierce from multiple Javelins work fully independently from each other.", ["This means that two of them can proc on the same attack and both deal their damage."], "The owner can lifesteal off the damage dealt by Pierce. However, it cannot crit or cleave.", "The damage can be reduced with e.g.  Enfeeble or  Static Link.", ["However, it cannot be amplified with e.g.  Empower or the  Double Damage Rune."], "Does not work against wards and buildings, but works against allied units.", "Adds an average of 21.25 magical damage to every attack."], "Cooldown": "", "data": ["Proc Chance: 25%", "Damage: 85"], "types": {"Affects": ["Enemies"], "Ability": ["Passive"], "Damage": ["Magical"]}}}], "availability": [], "cost": "1500 ", "details": {"Bonus": ["+10 Attack damage"], "Alert allies?": ["No"], "builds_into": ["Skull Basher", "Monkey King Bar"], "Passive": ["Pierce"], "Disassemble?": ["No"], "builds_from": []}, "lore": "A rather typical spear that can sometimes pierce through an enemy's armor when used to attack.", "type": "Armaments", "additional_info": []}, "Ring of Health": {"abilities": [], "availability": ["SIDE_SHOP"], "cost": "850 ", "details": {"Bonus": ["+6 Health regeneration"], "builds_from": [], "builds_into": ["Hood of Defiance", "Perseverance", "Vanguard", "Aether Lens"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "A shiny ring found beneath a fat halfling’s corpse.", "type": "Arcane", "additional_info": ["Ring of Health is partially shareable."]}, "Moon Shard": {"abilities": [{"Consume": {"special_details": [], "modifiers": {"Item Moon Shard Consumed: Undispellable.": "green"}, "description": "Consume the Moon Shard to permanently gain 60 attack speed. Does not stack.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Must target self, or double-click in order to consume. Can only target self.", "A hero can only consume a maximum of one Moon Shard.", "Once consumed the item remains factored into the hero's net worth and GPM.", "Cannot be consumed while channeling spells.", "Can be consumed by  Lone Druid's Spirit Bear as well."], "Cooldown": "", "data": ["Attack Speed Bonus: 60"], "types": {"Affects": ["Self"], "Ability": ["Target Unit"]}}}, {"Shade Sight": {"special_details": [], "modifiers": {}, "description": "Grants 250 bonus night vision.", "Mana": "", "ability_special": ["ILLUSIONS_CAN_USE"], "notes": ["Works against  Darkness.", "Night vision bonuses from multiple shards do not stack.", "This ability is lost upon consuming the Moon Shard."], "Cooldown": "", "data": ["Night Vision Bonus: 250"], "types": {"Affects": ["Self"], "Ability": ["Passive"]}}}], "availability": ["SECRET_SHOP"], "cost": "4000 ", "details": {"Charges": ["1"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Shade Sight"], "Bonus": ["+120 Attack speed"], "Disassemble?": ["No"], "Active": ["Consume"], "builds_from": ["Hyperstone", "Hyperstone"]}, "lore": "Said to be a tear from the lunar goddess Selemene.", "type": "Common", "additional_info": ["Moon Shard does not stack with itself in the inventory."]}, "Eye of Skadi": {"abilities": [{"Cold Attack": {"special_details": ["UNIQUE_ATTACK_MODIFIER Can be combined with a lifesteal Unique Attack Modifier."], "modifiers": {"Item Skadi Slow: Undispellable.": "red"}, "description": "Each attack slows the movement and attack speed of the target. The duration of the slow is based on whether the equipped hero is melee or ranged.", "Mana": "", "ability_special": ["UNIQUE_ATTACK_MODIFIER", "ILLUSIONS_CANNOT_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Successive attacks with Eye of Skadi do not stack, but refresh the duration instead.", "Does not work against wards and buildings, but works against couriers and allied units."], "Cooldown": "", "data": ["Move Speed Slow: 35%", "Attack Speed Slow: 45", "Duration (Melee): 5", "Duration (Ranged): 2.5"], "types": {"Affects": ["Enemies"], "Ability": ["Passive"]}}}], "availability": [], "cost": "5675 ", "details": {"Bonus": ["+25 Strength", "+25 Agility", "+25 Intelligence", "+225 Health", "+250 Mana"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Cold Attack"], "Disassemble?": ["No"], "builds_from": ["Ultimate Orb", "Ultimate Orb", "Point Booster", "Orb of Venom"]}, "lore": "Extremely rare artifact, guarded by the azure dragons.", "type": "Artifacts", "additional_info": ["Eye of Skadi does not inherit the damage over time from Orb of Venom.", "One Eye of Skadi grants a total of 725 health, 0.75 health regeneration, 3.57 armor, 25 attack speed, 550 mana, 1 mana regeneration, 1.5625 spell damage and 25 attack damage."]}, "Iron Talon": {"abilities": [{"Chop": {"special_details": [], "modifiers": {}, "description": "Targets a non-player enemy unit to remove 40% of its current health.", "Mana": "", "ability_special": ["NOT_BLOCKED_BY_LINKEN", "PIERCE_SPELL_IMMUNE"], "notes": ["When targeting a unit, it deals damage based on the target's current health.", ["Cannot target any player-controlled unit and ancient creeps.", "Uses the shorter cast range and long cooldown when targeting units.", "The sound only plays when targeting units."], "When targeting a tree or ward, it instantly destroys it.", ["Can target any tree, including  Sprout trees.", "Can also target  Observer Wards,  Sentry Wards and all of  Techies' mines.", "Uses the shorter cast range for trees and longer cast range for wards, and the short cooldown for both."], "Does not share cooldown with  Quelling Blade or  Battle Fury."], "Cooldown": "", "data": ["Cast Range (Tree/Unit): 350", "Cast Range (Ward): 450", "Current Health as Damage: 40%"], "types": {"Affects": ["Trees  / Enemy Units"], "Ability": ["Target Unit"], "Damage": ["Pure"]}}}, {"Quell": {"special_details": ["ILLUSIONS_CAN_USE The bonus damage is also affected by the illusions' attack damage penalty."], "modifiers": {}, "description": "Increases attack damage against non-hero units, based on whether the equipped hero is ranged or melee. Does not provide bonus damage against Roshan.", "Mana": "", "ability_special": ["NOT_UNIQUE_ATTACK_MODIFIER", "ILLUSIONS_CAN_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Multiple sources of Quell ( Quelling Blade,  Battle Fury or another Iron Talon) do not stack.", "Only increases base damage and that provided by attributes. Attack damage bonuses are not increased.", "The bonus damage does not apply when attacking friendly units (i.e. denying own creeps).", "When the owner's attack type changes to ranged or melee, the attack damage bonus adapts immediately.", "Kunkka doesn't benefit from quell when he does't learn  Tidebringer.", "Quell fully works with crits, cleaves and lifesteal. When having cleave, attacking a creep cleaves the increased damage in the area.", ["However, if the unit has  Tidebringer, the attack which procs it is not increased by Quell.", "When  Tidebringer is on cooldown, the attack will be increased by Quell."], "Elder Dragon Form's splash also splashes the increased damage when attacking a creep.", "The damage  Moon Glaive bounces are not increased, since they are based on the attacker's attack damage value.", "Psi Blades will spread the increased damage when attacking a creep.", "Does not work against wards, buildings, Roshan,  Lone Druid's Spirit Bear and allied units."], "Cooldown": "", "data": ["Attack Damage Bonus (Melee): 40%", "Attack Damage Bonus (Ranged): 15%"], "types": {"Affects": ["Enemy Units"], "Ability": ["Passive"]}}}], "availability": [], "cost": "500 (125)", "details": {"Bonus": ["+2 Armor"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Quell"], "Disassemble?": ["No"], "Active": ["Chop"], "builds_from": ["Quelling Blade", "Ring of Protection", "Recipe"]}, "lore": "A simple but effective weapon devised to quell a great Hellbear uprising.", "type": "Support", "additional_info": ["Using Iron Talon"]}, "Ultimate Orb": {"abilities": [], "availability": ["SECRET_SHOP"], "cost": "2100 ", "details": {"Bonus": ["+10 Strength", "+10 Agility", "+10 Intelligence"], "builds_from": [], "builds_into": ["Eye of Skadi", "Linken's Sphere", "Scythe of Vyse", "Manta Style", "Silver Edge"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "A mystical orb containing the essence of life.", "type": "Secret Shop", "additional_info": ["One Ultimate Orb grants a total of 200 health, 0.3 health regeneration, 1.43 armor, 10 attack speed, 120 mana, 0.4 mana regeneration, 0.625% spell damage and 10 attack damage."]}, "Void Stone": {"abilities": [], "availability": ["SIDE_SHOP"], "cost": "850 ", "details": {"Bonus": ["+100% Mana regeneration"], "builds_from": [], "builds_into": ["Eul's Scepter of Divinity", "Scythe of Vyse", "Perseverance"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "Jewelry that was once used to channel nether realm magic, this ring pulses with energy.", "type": "Arcane", "additional_info": ["Void Stone is partially shareable."]}, "Mystic Staff": {"abilities": [], "availability": ["SECRET_SHOP"], "cost": "2700 ", "details": {"Bonus": ["+25 Intelligence"], "builds_from": [], "builds_into": ["Scythe of Vyse", "Shiva's Guard", "Octarine Core"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "Enigmatic staff made of only the most expensive crystals.", "type": "Secret Shop", "additional_info": ["One Mystic Staff grants a total of 300 mana, 1 mana regeneration and 1.5625% spell damage (and 25 attack damage to intelligence heroes)."]}, "Guardian Greaves": {"abilities": [{"Mend": {"special_details": [], "modifiers": {"Item Mekansm Noheal: Undispellable.": "green"}, "description": "Restores 250 health and 160 mana to nearby allies, and removes most negative buffs from the caster.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Interrupts the user's channeling spells upon cast.", "Applies a basic dispel on the user upon cast, removing many debuffs.", "Affects every allied unit, including illusions, invulnerable units and hidden units, excluding wards and buildings.", "Does not heal heroes that have been affected by Mend in the last 38 seconds, or by  Mekansm's Restore in the last 25 seconds.", ["Still restores mana on heroes that have been affected by Mend or Restore in that time.", "A status buff icon on affected units shows how much time is left for it to be able to get affected again.", "When the user has an  Octarine Core, the duration is 28 seconds, instead of 38."]], "Cooldown": "", "data": ["Radius: 900", "Health Restored: 250", "Mana Restored: 160", "Heal Stack Limit Duration: 38"], "types": {"Affects": ["Allies"], "Ability": ["No Target"]}}}, {"Guardian Aura": {"special_details": ["ILLUSIONS_CANNOT_USE Illusions provide the aura, but do not benefit from it."], "modifiers": {"Item Guardian Greaves Aura: Undispellable.": "green"}, "description": "Provides nearby allies with 4 health regeneration and 2 bonus armor. If an allied hero's health falls below 20%, they receive 15 health regeneration and 15 armor.", "Mana": "", "ability_special": ["ILLUSIONS_CANNOT_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Bonuses stack with all other sources of health regeneration and armor, except with Guardian Aura from multiple Guardian Greaves.", "Regenerates up to 240 (900 when boosted) health in one minute.", "Does not affect wards, buildings and invulnerable units.", "The boost only affects heroes (including illusions). Non-hero units only benefit from the base values.", "The aura's buff lingers for 0.5 seconds."], "Cooldown": "", "data": ["Radius: 900", "Health Regeneration Bonus: 4", "Armor Bonus: 2", "Boost Health Threshold: 20%", "Boosted Health Regeneration Bonus: 15", "Boosted Armor Bonus: 15"], "types": {"Affects": ["Allies"], "Ability": ["Aura"]}}}], "availability": [], "cost": "5275 (1700)", "details": {"Bonus": ["+5 Strength", "+5 Agility", "+5 Intelligence", "+250 Mana", "+5 Armor", "+55 Movement Speed"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Guardian Aura"], "Disassemble?": ["No"], "Active": ["Mend"], "builds_from": ["Mekansm", "Arcane Boots", "Recipe"]}, "lore": "One of many holy instruments constructed to honor the Omniscience.", "type": "Support", "additional_info": ["Movement speed bonuses from multiple pairs of boots do not stack.", "Stacks with all other movement speed bonuses.", "One pair of Guardian Greaves grants a total of 100 health, 0.15 health regeneration, 5.71 armor, 5 attack speed, 310 mana, 0.2 mana regeneration, 0.3125 spell damage and 5 attack damage.\n Together with the aura, it grants a total of 4.15 (15.15 while boosted) health regeneration and 7.71 (20.71 while boosted) armor to the owner.", "Together with the aura, it grants a total of 4.15 (15.15 while boosted) health regeneration and 7.71 (20.71 while boosted) armor to the owner."]}, "Mithril Hammer": {"abilities": [], "availability": [], "cost": "1600 ", "details": {"Bonus": ["+24 Attack damage"], "builds_from": [], "builds_into": ["Black King Bar", "Maelstrom", "Desolator"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "A hammer forged of pure mithril.", "type": "Armaments", "additional_info": ["Mithril is a fictional metal from J.R.R. Tolkien's Lord of the Rings book trilogy, known for its strength and light weight. It has grown incredibly popular and is now used in a wide array of other fantasy universes, including Dota 2's."]}, "Talisman of Evasion": {"abilities": [], "availability": ["SECRET_SHOP"], "cost": "1700 ", "details": {"Bonus": ["+25% Evasion"], "builds_from": [], "builds_into": ["Butterfly", "Heaven's Halberd", "Solar Crest"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "A necklace that allows you to anticipate enemy attacks.", "type": "Secret Shop", "additional_info": ["The evasion stacks diminishingly with other sources of evasion.", "The evasion uses pseudo-random distribution."]}, "Desolator": {"abilities": [{"Corruption": {"special_details": [], "modifiers": {"Desolator Buff: Dispellable with any dispel.": "red"}, "description": "Your attacks reduce target's armor for 15 seconds.", "Mana": "", "ability_special": ["UNIQUE_ATTACK_MODIFIER", "PIERCE_SPELL_IMMUNE"], "notes": ["Successive attacks with Desolator do not stack the debuff, but refresh the duration instead.", "The target's armor is reduced before the attack damage is dealt, but still relies on the attack not to miss.", "Works against every unit, including wards, buildings and allied units.", "Replaces the projectile particle of ranged heroes with a red projectile.", "Stacks with the Corruption debuff of  Blight Stone (however, one hero cannot use both due to them being Unique Attack Modifiers)."], "Cooldown": "", "data": ["Armor Reduction: 7", "Duration: 15"], "types": {"Affects": ["Enemies"], "Ability": ["Passive"]}}}], "availability": [], "cost": "3500 ", "details": {"Bonus": ["+50 Attack damage"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Corruption"], "Disassemble?": ["No"], "builds_from": ["Mithril Hammer", "Mithril Hammer", "Blight Stone"]}, "lore": "A wicked weapon, used in torturing political criminals.", "type": "Artifacts", "additional_info": ["The Corruption debuff works against buildings, making it a great pushing tool. Split-pushing heroes can benefit a lot from it, allowing them to take towers down much quicker.", "The Corruption debuff lasts quite long, so sometimes it is better to get the debuff on multiple enemies, instead of focusing only one target in team fights.", "This item works well in combination with critical strike items and abilities, such as Mortal Strike and Daedalus."]}, "Scythe of Vyse": {"abilities": [{"Hex": {"special_details": ["NO_PIERCE_SPELL_IMMUNE Effects persist if debuff was placed before spell immunity and when not dispelled."], "modifiers": {"Sheepstick Debuff: Dispellable with any dispel.": "red"}, "description": "Turns a target unit into a harmless critter for 3.5 seconds. Instantly destroys illusions.", "Mana": "", "ability_special": ["BLOCKED_BY_LINKEN", "NO_PIERCE_SPELL_IMMUNE"], "notes": ["Applies a Hex on the target, setting its base movement speed to 140 and silencing, muting and disarming it.", "Because hex changes base move speed and does not actually apply a slow, all speed effects are calculated using the 140 base speed.", "For example:", ["a hexed unit with no speed bonuses has 140 move speed", "a hexed unit with +8% from  Yasha has 151.2 move speed", "a hexed unit with +45 from  Boots of Speed has 185 move speed", "a hexed unit with both  Boots of Speed and  Yasha has 199.8 move speed"], "Hex instantly destroys illusions, but not summoned units.", "Scythe of Vyse hex transforms the target into a pig."], "Cooldown": "", "data": ["Cast Range: 800", "Duration: 3.5"], "types": {"Affects": ["Enemies"], "Ability": ["Target Unit"]}}}], "availability": [], "cost": "5650 ", "details": {"Bonus": ["+10 Strength", "+10 Agility", "+35 Intelligence", "+150% Mana regeneration"], "Alert allies?": ["No"], "builds_into": [], "Disassemble?": ["No"], "Active": ["Hex"], "builds_from": ["Mystic Staff", "Ultimate Orb", "Void Stone"]}, "lore": "The most guarded relic among the cult of Vyse, it is the most coveted weapon among magi.", "type": "Caster", "additional_info": ["One Scythe of Vyse grants a total of 200 health, 0.3 health regeneration, 1.43 armor, 10 attack speed, 420 mana, 1.4 (+ 150%) mana regeneration, 2.1875% spell damage and 10 (35 to intelligence heroes) attack damage."]}, "Energy Booster": {"abilities": [], "availability": ["SECRET_SHOP", "SIDE_SHOP"], "cost": "900 ", "details": {"Bonus": ["+250 Mana"], "builds_from": [], "builds_into": ["Arcane Boots", "Soul Booster", "Aether Lens", "Lotus Orb"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "This lapis gemstone is commonly added to the collection of wizards seeking to improve their presence in combat.", "type": "Secret Shop", "additional_info": []}, "Blink Dagger": {"abilities": [{"Blink": {"special_details": [], "modifiers": {}, "description": "Teleport to a target point up to 1200 units away. If damage is taken, Blink Dagger cannot be used for 3 seconds.", "Mana": "", "ability_special": [], "notes": ["Double clicking the item automatically casts it on your team's fountain, blinking towards its direction.", "Does not blink for the full distance when targeting closer than its max distance.", "When targeting beyond the max blink distance, it blinks for 960 range towards the targeted direction, instead of 1200.", "The second sound only plays when the blinked distance is greater than 960 (1160 with  Aether Lens). It is audible to everyone.", "Disjoints projectiles upon cast. Cannot be cast while rooted.", "Damage greater than 0 from any player (including allies and self) or Roshan puts Blink on a 3 second cooldown.", ["Since it is a cooldown and not actually disabled, it can be refreshed with  Refresher Orb and  Rearm.", "However, this cooldown is not affected by  Octarine Core or  Arcane Rune.", "Does not get disabled by HP Removal."]], "Cooldown": "", "data": ["Cast Range: Global", "Max Blink Distance: 1200"], "types": {"Affects": ["Self"], "Ability": ["Target Point"]}}}], "availability": ["SIDE_SHOP"], "cost": "2250 ", "details": {"Active": ["Blink"], "builds_from": [], "builds_into": [], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "The fabled dagger used by the fastest assassin ever to walk the lands.", "type": "Arcane", "additional_info": ["Using Blink always requires a hero to face the direction before actually blinking, meaning when not blinking straightforward the hero will not blink instantly but after a slight delay depending on its turn rate.", "Having an Infused Raindrop will allow to completely block damages over time like a Radiance and will not reset the blink dagger's cooldown."]}, "Iron Branch": {"abilities": [{"Plant Tree": {"special_details": [], "modifiers": {}, "description": "Targets the ground to plant a happy little tree that lasts for 20 seconds.", "Mana": "", "ability_special": [], "notes": ["The Iron Branch is consumed in the process.", "Creates a regular tree at the target point. This tree is smaller than the other trees on the map and has a smaller collision size.", "This means it blocks vision and is treated like any other tree by all abilities which interact with trees.", "Tango heals for twice as long when targeting an Iron Branch tree, using the ward duration, instead of tree duration.", "The particles around the tree are visible to everyone, make it clear that it is a planted tree."], "Cooldown": "", "data": ["Cast Range: 200", "Duration: 20"], "types": {"Ability": ["Target Point"]}}}], "availability": [], "cost": "50 ", "details": {"Charges": ["1"], "Alert allies?": ["No"], "builds_into": ["Headdress", "Magic Wand", "Buckler"], "Bonus": ["+1 Strength", "+1 Agility", "+1 Intelligence"], "Disassemble?": ["No"], "Active": ["Plant Tree"], "builds_from": []}, "lore": "A seemingly ordinary branch, its ironlike qualities are bestowed upon the bearer.", "type": "Attributes", "additional_info": ["Iron Branches do not stack in the inventory.", "One Iron Branch grants a total of 20 health, 0.03 health regeneration, 0.14 armor, 1 attack speed, 12 mana, 0.04 mana regeneration, 0.0625% spell damage and 1 attack damage."]}, "Boots of Travel": {"abilities": [{"Teleport": {"special_details": [], "modifiers": {"Teleporting: Undispellable.": "green", "Boots Of Travel Incoming: Undispellable.": "green"}, "description": "Teleports you to an allied non-hero unit or structure. Upgradable to allow you to teleport to allied heroes.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Double clicking the item while being at least 1500 range away from the team's fountain, automatically targets the fountain.", "On level 1, can target allied non-hero units and buildings. On level 2, can additionally target allied heroes.", "When targeting the ground, automatically chooses the closest valid target to that point. Prioritizes buildings within 325 radius.", "Can target any allied unit, except for wards, couriers, Beetles, Homing Missiles and Spin Webs (heroes and illusions on level 1).", ["Can target allies even when they are invulnerable (e.g.  Astral Spirit).", "Cannot teleport to hidden units (e.g.  Phase Shift)."], "The targeted unit's priority is lowered, meaning it is attacked as the last auto attack target by other units.", "During the channeling, the teleport destination is marked with a visual effect in the same color as the player and a sound is played.", "Both are visible and audible to everyone. The visual effect is also visible on teleporting invisible enemies.", "Also marks the point on the mini-map for allies. The mark is in the player's color and lasts as long as the channeling does.", "Provides 200 radius flying vision at the destination point while channeling. The vision lingers for 1 second.", "When the target unit dies or changes ownership during the channeling, the teleport gets cancelled, wasting the cooldown and mana cost.", "Does not destroy trees upon teleporting, making it possible to get stuck between trees.", "Shares cooldown with  Town Portal Scroll."], "Cooldown": "", "data": ["Cast Range: Global", "Channel Time: 3"], "types": {"Affects": ["Self"], "Ability": ["Target Point  /  Target Unit  /  Channeled"]}}}], "availability": [], "cost": "2400 (2000)", "details": {"Bonus": ["+100 Movement Speed"], "Alert allies?": ["No"], "builds_into": ["Boots of Travel"], "Disassemble?": ["No"], "Active": ["Teleport"], "builds_from": ["Boots of Speed", "Recipe"]}, "lore": "Winged boots that grant omnipresence.", "type": "Common", "additional_info": ["Upgrading the item improves the Teleport ability. Can be upgraded only once.", "The total gold cost for each level is 2400/4400.", "Movement speed bonuses from multiple pairs of boots do not stack.", "Stacks with all other movement speed bonuses."]}, "Bloodthorn": {"abilities": [{"Soul Rend": {"special_details": ["NO_PIERCE_SPELL_IMMUNE Effect persists and attempts to deal damage when expiring while spell immune if debuff was placed before spell immunity and when not dispelled."], "modifiers": {"Bloodthorn Debuff: Dispellable with any dispel.": "red"}, "description": "Silences a target for 5 seconds and amplifies the damage it takes by 30%. All attacks on the silenced target will have True Strike and land a crit on impact.", "Mana": "", "ability_special": ["BLOCKED_BY_LINKEN", "NO_PIERCE_SPELL_IMMUNE"], "notes": ["Does not directly amplify damage as it is dealt, but rather saves all damage values and deals 30% of it 5 seconds after cast.", ["This means that the damage can be avoided by becoming spell immune or invulnerable/hidden at the end of the duration."], "The damage is applied as soon as the debuff expires. Dispelling the debuff, however, skips the damage entirely.", ["Recasting Soul Rend on the same target refreshes the duration.", "Doing this delays the damage further, and gives more time to deal damage to the target.", "The damage is credited to the last caster of Soul Rend on the target."], "Only considers magical, physical and pure damage (after all reductions). Other sources of health loss are ignored.", "Applies Accuracy on the target, causing all attacks done against it to not miss to evasion or blind effects.", "The critical strike is only applied to attacks launched on a debuffed enemy. Previously launched attack projectiles are unaffected.", ["In reverse, this also means that projectiles launched during the debuff still crit even when landing after it already expired."], "Shares cooldown with  Orchid Malevolence."], "Cooldown": "", "data": ["Cast Range: 900", "Damage Amplification: 30%", "Critical Damage: 145%", "Duration: 5"], "types": {"Affects": ["Enemies"], "Ability": ["Target Unit"], "Damage": ["Magical"]}}}, {"Critical Strike": {"special_details": ["ILLUSIONS_CAN_USE Red critical numbers are before illusion and armor reduction."], "modifiers": {}, "description": "Grants each attack a chance to deal additional damage. Critical Strike does not work against buildings.", "Mana": "", "ability_special": ["NOT_UNIQUE_ATTACK_MODIFIER", "ILLUSIONS_CAN_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Increases attack damage by an average of 15%.", "The proc chances of multiple crit sources stack.", ["If two sources of critical strike proc at the same time, the higher multiplier has priority."], "Critical Strike uses pseudo-random distribution."], "Cooldown": "", "data": ["Proc Chance: 20%", "Critical Damage: 175%"], "types": {"Affects": ["Enemies"], "Ability": ["Passive"]}}}], "availability": [], "cost": "7195 (1000)", "details": {"Bonus": ["+25 Intelligence", "+150% Mana regeneration", "+60 Attack damage", "+30 Attack speed"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Critical Strike"], "Disassemble?": ["No"], "Active": ["Soul Rend"], "builds_from": ["Orchid Malevolence", "Crystalys", "Recipe"]}, "lore": "A reviled blade that bites deeper with each wriggle of its victim's final throes.", "type": "Weapons", "additional_info": ["One Bloodthorn grants a total of 30 attack speed, 300 mana, 1 (+150%) mana regeneration, 1.5625% spell damage and 60 (85 to intelligence heroes) attack damage."]}, "Yasha": {"abilities": [], "availability": [], "cost": "2050 (600)", "details": {"Bonus": ["+16 Agility", "+15 Attack speed", "+8% Movement Speed"], "builds_from": ["Blade of Alacrity", "Band of Elvenskin", "Recipe"], "builds_into": ["Manta Style", "Sange and Yasha"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "Yasha is regarded as the swiftest weapon ever created.", "type": "Artifacts", "additional_info": ["Movement speed bonuses from multiple Yasha-based items (Yasha, Sange and Yasha, Manta Style) do not stack.", "Attack speed provided by Yasha-based items fully works for illusions.", "One Yasha grants a total of 2.29 armor and 31 attack speed (and 16 attack damage to agility heroes)."]}, "Refresher Orb": {"abilities": [{"Reset Cooldowns": {"special_details": [], "modifiers": {}, "description": "Resets the cooldowns of all your items and abilities.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Interrupts the user's channeling spells upon cast.", "Only refreshes items in the user's inventory. Items in the stash, in other units' inventories or dropped items are unaffected.", "Only refreshes items owned by the user. Allied items in the inventory are not refreshed.", "Refreshes all spells owned by the user. This includes hidden or inactive spells (e.g. invoked spells or  Battle Cry).", ["This means that it does not refresh all spells for  Rubick. Stolen spells are only refreshed when he owns them upon refreshing."], "Does not refresh the cooldown of  Cloak and Dagger and  Drunken Brawler's certain crit/evasion timers", "Visually resets the cooldown of  Tranquil Boots, but does not skip the broken state.", "Since items of same kind always share cooldown, it is not possible to refresh a Refresher Orb's cooldown with another Refresher Orb."], "Cooldown": "", "data": [], "types": {"Affects": ["Self"], "Ability": ["No Target"]}}}], "availability": [], "cost": "5200 (1800)", "details": {"Bonus": ["+12 Health regeneration", "+250% Mana regeneration", "+20 Attack damage"], "Alert allies?": ["No"], "builds_into": [], "Disassemble?": ["No"], "Active": ["Reset Cooldowns"], "builds_from": ["Perseverance", "Perseverance", "Recipe"]}, "lore": "A powerful artifact created for wizards.", "type": "Caster", "additional_info": ["Using Refresher Orb allows some skills to have two instances running simultaneously; for example, Eye of the Storm, Chaotic Offering.\n Note though that some spells are specifically coded to not be able to run multiple instances at the same time (e.g. Exorcism). Before building Refresher Orb, be sure that the ability you aim to use it with supports multiple instances at the same time or is worth having its duration doubled.", "Note though that some spells are specifically coded to not be able to run multiple instances at the same time (e.g. Exorcism). Before building Refresher Orb, be sure that the ability you aim to use it with supports multiple instances at the same time or is worth having its duration doubled."]}, "Sange": {"abilities": [{"Lesser Maim": {"special_details": ["NO_PIERCE_SPELL_IMMUNE Slow persists if debuff was placed before spell immunity and when not dispelled."], "modifiers": {"Sange Buff: Dispellable with any dispel.": "red"}, "description": "Each attack has a chance to slow the enemy's movement and attack speed for 4 seconds. The slow is based on whether the equipped hero is melee or ranged.", "Mana": "", "ability_special": ["NOT_UNIQUE_ATTACK_MODIFIER", "ILLUSIONS_CANNOT_USE", "NO_PIERCE_SPELL_IMMUNE"], "notes": ["Successive procs on the same target do not stack, but refresh the duration instead.", "The proc chances of Lesser Maim from multiple Sange work fully independently from each other.", "Fully stacks with the Lesser Maim from  Heaven's Halberd and the Greater Maim from  Sange and Yasha, including the slow.", "Does not work against wards and buildings. Works against allied units.", "Lesser Maim uses pseudo-random distribution."], "Cooldown": "", "data": ["Proc Chance: 20%", "Move Speed Slow (Melee): 20%", "Attack Speed Slow (Melee): 20", "Move Speed Slow (Ranged): 10%", "Attack Speed Slow (Ranged): 10", "Slow Duration: 4"], "types": {"Affects": ["Enemies"], "Ability": ["Passive"]}}}], "availability": [], "cost": "2050 (600)", "details": {"Bonus": ["+16 Strength", "+10 Attack damage"], "Alert allies?": ["No"], "builds_into": ["Sange and Yasha", "Heaven's Halberd"], "Passive": ["Lesser Maim"], "Disassemble?": ["No"], "builds_from": ["Ogre Club", "Belt of Strength", "Recipe"]}, "lore": "Sange is an unusually accurate weapon, seeking weak points automatically.", "type": "Artifacts", "additional_info": ["One Sange grants a total of 320 health, 0.48 health regeneration and 10 (26 to strength heroes) attack damage."]}, "Animal Courier": {"abilities": [{"Deploy Courier": {"special_details": [], "modifiers": {}, "description": "Deploys a creature to carry items to and from your team's base.", "Mana": "", "ability_special": [], "notes": ["Interrupts the user's channeling spells upon cast.", "The Animal Courier is not a valid target for most spells. A list of spells which affect the courier can be found below.", "It is possible to have multiple Animal Couriers. However, only the first created courier reacts on the courier button.", "All couriers are controllable by the entire team, no matter who buys and deploys the courier.", "When a courier dies, the opposing team's heroes get 150 gold each. If there already is a dead courier, no gold is granted.", ["However, an enemy making the killing blow on a courier always gets the 150 gold bounty."], "The Animal Courier is invulnerable when near its team's fountain.", "When an Animal Courier dies, it respawns in 120 seconds at the team's fountain. While dead, items in its inventory are unaccessable."], "Cooldown": "", "data": [], "types": {"Ability": ["No Target"]}}}, {"Return to Base": {"special_details": [], "modifiers": {}, "description": "Returns the courier to base.", "Mana": "", "ability_special": [], "notes": ["On both,  Radiant and  Dire side, the courier always walks to a spot about 400 range in front of the shop keeper, slightly to its right side."], "Cooldown": "", "data": ["Cast Animation: 0+0"], "types": {"Affects": ["Self"], "Ability": ["No Target"]}}}, {"Go To Secret Shop": {"special_details": [], "modifiers": {}, "description": "Sends the courier to your team's secret shop.", "Mana": "", "ability_special": [], "notes": ["Even when the secret shop on the enemy side of the map is closer, the courier still chooses the secret shop on its team's side of the map.", "The courier walks as close as possible to the shop keeper."], "Cooldown": "", "data": ["Cast Animation: 0+0"], "types": {"Affects": ["Self"], "Ability": ["No Target"]}}}, {"Return Items": {"special_details": [], "modifiers": {"Courier Return Stash Items: Undispellable.": "green"}, "description": "Return items to stash.", "Mana": "", "ability_special": [], "notes": ["When the courier has no items in its inventory, it stands still for a split second when casting this and then continues doing what it was doing previously.", "The courier walks to the same spot as with  Return to Base. But the items are already put into the stash when 700 range away from the shop."], "Cooldown": "", "data": ["Cast Animation: 0+0"], "types": {"Affects": ["Self"], "Ability": ["No Target"]}}}, {"Retrieve Items": {"special_details": [], "modifiers": {"Courier Take Stash Items: Undispellable.": "green"}, "description": "Retrieve items from stash.", "Mana": "", "ability_special": [], "notes": ["When the player has no items in its stash, it gives the \"No Items To Retrieve From Stash\" error message and does not interrupt the courier.", "Retrieves the items from the stash when getting within 700 range of the shop keeper. When the items are retrieved, the courier stops."], "Cooldown": "", "data": ["Cast Animation: 0+0"], "types": {"Affects": ["Self"], "Ability": ["No Target"]}}}, {"Transfer Items": {"special_details": [], "modifiers": {"Courier Transfer Items: Undispellable.": "green"}, "description": "Transfer items to hero.", "Mana": "", "ability_special": [], "notes": ["When the courier has no items in its inventory to transfer, it stands still for a split second when casting this and then continues doing what it was doing previously.", "After delivering the items, the courier automatically gets the  Return to Base order."], "Cooldown": "", "data": ["Cast Animation: 0+0"], "types": {"Affects": ["Self"], "Ability": ["No Target"]}}}], "availability": [], "cost": "100 ", "details": {"Charges": ["1"], "Alert allies?": ["No"], "builds_into": ["Flying Courier"], "Disassemble?": ["No"], "Active": ["Deploy Courier"], "builds_from": []}, "lore": "Losing the courier is punishable by death.", "type": "Consumables", "additional_info": ["Animal Courier is completely shareable.", "Animal Courier has a 2 minutes stock cooldown.", "Animal Courier can be upgraded to a Flying Courier."]}, "Drum of Endurance": {"abilities": [{"Endurance": {"special_details": ["ILLUSIONS_PARTIAL_USE Illusions benefit from the movement speed, but not the attack speed."], "modifiers": {"Item Ancient Janggo Active: Dispellable with any dispel.": "green"}, "description": "Gives bonus +25 attack speed and +13% movement speed to allies in a 900 radius.", "Mana": "", "ability_special": ["ILLUSIONS_PARTIAL_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Interrupts the user's channeling spells upon cast.", "Multiple casts of Endurance do not stack the buff, but refresh the duration instead.", "Only affects player controlled units, including invulnerable units, excluding wards."], "Cooldown": "", "data": ["Radius: 900", "Move Speed Bonus: 13%", "Attack Speed Bonus: 25", "Duration: 6"], "types": {"Affects": ["Allies"], "Ability": ["No Target"]}}}, {"Swiftness Aura": {"special_details": ["ILLUSIONS_CAN_USE Illusions benefit from the movement speed and the attack speed."], "modifiers": {"Item Ancient Janggo Aura Effect: Undispellable.": "green"}, "description": "Gives bonus attack and movement speed to allies in a 900 radius.Multiple instances of Swiftness Aura do not stack.", "Mana": "", "ability_special": ["ILLUSIONS_CAN_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["The aura's buff lingers for 0.5 seconds.", "Fully stacks with other sources of movement and attack speed bonuses, except for Swiftness Auras of multiple Drums.", "Affects invulnerable units."], "Cooldown": "", "data": ["Radius: 900", "Move Speed Bonus: 5%", "Attack Speed Bonus: 5"], "types": {"Affects": ["Allies"], "Ability": ["Aura"]}}}], "availability": [], "cost": "1785 (700)", "details": {"Charges": ["6"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Swiftness Aura"], "Bonus": ["+6 Strength", "+3 Agility", "+9 Intelligence", "+3 Health regeneration", "+3 Attack damage"], "Disassemble?": ["No"], "Active": ["Endurance"], "builds_from": ["Bracer", "Ring of Regen", "Wind Lace", "Recipe"]}, "lore": "A relic that enchants the bodies of those around it for swifter movement in times of crisis.", "type": "Support", "additional_info": ["The item does not disappear upon using up all charges.", "The charges can be replenished by purchasing the recipe again.", "One Drum of Endurance grants a total of 5% movement speed, 120 health, 3.18 health regeneration, 0.43 armor, 8 attack speed, 108 mana, 0.36 mana regeneration, 0.5625% spell damage and 9 attack damage to Strength heroes, 6 attack damage to Agility heroes and 12 attack damage to Intelligence heroes.\n Together with the aura and the active ability, it grants 33 attack speed to the owner.\n The aura and the active ability together grant a total of 18% movement speed and 30 attack speed to allies.", "Together with the aura and the active ability, it grants 33 attack speed to the owner.", "The aura and the active ability together grant a total of 18% movement speed and 30 attack speed to allies."]}, "Aether Lens": {"abilities": [{"Spell Range Bonus": {"special_details": [], "modifiers": {}, "description": "Increases spell cast range by 200.", "Mana": "", "ability_special": ["ILLUSIONS_CAN_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Cast range bonuses of multiple Aether Lenses do not stack.", "The cast range bonus only affects ability and item cast ranges. It does not affect the radius of any spell.", "Some spells which affect a line or an area in front of the caster, have their reach increased as well (with some exceptions).", "Blink and other blink-like spells also have their max distance increased.", "Does not affect the range of active attack modifiers,  Focus Fire and  Suicide Squad, Attack!."], "Cooldown": "", "data": ["Cast Range Increase: 200"], "types": {"Affects": ["Self"], "Ability": ["Passive"]}}}], "availability": [], "cost": "2300 (550)", "details": {"Bonus": ["+250 Mana", "+8 Health regeneration", "+5% Spell damage"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Spell Range Bonus"], "Disassemble?": ["No"], "builds_from": ["Energy Booster", "Ring of Health", "Recipe"]}, "lore": "Polished with the incantation of his final breath, the gift of a dying mage to his sickly son.", "type": "Caster", "additional_info": ["The spell damage bonus from multiple Aether Lenses stack.", "The spell damage bonus from Aether Lens (5%) is equivalent to the amount provided by 80 intelligence."]}, "Force Staff": {"abilities": [{"Force": {"special_details": ["PARTIAL_PIERCE_SPELL_IMMUNE Can be cast on self while spell immune.Cannot be cast on other spell immune units."], "modifiers": {"Item Forcestaff Active: Undispellable.": "green"}, "description": "Pushes any target unit 600 units in the direction it is facing. Double click to instantly cast Force on yourself.", "Mana": "", "ability_special": ["BLOCKED_BY_LINKEN", "PARTIAL_PIERCE_SPELL_IMMUNE"], "notes": ["Double clicking the item casts it on self.", "Pushes the target at a speed of 1500.", "The target is not disabled during the push, so it still can cast spells or items, attack and turn during the push.", "It also means that it does not cancel channeling spells of the target.", ["However, it interrupts the user's channeling spells upon cast, since it is a single target spell. It is not the push itself canceling them."], "Does not push units affected by a  Chronosphere,  Black Hole,  Duel,  Flaming Lasso or  Kinetic Field.", "Cannot break  Pounce leash. When casting on a leashed hero, it does not get pushed beyond the leash's max range.", "Can target any unit, except for wards and buildings. It can also push a  Homing Missile.", "Can force units over impassable terrain. Trees within 100 radius around the pushed target get destroyed during the push.", "Can be cast on Roshan but without any effect, since Roshan is immune to forced movement.", "Shares cooldown with  Hurricane Pike."], "Cooldown": "", "data": ["Cast Range: 800", "Push Distance: 600", "Push Duration: 0.4"], "types": {"Affects": ["Enemies / Allies"], "Ability": ["Target Unit"]}}}], "availability": [], "cost": "2225 (900)", "details": {"Bonus": ["+10 Intelligence", "+4 Health regeneration"], "Alert allies?": ["No"], "builds_into": ["Hurricane Pike"], "Disassemble?": ["No"], "Active": ["Force"], "builds_from": ["Staff of Wizardry", "Ring of Regen", "Recipe"]}, "lore": "Allows you to manipulate others, for good or evil.", "type": "Caster", "additional_info": ["One Force Staff grants a total of 4 health regeneration, 120 mana, 0.4 mana regeneration and 0.625% spell damage (and 10 attack damage to intelligence heroes)."]}, "Gloves of Haste": {"abilities": [], "availability": ["SIDE_SHOP"], "cost": "500 ", "details": {"Bonus": ["+20 Attack speed"], "builds_from": [], "builds_into": ["Armlet of Mordiggian", "Hand of Midas", "Maelstrom", "Power Treads"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "A pair of magical gloves that seems to render weapons weightless.", "type": "Arcane", "additional_info": []}, "Demon Edge": {"abilities": [], "availability": ["SECRET_SHOP"], "cost": "2400 ", "details": {"Bonus": ["+46 Attack damage"], "builds_from": [], "builds_into": ["Daedalus", "Divine Rapier", "Monkey King Bar"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "One of the oldest weapons forged by the Demon-Smith Abzidian, it killed its maker when he tested its edge.", "type": "Secret Shop", "additional_info": []}, "Sange and Yasha": {"abilities": [{"Greater Maim": {"special_details": ["NO_PIERCE_SPELL_IMMUNE Slow persists if debuff was placed before spell immunity and when not dispelled."], "modifiers": {"Sange And Yasha Buff: Dispellable with any dispel.": "red"}, "description": "Each attack has a chance to slow the enemy's movement and attack speed for 5 seconds. The slow is based on whether the equipped hero is melee or ranged.", "Mana": "", "ability_special": ["NOT_UNIQUE_ATTACK_MODIFIER", "ILLUSIONS_CANNOT_USE", "NO_PIERCE_SPELL_IMMUNE"], "notes": ["Successive procs on the same target do not stack, but refresh the duration instead.", "The proc chances of Greater Maim from multiple Sange and Yasha work fully independently from each other.", "Fully stacks with the Lesser Maim from  Sange and from  Heaven's Halberd, including the slow.", "Does not work against wards and buildings. Works against allied units.", "Greater Maim uses pseudo-random distribution."], "Cooldown": "", "data": ["Proc Chance: 30%", "Move Speed Slow (Melee): 26%", "Attack Speed Slow (Melee): 26", "Move Speed Slow (Ranged): 13%", "Attack Speed Slow (Ranged): 13", "Slow Duration: 5"], "types": {"Affects": ["Enemies"], "Ability": ["Passive"]}}}], "availability": [], "cost": "4100 ", "details": {"Bonus": ["+16 Strength", "+16 Agility", "+16 Attack damage", "+16 Attack speed", "+16% Movement Speed"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Greater Maim"], "Disassemble?": ["Yes"], "builds_from": ["Sange", "Yasha"]}, "lore": "Sange and Yasha, when attuned by the moonlight and used together, become a very powerful combination.", "type": "Artifacts", "additional_info": ["Movement speed bonuses from multiple Yasha-based items ( Yasha, Sange and Yasha, Manta Style) do not stack.", "Attack speed provided by Yasha-based items fully works for illusions.", "One Sange and Yasha grants a total of 320 health, 0.48 health regeneration, 2.29 armor, 32 attack speed and 16 (32 to strength and agility heroes) attack damage."]}, "Orb of Venom": {"abilities": [{"Poison Attack": {"special_details": [], "modifiers": {"Item Orb Of Venom Slow: Dispellable with any dispel.": "red"}, "description": "Poisons the target, dealing damage over time and slowing movement based on whether the equipped hero is melee or ranged.", "Mana": "", "ability_special": ["NOT_UNIQUE_ATTACK_MODIFIER", "ILLUSIONS_CAN_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Successive attacks with Orb of Venom do not stack, but refresh the duration instead.", "When a melee and a ranged hero with Orb of Venoms attack one target, the slow of the first applied debuff is used and refreshed.", "Deals damage in 1 second intervals, starting 1 second after the debuff is applied, resulting in 4 instances.", "Can deal up to 12 damage (before reductions).", "Does not work against wards and buildings. Works against couriers.", "The damage over time is lethal."], "Cooldown": "", "data": ["Move Speed Slow (Melee): 12%", "Move Speed Slow (Ranged): 4%", "Damage per Second: 3", "Duration: 4"], "types": {"Affects": ["Enemies"], "Ability": ["Passive"], "Damage": ["Magical"]}}}], "availability": ["SIDE_SHOP"], "cost": "275 ", "details": {"Passive": ["Poison Attack"], "builds_from": [], "builds_into": ["Eye of Skadi"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "Envenoms your veapon with the venom of a venomous viper.", "type": "Armaments", "additional_info": ["Orb of Venom's lore Envenoms your veapon with the venom of a venomous viper. is a reference to the quote of V for Vendetta. \"Weapon\" was intentionally written wrong, with a V, for the reference's sake."]}, "Vladmir's Offering": {"abilities": [{"Vladmir's Aura": {"special_details": ["ILLUSIONS_CANNOT_USE Illusions provide the aura, but do not benefit from it."], "modifiers": {"Item Vladmir Aura: Undispellable.": "green"}, "description": "Grants lifesteal, health regeneration, mana regeneration, bonus attack damage, and armor to allies in a 900 radius. The lifesteal percentage is based on whether the hero affected by the aura is melee or ranged.Multiple instances of Vladmir's Aura do not stack.", "Mana": "", "ability_special": ["ILLUSIONS_CANNOT_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["The aura bonuses do not stack with the auras from  Ring of Basilius,  Ring of Aquila and other Vladmir's Offerings.", "The lifesteal is not a Unique Attack Modifier, so it stacks additively with all other sources of lifesteal.", "Cannot lifesteal off of wards, buildings and allied units.", "Only increases base damage and that given by the primary attribute of affected units. Raw bonus damage is not increased.", "Restores mana in the form of mana regeneration, so it regenerates 0.08 mana in 0.1 second intervals, which makes 0.8 mana per second.", "The flat mana regen bonus is not considered by percentage mana regeneration increases.", "Regenerates up to 48 mana and 180 health in one minute.", "The aura's buff lingers for 0.5 seconds.", "Affects invulnerable units."], "Cooldown": "", "data": ["Radius: 900", "Lifesteal (Melee): 15%", "Lifesteal (Ranged): 10%", "Attack Damage Bonus: 15%", "Mana Regeneration Bonus: 0.8", "Health Regeneration Bonus: 3", "Armor Bonus: 4"], "types": {"Affects": ["Allies"], "Ability": ["Aura"]}}}], "availability": [], "cost": "2275 (300)", "details": {"Bonus": ["+2 Strength", "+2 Agility", "+2 Intelligence"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Vladmir's Aura"], "Disassemble?": ["No"], "builds_from": ["Morbid Mask", "Ring of Basilius", "Headdress", "Recipe"]}, "lore": "An eerie mask that is haunted with the malice of a fallen vampire.", "type": "Support", "additional_info": ["One Vladmir's Offering grants a total of 40 health, 3.06 health regeneration, 4.29 armor, 2 attack speed, 24 mana, 0.88 mana regeneration, 0.125% spell damage and 2 attack damage."]}, "Manta Style": {"abilities": [{"Mirror Image": {"special_details": [], "modifiers": {"Manta Phase: Undispellable.": "green"}, "description": "Creates 2 images of your hero that last 20 seconds. Melee heroes have a 30 second cooldown on this ability, while for Ranged heroes the cooldown is 45 seconds.Melee images deal 33% damage and take 350% damage, while Ranged images deal 28% and take 400% damage.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Has 45 seconds cooldown for ranged heroes and 30 seconds cooldown for melee heroes.", "The user is invulnerable, hidden and spell immune during the split time.", "Disjoints projectiles upon cast.", "Applies a basic dispel on the owner upon cast.", "Resets all current attack and spell targeting orders from other units on the owner.", "The formation of the owner and the illusions is always the same. One spawns on the owner's cast location and the others randomly on north, east, south or west side each.", "Though the formation is always the same, the owner and the illusions take a random position in the formation and have all the same facing angle.", "Provides 1000 radius ground vision for a second upon cast.", "Recasting this replaces the illusions from the previous cast which are currently under the owner's control."], "Cooldown": "", "data": ["Split Time: 0.1", "Number of Illusions: 2", "Illusion Damage Dealt (Melee): 33%", "Illusion Damage Taken (Melee): 350%", "Illusion Damage Dealt (Ranged): 28%", "Illusion Damage Taken (Ranged): 400%", "Illusion Duration: 20"], "types": {"Affects": ["Self"], "Ability": ["No Target"]}}}], "availability": [], "cost": "4950 (800)", "details": {"Bonus": ["+10 Strength", "+26 Agility", "+10 Intelligence", "+15 Attack speed", "+10% Movement Speed"], "Alert allies?": ["No"], "builds_into": [], "Disassemble?": ["Yes"], "Active": ["Mirror Image"], "builds_from": ["Ultimate Orb", "Yasha", "Recipe"]}, "lore": "An axe made of reflective materials that causes confusion amongst enemy ranks.", "type": "Armor", "additional_info": ["Movement speed bonuses from multiple Yasha-based items ( Yasha, Sange and Yasha, Manta Style) do not stack.", "Attack speed provided by Yasha-based items fully works for illusions.", "One Manta Style grants a total of 10% movement speed, 200 health, 0.3 health regeneration, 3.71 armor, 41 attack speed, 120 mana, 0.4 mana regeneration, 0.625% spell damage and 10 (26 to agility heroes) attack damage."]}, "Bottle": {"abilities": [{"Regenerate": {"special_details": [], "modifiers": {"Bottle Regeneration: Undispellable.": "green"}, "description": "Consumes a charge to restore Health and Mana over time. Healing stops if attacked. Bottle can be refilled at your team's fountain. If Bottle does not have full charges and is placed on a courier, the courier will move 30% slower.Hold Control to use Regenerate on an allied hero. Stored runes cannot be shared.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Interrupts the user's channeling spells upon cast.", "Has no effect when used while having no charges left, only the cooldown gets triggered.", "Successive casts on the same target do not stack, but refresh the duration instead.", "When casting without the Control key, it always casts on self in one click. When holding the Control key, a target has to be selected.", "If the target is more than 600 range away, the caster moves to the target until it is within 350 range before casting.", "Can only target heroes (including illusions) and creep-heroes.", "Couriers can cast Regenerate, putting the item on its cooldown, but not regenerating the target or wasting a charge.", "The owner does not have to face the target to give it a Bottle charge.", "Restores in the form of regeneration, so it restores 3.6 health / 2.4 mana in 0.1 second intervals, which is 36 health / 24 mana per second.", "All 3 charges together can restore up to 270 health and 180 mana.", "Is dispelled by any damage equal to or greater than 20 (before reductions), including self-inflicted damage.", "Is not dispelled by damage flagged as HP Removal.", "Is always dispelled by attacks, even when the attack dealt no damage.", "Fully stacks with other mana regeneration increasing effects."], "Cooldown": "", "data": ["Cast Range: 600", "Number of Charges: 3", "Total Health Restored: 90", "Total Mana Restored: 60", "Duration: 2.5"], "types": {"Affects": ["Self /  Allied Heroes"], "Ability": ["No Target  /  Target Unit"]}}}, {"Store Rune": {"special_details": [], "modifiers": {}, "description": "Right-click on a rune to store it in the Bottle for later use. Stored runes can be manually activated, but are activated automatically after 2 minutes. The Bottle gets refilled upon activating the rune.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["A rune can be stored into the Bottle by making a right-click on the rune.", "Runes can be stored without the bottle being empty. When storing while still having charges left, the charges get lost.", "Only heroes and  Lone Druid's Spirit Bear can store runes. Illusions and couriers cannot.", "Only one rune can be stored in a Bottle at a time. Attempting to store another rune into it just directly uses the new targeted rune.", ["However, it is possible to have multiple Bottles in the inventory and store a rune with each of them."], "While having a rune stored, the Regenerate ability activates the rune, instead of regenerating the user.", "The stored rune can be activated at any time by using the Bottle. Activating the rune fully refills the Bottle with 3 charges.", "A Bottle with a rune stored cannot be dropped from the inventory."], "Cooldown": "", "data": ["Cast Range: 100", "Rune Store Duration: 120"], "types": {"Affects": ["Self"], "Ability": ["Passive"]}}}], "availability": ["SIDE_SHOP"], "cost": "660 ", "details": {"Alert allies?": ["No"], "builds_into": [], "Passive": ["Store Rune"], "Disassemble?": ["No"], "Active": ["Regenerate"], "builds_from": []}, "lore": "An old bottle that survived the ages, the contents placed inside become enchanted.", "type": "Consumables", "additional_info": ["Bottles are fully sharable.\n However, a Bottle which currently contains a Rune cannot be shared.", "However, a Bottle which currently contains a Rune cannot be shared.", "The Bottle does not disappear upon using up all charges.", "Bottles are automatically replenished when the carrier is affected by the Fountain's Rejuvenation Aura.", "A Bottle slows couriers which carry it by 30% if the Bottle is not full (3 charges). This effect stacks."]}, "Assault Cuirass": {"abilities": [{"Assault Aura": {"special_details": [], "modifiers": {"Item Assault Negative Armor: Undispellable.": "green", "Item Assault Positive: Undispellable.": "green"}, "description": "Grants attack speed and armor to nearby allied units and structures, and decreases the armor of nearby enemies.Multiple instances of Assault Aura do not stack.", "Mana": "", "ability_special": ["ILLUSIONS_CAN_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Fully stacks with other attack speed increasing, armor increasing and armor decreasing effects.", "A unit can be affected by the positive and the negative aura at the same time.", "The aura's buff and debuff linger for 0.5 seconds.", "The status debuff icon on enemies only shows up when the affected unit has vision over the source.", "Both the positive and the negative aura affect buildings.", "Affects invulnerable allies and enemies."], "Cooldown": "", "data": ["Radius: 900", "Allies Attack Speed Bonus: 20", "Allies Armor Bonus: 5", "Enemy Armor Reduction: 5"], "types": {"Affects": ["Allies / Enemies"], "Ability": ["Aura"]}}}], "availability": [], "cost": "5250 (1300)", "details": {"Bonus": ["+10 Armor", "+35 Attack speed"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Assault Aura"], "Disassemble?": ["No"], "builds_from": ["Platemail", "Hyperstone", "Chainmail", "Recipe"]}, "lore": "Forged in the depths of the nether reaches, this hellish mail provides an army with increased armor and attack speed.", "type": "Armor", "additional_info": ["Together with the aura, one Assault Cuirass grants a total of 15 armor and 55 attack speed to the owner."]}, "Soul Ring": {"abilities": [{"Sacrifice": {"special_details": [], "modifiers": {"Item Soul Ring Buff: Undispellable.": "green"}, "description": "Consume 150 health to temporarily gain 150 mana. Lasts 10 seconds.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Interrupts the user's channeling spells upon cast.", "If the mana bonus would exceed the user's current mana pool, its max mana pool is temporarily increased by the exceeding amount.", "At the end of the duration, the user loses any of the unused mana of the 150 mana.", ["If its maximum mana pool was increased, it goes back to normal if it was exceeded."], "Only counts actually spent mana. Mana lost in other ways (like  Nether Ward,  Mana Break or  Mana Burn) does not count.", "The lost health is not gained back when the gained mana was unused or partly unused.", "The 150 health lost upon cast is never lethal. When casting with less than 150 health, the user's health goes down to 1."], "Cooldown": "", "data": ["Health Cost: 150", "Temporary Mana Bonus: 150", "Duration: 10"], "types": {"Affects": ["Self"], "Ability": ["No Target"], "Damage": ["Pure", "HP Removal"]}}}], "availability": [], "cost": "775 (125)", "details": {"Bonus": ["+3 Health regeneration", "+50% Mana regeneration"], "Alert allies?": ["No"], "builds_into": ["Bloodstone"], "Disassemble?": ["No"], "Active": ["Sacrifice"], "builds_from": ["Ring of Regen", "Sage's Mask", "Recipe"]}, "lore": "A ring that feeds on the souls of those who wear it.", "type": "Common", "additional_info": ["When the cooldown goes off (30 seconds) the HP regenerated is 60% from the original 150 HP consumed, so the value of HP used for the Sacrifice ability is 60 HP, only the 40% of the total used.", "If your hero has low health or no means of regenerating health, consider picking up Tranquil Boots too in order to refill health after using the active a lot.", "Consider dropping items that increase mana capacity before using Soul Ring and picking them back up afterwards. Dropping those items decreases your mana capacity while current mana percentage remains the same, but Soul Ring still gives the full amount of mana. Picking up the items afterwards increases mana capacity while retaining the same percentage, thus resulting in a net gain of mana. As an added bonus, the extra mana gained through this method does not count as having been gained through the Soul Ring, and as such, will not be lost at the end of the duration even if unused."]}, "Quarterstaff": {"abilities": [], "availability": ["SIDE_SHOP"], "cost": "875 ", "details": {"Bonus": ["+10 Attack damage", "+10 Attack speed"], "builds_from": [], "builds_into": ["Oblivion Staff", "Butterfly"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "A basic staff that allows you to strike quickly.", "type": "Armaments", "additional_info": []}, "Shadow Amulet": {"abilities": [{"Fade": {"special_details": [], "modifiers": {"Item Shadow Amulet Fade: Undispellable.": "green"}, "description": "Grants invisibility to you or a target allied hero after a 1.5 second fade time. Moving breaks the invisibility. There is no cooldown when using this item on yourself.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Does not interrupt the user's channeling spells upon cast, neither when cast on self, nor when cast on allies.", "If the target is more than 850 range away, the caster moves to the target until it is within 600 range before casting.", "When casting on allies, the user does not have to face the targeted ally to cast it. Does not interrupt the target's channeling spells.", "During the fade time, the unit can still cast spells, use items and perform attacks.", "After the fade time, the unit automatically stops moving or attacking, but it does not stop spell casts.", "While invisible, the unit can turn and pick up or drop items without breaking the invisibility.", "While invisible, the unit is phased, meaning other units can walk through it without getting blocked.", "The invisibility is lost upon reaching the cast point of spells or items or upon performing an attack.", "It also gets lost when getting forcefully moved, except when the movement is only upwards."], "Cooldown": "", "data": ["Cast Range: 850", "Fade Time: 1.5"], "types": {"Affects": ["Allies"], "Ability": ["Target Unit"]}}}], "availability": [], "cost": "1300 ", "details": {"Bonus": ["+20 Attack speed"], "Alert allies?": ["No"], "builds_into": ["Shadow Blade", "Glimmer Cape"], "Disassemble?": ["No"], "Active": ["Fade"], "builds_from": []}, "lore": "A small talisman that clouds the senses of one's enemies when held perfectly still.", "type": "Arcane", "additional_info": ["Fading into invisibility", "Fully invisible"]}, "Sage's Mask": {"abilities": [], "availability": ["SIDE_SHOP"], "cost": "325 ", "details": {"Bonus": ["+50% Mana regeneration"], "builds_from": [], "builds_into": ["Medallion of Courage", "Oblivion Staff", "Ring of Basilius", "Soul Ring", "Urn of Shadows"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "A mask commonly used by mages and warlocks for various rituals.", "type": "Arcane", "additional_info": ["Sage's Mask is partially shareable."]}, "Ring of Aquila": {"abilities": [{"Aquila Aura": {"special_details": ["ILLUSIONS_CANNOT_USE Illusions provide the aura, but do not benefit from it."], "modifiers": {"Item Ring Of Aquila Aura Bonus: Undispellable.": "green"}, "description": "Grants mana regeneration and armor in a 900 area of effect.Toggle whether the aura affects other non-hero units.Multiple instances of Aquila Aura do not stack.", "Mana": "", "ability_special": ["ILLUSIONS_CANNOT_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Does not interrupt the user's channeling spells upon toggling.", "Restores mana in the form of mana regeneration, so it regenerates 0.065 mana in 0.1 second intervals, which makes 0.65 mana per second.", "The flat mana regen bonus is not considered by percentage mana regeneration increases.", "Regenerates up to 39 mana in one minute.", "The aura bonuses do not stack with the auras from Ring of Aquila,  Ring of Basilius and  Vladmir's Offering.", "The aura's buff lingers for 0.5 seconds.", "Treats creep-heroes as heroes."], "Cooldown": "", "data": ["Radius: 900", "Mana Regeneration Bonus: 0.65", "Armor Bonus: 2"], "types": {"Affects": ["Allies /  Allied Heroes"], "Ability": ["Toggle  /  Aura"]}}}], "availability": [], "cost": "985 ", "details": {"Bonus": ["+3 Strength", "+9 Agility", "+3 Intelligence", "+10 Attack damage"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Aquila Aura"], "Disassemble?": ["Yes"], "builds_from": ["Wraith Band", "Ring of Basilius"]}, "lore": "The ring of the fallen Warlord Aquila continues to support armies in battle.", "type": "Support", "additional_info": ["One Ring of Aquila grants a total of 60 health, 0.09 health regeneration, 3.29 armor, 9 attack speed, 36 mana, 0.77 mana regeneration, 0.1875% spell damage and 13 (19 to agility heroes) attack damage."]}, "Orchid Malevolence": {"abilities": [{"Soul Burn": {"special_details": ["NO_PIERCE_SPELL_IMMUNE Effects persist and attempts to deal damage when expiring while spell immune if debuff was placed before spell immunity and when not dispelled."], "modifiers": {"Orchid Malevolence Debuff: Dispellable with any dispel.": "red"}, "description": "Silences the target unit for 5 seconds and amplifies the damage it takes by 30%.", "Mana": "", "ability_special": ["BLOCKED_BY_LINKEN", "NO_PIERCE_SPELL_IMMUNE"], "notes": ["Does not directly amplify damage as it is dealt, but rather saves all damage values and deals 30% of it 5 seconds after cast.", ["This means that the damage can be avoided by becoming spell immune or invulnerable/hidden at the end of the duration."], "The damage is applied as soon as the debuff expires. Dispelling the debuff, however, skips the damage entirely.", ["Recasting Soul Burn on the same target refreshes the duration.", "Doing this delays the damage further, and gives more time to deal damage to the target.", "The damage is credited to the last caster of Soul Burn on the target."], "Only considers magical, physical and pure damage (after all reductions). Other sources of health loss are ignored.", "Shares cooldown with  Bloodthorn."], "Cooldown": "", "data": ["Cast Range: 900", "Damage Amplification: 30%", "Duration: 5"], "types": {"Affects": ["Enemies"], "Ability": ["Target Unit"], "Damage": ["Magical"]}}}], "availability": [], "cost": "4075 (775)", "details": {"Bonus": ["+25 Intelligence", "+150% Mana regeneration", "+30 Attack damage", "+30 Attack speed"], "Alert allies?": ["No"], "builds_into": ["Bloodthorn"], "Disassemble?": ["No"], "Active": ["Soul Burn"], "builds_from": ["Oblivion Staff", "Oblivion Staff", "Recipe"]}, "lore": "A garnet rod constructed from the essence of a fire demon.", "type": "Caster", "additional_info": ["One Orchid Malevolence grants a total of 30 attack speed, 300 mana, 1 (+ 150%) mana regeneration, 1.5625% spell damage and 30 (55 to intelligence heroes) attack damage."]}, "Glimmer Cape": {"abilities": [{"Glimmer": {"special_details": [], "modifiers": {"Invisible: Dispellable with any dispel.": "green", "Item Glimmer Cape Fade: Dispellable with any dispel.": "green"}, "description": "After a 0.6 second delay, grants invisibility and 45% magic resistance to you or a target allied unit. Can be cast while channelling.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Does not interrupt the user's channeling spells upon cast, neither when cast on self, nor when cast on allies.", "If the target is more than 1050 range away, the caster moves to the target until it is within 800 range before casting.", "When casting on allies, the user does not have to face the targeted ally to cast it. Does not interrupt the target's channeling spells.", "Places a buff on an allied hero. As long as this buff stays on it, the hero keeps on turning invisible.", "The fade time is reset and invisibility is lost upon reaching the cast point of spells or items or upon performing an attack.", "While invisible, the unit can pick up or drop items without having to go through the fade time again.", "While invisible, the unit is phased, meaning other units can walk through it without getting blocked.", "The magic resistance is only applied when fully invisible. It is not applied during the fade time."], "Cooldown": "", "data": ["Cast Range: 1050", "Fade Time: 0.6", "Magic Resistance Bonus: 45%", "Duration: 5"], "types": {"Affects": ["Allies"], "Ability": ["Target Unit"]}}}], "availability": [], "cost": "1850 ", "details": {"Bonus": ["+15% Magic resistance", "+20 Attack speed"], "Alert allies?": ["No"], "builds_into": [], "Disassemble?": ["Yes"], "Active": ["Glimmer"], "builds_from": ["Shadow Amulet", "Cloak"]}, "lore": "The stolen cape of a master illusionist.", "type": "Caster", "additional_info": ["The magic resistance stacks multiplicatively with other sources of magic resistance."]}, "Heart of Tarrasque": {"abilities": [{"Health Regeneration": {"special_details": ["ILLUSIONS_CANNOT_USE Goes into cooldown when the illusion takes damage, just like on heroes, however, they do not benefit from the health regen."], "modifiers": {}, "description": "Restores a percentage of max health per second. If damage is taken from an enemy hero or Roshan, this ability is disabled for 5 seconds for melee heroes, or 7 seconds for ranged heroes.", "Mana": "", "ability_special": ["ILLUSIONS_CANNOT_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Health Regeneration from multiple Hearts of Tarrasque do not stack.", "Heals in the form of health regeneration, so it heals for 0.475% of maximum health in 0.1 second intervals.", "Can fully heal the owner in 21.05 seconds.", "Damage greater than 0 from any player (including allies, but not self) or Roshan puts the regeneration on a 5 second cooldown.", ["Since it is a cooldown and not actually disabled, it can be refreshed with  Refresher Orb and  Rearm.", "However, this cooldown is not affected by  Octarine Core or  Arcane Rune.", "Does not get disabled by HP Removal."]], "Cooldown": "", "data": ["Max Health Restored per Second: 4.75%"], "types": {"Affects": ["Self"], "Ability": ["Passive"]}}}], "availability": [], "cost": "5500 (1400)", "details": {"Bonus": ["+45 Strength", "+250 Health"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Health Regeneration"], "Disassemble?": ["No"], "builds_from": ["Reaver", "Vitality Booster", "Recipe"]}, "lore": "Preserved heart of an extinct monster, it bolsters the bearer's fortitude.", "type": "Armor", "additional_info": ["One Heart of Tarrasque grants a total of 1150 health and 1.35 (+ 4.75% of max health) health regeneration (and 45 attack damage to strength heroes)."]}, "Helm of Iron Will": {"abilities": [], "availability": ["SIDE_SHOP"], "cost": "900 ", "details": {"Bonus": ["+3 Health regeneration", "+5 Armor"], "builds_from": [], "builds_into": ["Armlet of Mordiggian", "Helm of the Dominator", "Veil of Discord"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "The helmet of a legendary warrior who fell in battle.", "type": "Armaments", "additional_info": []}, "Dagon": {"abilities": [{"Energy Burst": {"special_details": ["BLOCKED_BY_LINKEN Particles still visually appear."], "modifiers": {"Dagon: Undispellable.": "red"}, "description": "Emits a powerful burst of magical damage upon a targeted enemy unit.", "Mana": "", "ability_special": ["BLOCKED_BY_LINKEN", "NO_PIERCE_SPELL_IMMUNE"], "notes": ["The damage is applied instantly, so it cannot be avoided."], "Cooldown": "", "data": ["Cast Range: 600/650/700/750/800", "Damage: 400/500/600/700/800"], "types": {"Affects": ["Enemies"], "Ability": ["Target Unit"], "Damage": ["Magical"]}}}], "availability": [], "cost": "2720 (1250)", "details": {"Bonus": ["+3 Strength", "+3 Agility", "+16/19/22/25/28 Intelligence", "+9 Attack damage"], "Alert allies?": ["No"], "builds_into": ["Dagon"], "Disassemble?": ["No"], "Active": ["Energy Burst"], "builds_from": ["Staff of Wizardry", "Null Talisman", "Recipe"]}, "lore": "A lesser wand that grows in power the longer it is used, it brings magic to the fingertips of the user.", "type": "Caster", "additional_info": ["Upgrading the item improves its stats and the damage, range and cooldown of Energy Burst. Can be upgraded four times.", "The total gold cost for each level is 2720/3970/5220/6470/7720.", "One Dagon grants the following on each level:\n Level 1: 60 health, 0.09 health regeneration, 0.43 armor, 3 attack speed, 192 mana, 0.64 mana regeneration, 1% spell damage and 12 (25 to intelligence heroes) attack damage.\n Level 2: 60 health, 0.09 health regeneration, 0.43 armor, 3 attack speed, 228 mana, 0.76 mana regeneration, 1.1875% spell damage and 12 (28 to intelligence heroes) attack damage.\n Level 3: 60 health, 0.09 health regeneration, 0.43 armor, 3 attack speed, 264 mana, 0.88 mana regeneration, 1.375% spell damage and 12 (31 to intelligence heroes) attack damage.\n Level 4: 60 health, 0.09 health regeneration, 0.43 armor, 3 attack speed, 300 mana, 1 mana regeneration, 1.5625% spell damage and 12 (34 to intelligence heroes) attack damage.\n Level 5: 60 health, 0.09 health regeneration, 0.43 armor, 3 attack speed, 336 mana, 1.12 mana regeneration, 1.75% spell damage and 12 (37 to intelligence heroes) attack damage.", "Level 1: 60 health, 0.09 health regeneration, 0.43 armor, 3 attack speed, 192 mana, 0.64 mana regeneration, 1% spell damage and 12 (25 to intelligence heroes) attack damage.", "Level 2: 60 health, 0.09 health regeneration, 0.43 armor, 3 attack speed, 228 mana, 0.76 mana regeneration, 1.1875% spell damage and 12 (28 to intelligence heroes) attack damage.", "Level 3: 60 health, 0.09 health regeneration, 0.43 armor, 3 attack speed, 264 mana, 0.88 mana regeneration, 1.375% spell damage and 12 (31 to intelligence heroes) attack damage.", "Level 4: 60 health, 0.09 health regeneration, 0.43 armor, 3 attack speed, 300 mana, 1 mana regeneration, 1.5625% spell damage and 12 (34 to intelligence heroes) attack damage.", "Level 5: 60 health, 0.09 health regeneration, 0.43 armor, 3 attack speed, 336 mana, 1.12 mana regeneration, 1.75% spell damage and 12 (37 to intelligence heroes) attack damage."]}, "Arcane Boots": {"abilities": [{"Replenish Mana": {"special_details": [], "modifiers": {}, "description": "Restores mana to all allies in a 900 area around the hero.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Interrupts the user's channeling spells upon cast.", "Affects every allied unit, including illusions, invulnerable units and hidden units, excluding wards and buildings.", "Meepo clones cannot cast Replenish Mana."], "Cooldown": "", "data": ["Radius: 900", "Mana Restored: 135"], "types": {"Affects": ["Allies"], "Ability": ["No Target"]}}}], "availability": ["SIDE_SHOP"], "cost": "1300 ", "details": {"Bonus": ["+250 Mana", "+50 Movement Speed"], "Alert allies?": ["Yes"], "builds_into": ["Guardian Greaves"], "Disassemble?": ["Yes"], "Active": ["Replenish Mana"], "builds_from": ["Boots of Speed", "Energy Booster"]}, "lore": "Magi equipped with these boots are valued in battle.", "type": "Support", "additional_info": ["Movement speed bonuses from multiple pairs of boots do not stack.", "Stacks with all other movement speed bonuses."]}, "Slippers of Agility": {"abilities": [], "availability": ["SIDE_SHOP"], "cost": "150 ", "details": {"Bonus": ["+3 Agility"], "builds_from": [], "builds_into": ["Poor Man's Shield", "Wraith Band"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "Light boots made from spider skin that tingles your senses.", "type": "Attributes", "additional_info": ["One Slippers of Agility grants a total of 0.43 armor and 3 attack speed (and 3 attack damage to agility heroes)."]}, "Null Talisman": {"abilities": [], "availability": [], "cost": "470 (155)", "details": {"Bonus": ["+3 Strength", "+3 Agility", "+6 Intelligence", "+3 Attack damage"], "builds_from": ["Circlet", "Mantle of Intelligence", "Recipe"], "builds_into": ["Dagon", "Veil of Discord"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "A small gemstone attached to several chains.", "type": "Common", "additional_info": ["One Null Talisman grants a total of 60 health, 0.09 health regeneration, 0.43 armor, 3 attack speed, 72 mana, 0.24 mana regeneration, 0.375% spell damage and 6 (9 to intelligence heroes) attack damage."]}, "Belt of Strength": {"abilities": [], "availability": ["SIDE_SHOP"], "cost": "450 ", "details": {"Bonus": ["+6 Strength"], "builds_from": [], "builds_into": ["Skull Basher", "Necronomicon", "Power Treads", "Sange"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "A valued accessory for improving vitality.", "type": "Attributes", "additional_info": ["One Belt of Strength grants a total of 120 health and 0.18 health regeneration (and 6 attack damage to strength heroes)."]}, "Ghost Scepter": {"abilities": [{"Ghost Form": {"special_details": ["NO_PIERCE_SPELL_IMMUNE Can be cast while spell immune. However, the buff gets immediately removed if spell immunity is detected."], "modifiers": {"Ghost State: Dispellable with any dispel.": "green"}, "description": "Enter ghost form, becoming immune to physical damage, yet unable to attack and taking 40% extra magic damage.", "Mana": "", "ability_special": ["NO_PIERCE_SPELL_IMMUNE"], "notes": ["Interrupts the user's channeling spells upon cast.", "Reduces most heroes' total magic resistance to -5%, (assuming basic 25% magic resistance).", "Reduces  Meepo's total magic resistance to 9% and  Visage's total magic resistance to -26%.", "Ghost Form's magic resistance reduction does not stack with other ethereal effects, the one with higher value takes priority.", "Shares cooldown with  Ethereal Blade."], "Cooldown": "", "data": ["Magic Resistance Reduction: 40%", "Duration: 4"], "types": {"Affects": ["Self"], "Ability": ["No Target"]}}}], "availability": [], "cost": "1500 ", "details": {"Bonus": ["+5 Strength", "+5 Agility", "+5 Intelligence"], "Alert allies?": ["No"], "builds_into": ["Ethereal Blade"], "Disassemble?": ["No"], "Active": ["Ghost Form"], "builds_from": []}, "lore": "Imbues the wielder with a ghostly presence, allowing them to evade physical damage.", "type": "Arcane", "additional_info": ["One Ghost Scepter grants a total of 100 health, 0.15 health regeneration, 0.71 armor, 5 attack speed, 60 mana, 0.2 mana regeneration, 0.3125% spell damage and 5 attack damage."]}, "Faerie Fire": {"abilities": [{"Consume": {"special_details": [], "modifiers": {}, "description": "Consume the Faerie Fire to instantly restore 75 health.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Interrupts the user's channeling spells upon cast.", "Restores the amount of health instantly."], "Cooldown": "", "data": ["Health Restored: 75"], "types": {"Affects": ["Self"], "Ability": ["No Target"]}}}], "availability": [], "cost": "75 ", "details": {"Charges": ["1"], "Alert allies?": ["No"], "builds_into": [], "Bonus": ["+2 Attack damage"], "Disassemble?": ["No"], "Active": ["Consume"], "builds_from": []}, "lore": "The ethereal flames from the ever-burning ruins of Kindertree ignite across realities.", "type": "Consumables", "additional_info": ["Faerie Fire does not stack in the inventory. Each of them requires its own slot. Their attack damage bonus does stack.", "Faerie Fire is not shareable and cannot be used on allies."]}, "Satanic": {"abilities": [{"Unholy Rage": {"special_details": [], "modifiers": {"Item Satanic Unholy: Dispellable with any dispel.": "green"}, "description": "Increases Lifesteal percentage to 200% for 4.5 seconds.", "Mana": "", "ability_special": ["UNIQUE_ATTACK_MODIFIER", "PIERCE_SPELL_IMMUNE"], "notes": ["Interrupts the owner's channeling spells upon cast.", "Directly increases the lifesteal granted by its passive part by 175%, resulting in 200% lifesteal."], "Cooldown": "", "data": ["Lifesteal Bonus: 175%", "Duration: 4.5"], "types": {"Affects": ["Self"], "Ability": ["No Target"]}}}, {"Lifesteal": {"special_details": ["ILLUSIONS_CANNOT_USE Lifesteal particles are visible on illusions, but they do not gain health from their attacks.", "UNIQUE_ATTACK_MODIFIER Can be combined with Eye of Skadi's Unique Attack Modifier."], "modifiers": {}, "description": "Heals the attacker for a percentage of attack damage dealt.", "Mana": "", "ability_special": ["UNIQUE_ATTACK_MODIFIER", "ILLUSIONS_CANNOT_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["The lifesteal stacks additively with other sources of lifesteal which are not Unique Attack Modifiers.", "Cannot lifesteal off of wards, buildings or allied units."], "Cooldown": "", "data": ["Lifesteal: 25%"], "types": {"Affects": ["Self"], "Ability": ["Passive"]}}}], "availability": [], "cost": "5900 (1100)", "details": {"Bonus": ["+25 Strength", "+20 Attack damage", "+5 Armor"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Lifesteal"], "Disassemble?": ["No"], "Active": ["Unholy Rage"], "builds_from": ["Reaver", "Helm of the Dominator", "Recipe"]}, "lore": "Immense power at the cost of your soul.", "type": "Artifacts", "additional_info": ["One Satanic grants a total of 500 health, 0.75 health regeneration, 5 armor and 20 (45 to strength heroes) attack damage."]}, "Mask of Madness": {"abilities": [{"Berserk": {"special_details": [], "modifiers": {"Item Mask Of Madness Berserk: Dispellable with any dispel.": "green"}, "description": "Gives 100 attack speed and 17% movement speed, but causes you to take extra 25% damage. Lasts 12 seconds.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Does not interrupt the owner's channeling spells upon cast.", "Amplifies all 3 damage types after all reductions, including self-inflicted damage and damage dealt by allies.", "Amplified damage is the same type as the damage dealt.", "Reduces effective HP down to 80%."], "Cooldown": "", "data": ["Attack Speed Bonus: 100", "Move Speed Bonus: 17%", "Incoming Damage Amplification: 25%", "Duration: 12"], "types": {"Affects": ["Self"], "Ability": ["No Target"]}}}, {"Lifesteal": {"special_details": ["ILLUSIONS_CANNOT_USE Lifesteal particles are visible on illusions, but they do not gain health from their attacks.", "UNIQUE_ATTACK_MODIFIER Can be combined with Eye of Skadi's Unique Attack Modifier."], "modifiers": {}, "description": "Heals the attacker for a percentage of attack damage dealt.", "Mana": "", "ability_special": ["UNIQUE_ATTACK_MODIFIER", "ILLUSIONS_CANNOT_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["The lifesteal stacks additively with other sources of lifesteal which are not Unique Attack Modifiers.", "Cannot lifesteal off of wards, buildings and allied units. Can lifesteal off of siege creeps."], "Cooldown": "", "data": ["Lifesteal: 20%"], "types": {"Affects": ["Self"], "Ability": ["Passive"]}}}], "availability": [], "cost": "1800 (900)", "details": {"Alert allies?": ["No"], "builds_into": [], "Passive": ["Lifesteal"], "Disassemble?": ["No"], "Active": ["Berserk"], "builds_from": ["Morbid Mask", "Recipe"]}, "lore": "Once this mask is worn, its bearer becomes an uncontrollable aggressive force.", "type": "Artifacts", "additional_info": ["Mask of Madness is the most cost-effective Attack Speed item in the game, costing only 18 gold per point of Attack speed.", "Works well with Bash effects. The movement speed allows you to chase and the bash prevents your prey from hitting you back effectively.", "Some heroes with very high right-click damage output such as Sven and Tiny can easily offset the damage amplification with the lifesteal.", "The active is extremely useful while farming. Taking 25% more damage is negligible when simply running between lanes or hitting lane or jungle creeps.", "The user should always be wary of heroes with high burst such as Nyx Assassin or Lina that can really capitalize from the damage amplification, especially if the enemy has vision while the item is active.", "One of the best ways to counter a Mask of Madness users in a fight is to focus them down with nukes and disables while they are taking more damage. \n It is possible to work around this vulnerability by buying Black King Bar to avoid being nuked or disabled by spells, items, etc.", "It is possible to work around this vulnerability by buying Black King Bar to avoid being nuked or disabled by spells, items, etc."]}, "Band of Elvenskin": {"abilities": [], "availability": ["SIDE_SHOP"], "cost": "450 ", "details": {"Bonus": ["+6 Agility"], "builds_from": [], "builds_into": ["Power Treads", "Yasha", "Dragon Lance"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "A tensile fabric often used for its light weight and ease of movement.", "type": "Attributes", "additional_info": ["One Band of Elvenskin grants a total of 0.86 armor and 6 attack speed (and 6 attack damage to agility heroes)."]}, "Diffusal Blade": {"abilities": [{"Purge": {"special_details": ["NO_PIERCE_SPELL_IMMUNE Cannot target spell immune units. However, can always target units under the effect of  Repel​, regardless of them being spell immune. The slow is always blocked by spell immunity, so if the Repel is not dispellable (an allied Repel cast on the enemy), or when the target has a second source of spell immunity, it only gets dispelled, but not slowed.", "BLOCKED_BY_LINKEN Still loses a charge when blocked."], "modifiers": {"Item Diffusal Blade Slow: Dispellable with any dispel.": "red", "Rooted: Dispellable with any dispel.": "red"}, "description": "If cast on an enemy, removes buffs from the target and slows it for 4 seconds. If cast on an ally, Purge removes most debuffs.", "Mana": "", "ability_special": ["BLOCKED_BY_LINKEN", "NO_PIERCE_SPELL_IMMUNE"], "notes": ["Double clicking the item casts it on self.", "Applies a basic dispel on the target upon cast.", "The dispel is applied first, followed by the slow.", "Does not slow allied targets.", "Can be cast on invulnerable units.", "The slow decreases in 0.8 second intervals, so it slows for 100%/80%/60%/40%/20%, going one step down every 0.8 seconds.", "When cast on non-hero units, it roots the target for the initial 3 seconds, fully preventing it from moving.", ["The slow still applies to them. So after the ensnare, they are slowed for the remaining second like heroes.", "However, their channeling spells are not interrupted."], "Treats Roshan, ancient creeps and creep-heroes as heroes."], "Cooldown": "", "data": ["Cast Range: 600", "Move Speed Slow: 100%", "Non-Hero Stop Duration: 3", "Slow Duration: 4"], "types": {"Affects": ["Enemies"], "Ability": ["Target Unit"]}}}, {"Manabreak": {"special_details": ["ILLUSIONS_PARTIAL_USE Mana burned and damage dealt is reduced for illusions.", "NOT_UNIQUE_ATTACK_MODIFIER Does not stack with other Mana Break abilities."], "modifiers": {}, "description": "Each attack burns 40 mana from the target, and deals the same amount in physical damage. Burns 20 mana per attack from melee illusions and 10 mana per attack from ranged illusions. Does not stack with other manabreak abilities.", "Mana": "", "ability_special": ["NOT_UNIQUE_ATTACK_MODIFIER", "ILLUSIONS_PARTIAL_USE", "NO_PIERCE_SPELL_IMMUNE"], "notes": ["The damage is directly added to the owner's attack damage.", "The owner can lifesteal off the damage dealt by Manabreak. However, it cannot crit or cleave.", "The damage can be reduced with e.g.  Enfeeble or  Static Link.", ["However, it cannot be amplified with e.g.  Empower or the  Double Damage Rune."], "Does not work against allied units when attacking them.", "Applies the mana loss first, and then the damage."], "Cooldown": "", "data": ["Mana Burned per Hit (Hero): 40", "Mana Burned per Hit (Melee Illusion): 20", "Mana Burned per Hit (Ranged Illusion): 10", "Burned Mana as Damage: 100%"], "types": {"Affects": ["Enemies"], "Ability": ["Passive"], "Damage": ["Physical"]}}}], "availability": [], "cost": "3150 (700)", "details": {"Charges": ["8"], "Alert allies?": ["No"], "builds_into": ["Diffusal Blade"], "Passive": ["Manabreak"], "Bonus": ["+25/35 Agility", "+10/15 Intelligence"], "Disassemble?": ["No"], "Active": ["Purge"], "builds_from": ["Blade of Alacrity", "Blade of Alacrity", "Robe of the Magi", "Recipe"]}, "lore": "An enchanted blade that allows the user to cut straight into the enemy's soul.", "type": "Artifacts", "additional_info": ["The item does not disappear upon using up all charges.", "Upgrading the item improves its stats and refreshes the charge counter back to 8. Can be upgraded only once.", "The total gold cost for each level is 3150/3850.", "One Diffusal Blade grants the following on each level:\n Level 1: 3.57 armor, 25 attack speed, 120 mana, 0.4 mana regeneration and 0.625% spell damage (and 25 attack damage to agility heroes, or 10 attack damage to intelligence heroes).\n Level 2: 5 armor, 35 attack speed, 180 mana, 0.6 mana regeneration and 0.9375% spell damage (and 35 attack damage to agility heroes, or 15 attack damage to intelligence heroes).", "Level 1: 3.57 armor, 25 attack speed, 120 mana, 0.4 mana regeneration and 0.625% spell damage (and 25 attack damage to agility heroes, or 10 attack damage to intelligence heroes).", "Level 2: 5 armor, 35 attack speed, 180 mana, 0.6 mana regeneration and 0.9375% spell damage (and 35 attack damage to agility heroes, or 15 attack damage to intelligence heroes)."]}, "Lotus Orb": {"abilities": [{"Echo Shell": {"special_details": [], "modifiers": {"Item Lotus Orb Active: Undispellable.": "green"}, "description": "Applies a shield to the target unit which re-casts most targeted spells back to their caster. The shielded unit will still take damage from the spell. Dispels negative buffs when applied.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Double clicking the item automatically targets self. Multiple casts on the same target do not stack, but refresh the duration.", "Can be cast on creep-heroes, however, it does not reflect any spell on them.", "Applies a basic dispel on the target upon cast.", "When a spell is blocked by  Linken's Sphere, it still gets reflected.", "Does not reflect spells cast by allies.", "Does not reflect  Spell Steal,  Repel,  Ion Shell,  Urn of Shadows,  Medallion of Courage and  Solar Crest.", "Does not reflect spells reflected by another Echo Shell.", "For a list of reflected spells, see here."], "Cooldown": "", "data": ["Cast Range: 900", "Duration: 6"], "types": {"Affects": ["Allied Heroes"], "Ability": ["Target Unit"]}}}], "availability": [], "cost": "4000 ", "details": {"Bonus": ["+250 Mana", "+6 Health regeneration", "+125% Mana regeneration", "+10 Attack damage", "+10 Armor"], "Alert allies?": ["No"], "builds_into": [], "Disassemble?": ["Yes"], "Active": ["Echo Shell"], "builds_from": ["Perseverance", "Platemail", "Energy Booster"]}, "lore": "The jewel at its center still reflects a pale image of its creator.", "type": "Armor", "additional_info": ["Reflected spells are treated as if the reflecting unit owns the spell and casts it back on the reflect target. This means that all effects of spells which hit the caster affect the reflecting unit, too.", "If the reflecting hero has Aghanim's Scepter, the reflected spell is upgraded, whether the triggering hero has a scepter or not. If the reflecting hero does not have an Aghanim's Scepter, the reflected spell is not upgraded, even if the triggering hero has one.", "Reflected spells ignore the original spell's cast range and trigger on any distance.", "Reflected spells take effect before the triggering spell hits. In some cases, like when the spell is lethal to both, this may lead to the triggering unit to die before the reflecting unit.", "Channeling spells are reflected (only if the target already has the Echo Shell buff on upon cast of a channeling spell and not the other way around), causing the reflecting hero to channel the spell as if they cast it themselves. When reflecting a channeling spell while already executing another order, that order does not get canceled. This may result in the reflected spell to get instantly canceled."]}, "Wind Lace": {"abilities": [], "availability": [], "cost": "235 ", "details": {"Bonus": ["+20 Movement Speed"], "builds_from": [], "builds_into": ["Eul's Scepter of Divinity", "Drum of Endurance"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "Hasten to battle on wind-touched heels.", "type": "Arcane", "additional_info": ["Movement speed bonuses from multiple Wind Laces do not stack.", "Stacks with all other movement speed bonuses."]}, "Blade of Alacrity": {"abilities": [], "availability": [], "cost": "1000 ", "details": {"Bonus": ["+10 Agility"], "builds_from": [], "builds_into": ["Aghanim's Scepter", "Diffusal Blade", "Yasha"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "A long blade imbued with time magic.", "type": "Attributes", "additional_info": ["One Blade of Alacrity grants a total of 1.43 armor and 10 attack speed (and 10 attack damage to agility heroes)."]}, "Staff of Wizardry": {"abilities": [], "availability": [], "cost": "1000 ", "details": {"Bonus": ["+10 Intelligence"], "builds_from": [], "builds_into": ["Aghanim's Scepter", "Dagon", "Eul's Scepter of Divinity", "Force Staff", "Necronomicon", "Rod of Atos"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "A staff of magical powers passed down from the eldest mages.", "type": "Attributes", "additional_info": ["One Staff of Wizardry grants a total of 120 mana, 0.4 mana regeneration and 0.625% spell damage (and 10 attack damage to intelligence heroes)."]}, "Eaglesong": {"abilities": [], "availability": ["SECRET_SHOP"], "cost": "3200 ", "details": {"Bonus": ["+25 Agility"], "builds_from": [], "builds_into": ["Ethereal Blade", "Butterfly"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "Capturing the majestic call of an eagle, this mystical horn brings limitless dexterity to those who hear it.", "type": "Secret Shop", "additional_info": ["One Eaglesong grants a total of 3.57 armor and 25 attack speed (and 25 attack damage to agility heroes)."]}, "Divine Rapier": {"abilities": [], "availability": ["SECRET_SHOP"], "cost": "6200 ", "details": {"Bonus": ["+330 Attack damage"], "builds_from": ["Sacred Relic", "Demon Edge"], "builds_into": [], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "So powerful, it cannot have a single owner.", "type": "Weapons", "additional_info": ["This item drops when its wielder dies, unless it has Reincarnation.", "Divine Rapier cannot be destroyed or sold.", "Couriers can be used to buy a Divine Rapier, but they cannot pick rapiers up from the ground.", "Divine Rapier has two states:\n Original Rapier: initial state upon buying the item\n Free Rapier: state after being picked up by an enemy once", "Original Rapier: initial state upon buying the item", "Free Rapier: state after being picked up by an enemy once"]}, "Crystalys": {"abilities": [{"Critical Strike": {"special_details": ["ILLUSIONS_CAN_USE Red critical numbers are before illusion and armor reduction."], "modifiers": {}, "description": "Grants each attack a chance to deal additional damage. Critical Strike does not work against buildings.", "Mana": "", "ability_special": ["NOT_UNIQUE_ATTACK_MODIFIER", "ILLUSIONS_CAN_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Increases attack damage by an average of 15%.", "The proc chances of multiple crit sources stack.", ["If two sources of critical strike proc at the same time, the higher multiplier has priority."], "Critical Strike uses pseudo-random distribution.", "Does not work against wards, buildings, and allied units."], "Cooldown": "", "data": ["Proc Chance: 20%", "Critical Damage: 175%"], "types": {"Affects": ["Enemies"], "Ability": ["Passive"]}}}], "availability": [], "cost": "2120 (500)", "details": {"Bonus": ["+30 Attack damage"], "Alert allies?": ["No"], "builds_into": ["Daedalus", "Bloodthorn"], "Passive": ["Critical Strike"], "Disassemble?": ["No"], "builds_from": ["Broadsword", "Blades of Attack", "Recipe"]}, "lore": "A blade forged from rare crystals, it seeks weak points in enemy armor.", "type": "Weapons", "additional_info": ["Before 5.40, Crystalys was named \"Crystal Battlegear\" and before 5.31, it was named \"Crystal Defender\"."]}, "Wraith Band": {"abilities": [], "availability": [], "cost": "485 (170)", "details": {"Bonus": ["+3 Strength", "+6 Agility", "+3 Intelligence", "+3 Attack damage"], "builds_from": ["Circlet", "Slippers of Agility", "Recipe"], "builds_into": ["Ring of Aquila"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "A circlet with faint whispers echoing about it.", "type": "Common", "additional_info": ["One Wraith Band grants a total of 60 health, 0.09 health regeneration, 0.86 armor, 6 attack speed, 36 mana, 0.12 mana regeneration, 0.1875% spell damage and 6 (9 to agility heroes) attack damage."]}, "Buckler": {"abilities": [{"Armor Bonus": {"special_details": [], "modifiers": {"Item Buckler Effect: Dispellable with any dispel.": "green"}, "description": "Gives +2 armor to all allied units in a 900 radius. Lasts 25 seconds on heroes, 30 seconds on units.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Interrupts the user's channeling spells upon cast.", "Guard bonus armor does not stack with the armor gained from  Mekansm and  Crimson Guard active abilities.", "Does not affect wards, buildings and invulnerable units."], "Cooldown": "", "data": ["Radius: 900", "Armor Bonus: 2", "Hero Duration: 25", "Non-Hero Duration: 30"], "types": {"Affects": ["Allies"], "Ability": ["No Target"]}}}], "availability": [], "cost": "800 (200)", "details": {"Bonus": ["+2 Strength", "+2 Agility", "+2 Intelligence", "+5 Armor"], "Alert allies?": ["No"], "builds_into": ["Mekansm", "Crimson Guard"], "Disassemble?": ["No"], "Active": ["Armor Bonus"], "builds_from": ["Chainmail", "Iron Branch", "Recipe"]}, "lore": "A powerful shield that imbues the bearer with the strength of heroes past, it is capable of protecting entire armies in battle.", "type": "Support", "additional_info": ["One Buckler grants a total of 40 health, 0.06 health regeneration, 5.29 armor, 2 attack speed, 24 mana, 0.08 mana regeneration, 0.125% spell damage and 2 attack damage."]}, "Vanguard": {"abilities": [{"Damage Block": {"special_details": [], "modifiers": {}, "description": "Makes the wielder block damage from each incoming attack based on whether the equipped hero is melee or ranged.", "Mana": "", "ability_special": ["ILLUSIONS_CAN_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Does not work against wards ( Plague Ward,  Mass Serpent Ward,  Death Ward).", "Does not reduce physical damage from spells, except from  Moon Glaive and  The Swarm.", "Damage Block uses pseudo-random distribution.", "For more details, see Damage Block."], "Cooldown": "", "data": ["Proc Chance: 100%", "Blocked Damage (Melee): 32", "Blocked Damage (Ranged): 16"], "types": {"Affects": ["Self"], "Ability": ["Passive"]}}}], "availability": ["SIDE_SHOP"], "cost": "2150 ", "details": {"Bonus": ["+250 Health", "+8 Health regeneration"], "Alert allies?": ["No"], "builds_into": ["Crimson Guard", "Abyssal Blade"], "Passive": ["Damage Block"], "Disassemble?": ["No"], "builds_from": ["Ring of Health", "Vitality Booster", "Stout Shield"]}, "lore": "A powerful shield that defends its wielder from even the most vicious of attacks.", "type": "Armor", "additional_info": ["The damage block can completely negate the damage from heroes with enough armor or other means of damage reduction. They can block Phantom Lancer's illusions efficiently in the late game (they do the lowest amount of damage).\n This is especially useful with/against heroes with damage reduction, for example: Windranger's Focus Fire, Bristleback's passive, Spectre's Dispersion.", "This is especially useful with/against heroes with damage reduction, for example: Windranger's Focus Fire, Bristleback's passive, Spectre's Dispersion."]}, "Shadow Blade": {"abilities": [{"Shadow Walk": {"special_details": [], "modifiers": {"Item Invisibility Edge Windwalk: Undispellable.": "green"}, "description": "Makes you invisible until the duration ends, or until you attack or cast a spell. While Shadow Walk is active, you move 20% faster and can move through units. If attacking to end the invisibility, you gain 175 bonus damage on that attack. Lasts 14 seconds.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Does not interrupt the owner's channeling spells upon cast.", "The bonus damage is directly added to the attack damage, so it can be reduced with e.g.  Enfeeble or  Static Link.", ["However, it cannot be amplified with e.g.  Empower or the  Double Damage Rune.", "The damage is considered by lifesteal, cleave, Splash ( Elder Dragon Form) and  Psi Blades, but not by crits."], "During the fade time, the user can cast spells, use items and perform attacks without breaking the invisibility.", ["Those attacks do apply the 175 damage to the target."], "The bonus damage is not applied when attacking wards and buildings out of the invisibility.", "The invisibility is lost upon reaching the cast point of spells, or upon finishing an attack (for ranged heroes upon projectile launch).", ["This means when the attack misses, the invisibility is still lost."], "Allows the user to pass through other units, including wards, but not through buildings.", "The user can pick up and drop items without breaking the invisibility.", "Shares cooldown with  Silver Edge."], "Cooldown": "", "data": ["Fade Time: 0.3", "Damage: 175", "Duration: 14"], "types": {"Affects": ["Self / Enemies"], "Ability": ["No Target"], "Damage": ["Physical"]}}}], "availability": [], "cost": "2700 ", "details": {"Bonus": ["+22 Attack damage", "+30 Attack speed"], "Alert allies?": ["No"], "builds_into": ["Silver Edge"], "Disassemble?": ["No"], "Active": ["Shadow Walk"], "builds_from": ["Claymore", "Shadow Amulet"]}, "lore": "The blade of a fallen king, it allows you to move unseen and strike from the shadows.", "type": "Weapons", "additional_info": ["Shadow Blade is useful as both an engagement tool and as an escape option for Furion. It allows him to have physical burst and is usable during Teleportation, allowing you to escape safely as long as the enemy has no True Sight or AoE disables."]}, "Medallion of Courage": {"abilities": [{"Valor": {"special_details": ["PARTIAL_PIERCE_SPELL_IMMUNE Can be cast on spell immune allies.Cannot be cast on spell immune enemies."], "modifiers": {"Item Medallion Of Courage Armor Addition: Dispellable with any dispel.": "green", "Item Medallion Of Courage Armor Reduction: Dispellable with any dispel.": "green"}, "description": "If cast on an ally, increases their armor while reducing the caster's. If cast on an enemy, reduces the armor of both the enemy and the caster. Cannot target magic immune enemies. Armor reduction is halved against Roshan.", "Mana": "", "ability_special": ["NOT_BLOCKED_BY_LINKEN", "PARTIAL_PIERCE_SPELL_IMMUNE"], "notes": ["Cannot be cast on self.", "Shares cooldown with  Solar Crest.", "The debuff on self and the buff on allies/debuff on enemies are independent from each other. Dispelling one does not dispel the other.", "A unit can be affected by the buff and the debuff at the same time, but not by multiple buffs or debuffs from it.", ["This means when two opposing heroes cast it on each other, the debuffs refresh each other.", "When two allied heroes cast it on each other, both receive the buff and the debuff which are independent from each other.", "However, the buff and the debuff fully stack with those applied by Solar Crest."], "Can be cast on any unit, except on wards and buildings.", "When cast on Roshan, the user still loses 7 armor, not 3.5."], "Cooldown": "", "data": ["Cast Range: 1000", "Self Armor Reduction: 7", "Enemy Armor Reduction: 7", "Roshan Armor Reduction: 3.5", "Ally Armor Bonus: 7", "Duration: 7"], "types": {"Affects": ["Enemies / Allies"], "Ability": ["Target Unit"]}}}], "availability": ["SIDE_SHOP"], "cost": "1175 ", "details": {"Bonus": ["+50% Mana regeneration", "+7 Armor"], "Alert allies?": ["No"], "builds_into": ["Solar Crest"], "Disassemble?": ["No"], "Active": ["Valor"], "builds_from": ["Chainmail", "Sage's Mask", "Blight Stone"]}, "lore": "The bearer has no fear of combat.", "type": "Support", "additional_info": ["Medallion of Courage does not inherit the passive armor reduction from Blight Stone."]}, "Hurricane Pike": {"abilities": [{"Hurricane Thrust": {"special_details": ["PARTIAL_PIERCE_SPELL_IMMUNE Can be cast on self while spell immune.Cannot be cast on other spell immune units."], "modifiers": {"Item Hurricane Pike Active Alternate: Undispellable.": "green", "Item Hurricane Pike Active: Undispellable.": "green", "Item Hurricane Pike Range: Dispellable with any dispel.": "green"}, "description": "When used on an enemy, it pushes you both away from each other 450 units each, and allows you to attack the target without range restrictions for 4 attacks for a maximum of 5 seconds. Grants 100 Attack Speed during the attacks. Works like Force Staff when used on self or allies.", "Mana": "", "ability_special": ["BLOCKED_BY_LINKEN", "PARTIAL_PIERCE_SPELL_IMMUNE"], "notes": ["Double clicking the item casts it on self.", "Pushes at a speed of 1500, if the target is self or an ally. Pushes the caster and target at a speed of 2250, if the target is an enemy.", "Targeting allies pushes them based on their facing direction. Targeting enemies pushes them based on the caster's facing direction.", ["The caster is pushed into the opposite direction, adding a 900 range distance between the caster and targeted enemy.", "The caster is only pushed when the target was an enemy, not an ally."], "The unlimited attack range only works against the targeted enemy. Attacking other units still uses the regular attack range.", "Same goes for the attack speed. When switching targets uses regular attack speed. Updates the speed upon reaching attack point.", "Gives the caster an attack order on the target if the target is an enemy. This effect works exclusively for ranged heroes.", "The push does not disable, so the caster and the targeted unit can still cast spells or items, attack and turn during the push.", ["This also means that it does not cancel channeling spells of the target."], "Does not push units affected by a  Chronosphere,  Black Hole,  Duel, or  Kinetic Field.", ["If the target is an enemy, not even the push on the caster or the unlimited attack range are applied."], "Cannot break  Pounce leash. When pushing a leashed hero, it does not get pushed beyond the leash's max range.", "Can target any unit, except for wards and buildings. It can also push a  Homing Missile.", "Can force units over impassable terrain. Trees within 100 radius around the pushed units get destroyed during the push.", "Can be cast on Roshan but without any effect, since Roshan is immune to forced movement (still applies its effects on the caster).", "Casting on self or allies uses the default Force Staff sound.", "Shares cooldown with  Force Staff."], "Cooldown": "", "data": ["Cast Range (Ally): 800", "Cast Range (Enemy): 400", "Push Distance (Ally): 600", "Push Distance (Enemy): 450", "Push Duration (Ally): 0.4", "Push Duration (Enemy): 0.2", "Number of Unlimited Range Attacks: 4", "Attack Speed Bonus Against Target: 100", "Unlimited Range Duration: 5"], "types": {"Affects": ["Enemies / Allies"], "Ability": ["Target Unit"]}}}, {"Attack Range Bonus": {"special_details": [], "modifiers": {}, "description": "Increases attack range of ranged heroes by 140.", "Mana": "", "ability_special": ["NOT_UNIQUE_ATTACK_MODIFIER", "ILLUSIONS_CAN_USE"], "notes": ["Attack range bonuses from multiple Hurricane Pikes or Dragon Lances do not stack.", "Stacks with any other source of attack range bonus.", "Affects the cast range of active attack modifiers as well.", "Does not affect the range of secondary attacks like  Moon Glaive,  Split Shot,  Flak Cannon or  Marksmanship.", "Affects the cast range of  Focus Fire as well, so it matches the total attack range."], "Cooldown": "", "data": ["Attack Range Bonus: 140"], "types": {"Affects": ["Self"], "Ability": ["Passive"]}}}], "availability": [], "cost": "4375 (250)", "details": {"Bonus": ["+15 Strength", "+20 Agility", "+10 Intelligence", "+4 Health regeneration"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Attack Range Bonus"], "Disassemble?": ["No"], "Active": ["Hurricane Thrust"], "builds_from": ["Force Staff", "Dragon Lance", "Recipe"]}, "lore": "A legendary pike once held as royal sigil of the ancient wyvern riders.", "type": "Armor", "additional_info": ["One Hurricane Pike grants a total of 300 health, 4.45 health regeneration, 2.86 armor, 20 attack speed, 120 mana, 0.4 mana regeneration, 0.625% spell damage and 15 attack damage to strength heroes, 20 attack damage to agility heroes, or 10 attack damage to intelligence heroes."]}, "Town Portal Scroll": {"abilities": [{"Teleport": {"special_details": [], "modifiers": {"Teleporting: Undispellable.": "green"}, "description": "Teleports you to a target friendly building. Double-click to teleport to your team's base fountain.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Double clicking the item while being at least 1500 range away from the team's fountain, automatically targets the fountain.", "If multiple heroes teleport to the same location within the check duration, the channeling time increases for each successive hero.", ["The first channel takes 3 seconds, the second 5 seconds, and all following channels take 0.5 seconds longer than the previous one.", "Only teleports within 1150 radius of towers are counted. Teleports outside of tower range do not increase the channel time.", "Only teleports from other Town Portal Scrolls are counted. Other sources of teleport (e.g. Boots of Travel) are ignored."], "When targeting far away from buildings, it teleports to the closest building, 575 range away from it.", "During the channeling, the teleport destination is marked with a visual effect in the same color as the player and a sound is played.", "Both are visible and audible to everyone. The visual effect is also visible on teleporting invisible enemies.", "Also marks the point on the mini-map for allies. The mark is in the player's color and lasts as long as the channeling does.", "Provides 200 range flying vision at the destination point while channeling. The vision lingers for 1 second.", "The teleport is not cancelled when the target building is destroyed during the channeling.", "Upon teleport, trees within 200 radius are destroyed.", "Shares cooldown with  Boots of Travel."], "Cooldown": "", "data": ["Cast Range: Global", "Min Targeting Distance to Building: 70", "Max Targeting Distance to Building: 575", "First Channel Time: 3", "Second Channel Time: 5", "Following Channel Time Increase: 0.5", "Recent Teleport Check Radius: 1150", "Recent Teleport Check Duration: 25"], "types": {"Affects": ["Self"], "Ability": ["Target Point  /  Channeled"]}}}], "availability": ["SIDE_SHOP"], "cost": "50 ", "details": {"Charges": ["1"], "Alert allies?": ["No"], "builds_into": [], "Disassemble?": ["No"], "Active": ["Teleport"], "builds_from": []}, "lore": "What a hero truly needs.", "type": "Consumables", "additional_info": ["Stacks with itself in the inventory.", "Town Portal Scroll is completely shareable."]}, "Veil of Discord": {"abilities": [{"Magic Weakness": {"special_details": [], "modifiers": {"Item Veil Of Discord Debuff: Dispellable with any dispel.": "red"}, "description": "Emits a weakening blast that increases the magic damage enemies take. Lasts 16 seconds.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Places a debuff on enemy units in the area upon cast. Leaving or entering the area afterwards has no effect.", "Multiple casts on the same targets do not stack, but refresh the duration instead.", "Affects invisible units and units in the Fog of War, but not hidden or invulnerable units.", "Reduces most heroes' magic resistance down to 6.25%, if they do not have any other source of magic resistance.", "Reduces  Meepo's magic resistance down to 18.75% and  Visage's magic resistance down to -12.5%, if they do not have any other source of magic resistance."], "Cooldown": "", "data": ["Cast Range: 1000", "Radius: 600", "Magic Resistance Reduction: 25%", "Duration: 16"], "types": {"Affects": ["Enemies"], "Ability": ["Target Area"]}}}], "availability": [], "cost": "2240 (400)", "details": {"Bonus": ["+6 Strength", "+6 Agility", "+12 Intelligence", "+6 Health regeneration", "+6 Attack damage", "+6 Armor"], "Alert allies?": ["No"], "builds_into": [], "Disassemble?": ["No"], "Active": ["Magic Weakness"], "builds_from": ["Helm of Iron Will", "Null Talisman", "Null Talisman", "Recipe"]}, "lore": "The headwear of corrupt magi.", "type": "Caster", "additional_info": ["One Veil of Discord grants a total of 120 health, 6.18 health regeneration, 6.86 armor, 6 attack speed, 144 mana, 0.48 mana regeneration, 0.75% spell damage and 12 (18 to intelligence heroes) attack damage."]}, "Observer Ward": {"abilities": [{"Place Observer Ward": {"special_details": [], "modifiers": {}, "description": "Plants an Observer Ward, an invisible watcher that gives vision of its surrounding area to your team. Lasts 6 minutes.\nHold Control to give one Observer Ward to an allied hero.", "Mana": "", "ability_special": [], "notes": ["Provides 1600 radius ground vision at its location.", "Cannot be placed inside the fountain area (including a small area in front of the ramp), or in Roshan's pit.", "Holding Control allows the owner to give an ally just one ward, instead of the whole stack.", "It is not possible to give couriers or  Lone Druid's Spirit Bear an Observer Ward by holding Control.", "Observer Wards can be targeted by enemy  Tangoes and  Quelling Blade (including its upgrades) to be instantly destroyed.", "Creep spawn ranges are shown before placing a ward, allowing camps to be blocked."], "Cooldown": "", "data": ["Cast Range: 500", "Vision Radius: 1600", "Duration: 360"], "types": {"Ability": ["Target Area"]}}}, {"Invisibility": {"special_details": [], "modifiers": {}, "description": "This unit is permanently invisible.", "Mana": "", "ability_special": [], "notes": ["The ability and modifier are not displayed in-game."], "Cooldown": "", "data": ["Fade Time: 0"], "types": {"Affects": ["Self"], "Ability": ["Passive"]}}}], "availability": [], "cost": "65 ", "details": {"Charges": ["1"], "Alert allies?": ["No"], "builds_into": ["Observer and Sentry Wards"], "Disassemble?": ["No"], "Active": ["Place Observer Ward"], "builds_from": []}, "lore": "A form of half-sentient plant, often cultivated by apprentice wizards.", "type": "Consumables", "additional_info": ["Observer Wards start with a stock count of 2 and are limited to a count of 4.\n It takes 150 seconds for 1 ward to replenish in the stock.", "It takes 150 seconds for 1 ward to replenish in the stock.", "Stacks with itself and with Sentry Wards in inventory.", "Observer Wards are completely shareable.", "Observer Wards do not provide True Sight."]}, "Morbid Mask": {"abilities": [{"Lifesteal": {"special_details": ["ILLUSIONS_CANNOT_USE Lifesteal particles are visible on illusions, but they do not gain health from their attacks.", "UNIQUE_ATTACK_MODIFIER Can be combined with Eye of Skadi's Unique Attack Modifier."], "modifiers": {}, "description": "Heals the attacker for a percentage of attack damage dealt.", "Mana": "", "ability_special": ["UNIQUE_ATTACK_MODIFIER", "ILLUSIONS_CANNOT_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["The lifesteal stacks additively with other sources of lifesteal which are not Unique Attack Modifiers.", "Cannot lifesteal off of wards, buildings and allied units."], "Cooldown": "", "data": ["Lifesteal: 15%"], "types": {"Affects": ["Self"], "Ability": ["Passive"]}}}], "availability": ["SIDE_SHOP"], "cost": "900 ", "details": {"Passive": ["Lifesteal"], "builds_from": [], "builds_into": ["Helm of the Dominator", "Mask of Madness", "Vladmir's Offering"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "A mask that drains the energy of those caught in its gaze.", "type": "Arcane", "additional_info": ["In the original DotA, this item was called a Mask of Death."]}, "Mekansm": {"abilities": [{"Restore": {"special_details": [], "modifiers": {"Item Mekansm Spell: Dispellable with any dispel.": "green", "Item Mekansm Noheal: Undispellable.": "green"}, "description": "Heals 250 health and gives +2 armor to allied units in a 900 radius.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Interrupts the user's channeling spells upon cast.", "Affects every allied unit, including illusions, invulnerable units and hidden units, excluding wards and buildings.", "Does not heal heroes that have been affected by Restore in the last 25 seconds, or by  Guardian Greaves' Mend in the last 38 seconds.", ["A status buff icon on affected units shows how much time is left for it to be able to get affected again."], "Restore armor bonus does not stack with the armor gained from  Buckler and  Crimson Guard active abilities."], "Cooldown": "", "data": ["Radius: 900", "Health Restored: 250", "Armor Bonus: 2", "Duration: 25", "Heal Stack Limit Duration: 25"], "types": {"Affects": ["Allies"], "Ability": ["No Target"]}}}, {"Mekansm Aura": {"special_details": ["ILLUSIONS_CANNOT_USE Illusions provide the aura, but do not benefit from it."], "modifiers": {"Item Mekansm Aura: Undispellable.": "green"}, "description": "Grants 4 health regeneration to allied units in a 900 radius.Multiple instances of Mekansm Aura do not stack.", "Mana": "", "ability_special": ["ILLUSIONS_CANNOT_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Stacks with all other sources of flat health regeneration, except with Mekansm Aura from multiple Mekansms.", "Regenerates up to 240 health in one minute.", "Does not affect wards, buildings and invulnerable units.", "The aura's buff lingers for 0.5 seconds."], "Cooldown": "", "data": ["Radius: 900", "Health Regeneration Bonus: 4"], "types": {"Affects": ["Allies"], "Ability": ["Aura"]}}}], "availability": [], "cost": "2275 (900)", "details": {"Bonus": ["+5 Strength", "+5 Agility", "+5 Intelligence", "+5 Armor"], "Alert allies?": ["Yes"], "builds_into": ["Guardian Greaves"], "Passive": ["Mekansm Aura"], "Disassemble?": ["No"], "Active": ["Restore"], "builds_from": ["Buckler", "Headdress", "Recipe"]}, "lore": "A glowing jewel formed out of assorted parts that somehow fit together perfectly.", "type": "Support", "additional_info": ["One Mekansm grants a total of 100 health, 4.15 health regeneration, 5.71 armor, 5 attack speed, 60 mana, 0.2 mana regeneration, 0.3125% spell damage and 5 attack damage."]}, "Magic Stick": {"abilities": [{"Energy Charge": {"special_details": [], "modifiers": {}, "description": "Instantly restores health and mana based on the number of charges stored. Gains a charge (max 10) whenever a nearby visible enemy uses an ability.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Interrupts the user's channeling spells upon cast.", "Gains 1 charge whenever a visible enemy unit, including neutral creeps, uses an ability within the radius.", "Does not gain charges from toggle abilities, active attack modifiers and the abilities listed here.", "Passively triggered spells (e.g.  Quill Spray,  Borrowed Time,  Multicast,  Reincarnation) do not add charges.", "When an enemy casts a spell out of the invisibility from the  Invisibility Rune,  Shadow Walk,  Sand Storm,  Moonlight Shadow,  Nature's Guise or  Spin Web, it does not give a charge.", "Can restore up to 150 health and mana when having the maximum amount of charges.", "Shares cooldown with  Magic Wand.", "When having multiple Magic Sticks or Magic Wands in the inventory, the oldest one gains charges first. If it is full, the second oldest one starts to gain charges.", "Upon upgrading a Magic Stick into a Magic Wand, all its current charges are carried over."], "Cooldown": "", "data": ["Radius: 1200", "Charges per Cast Spell: 1", "Max Charges: 10", "Health and Mana Restored per Charge: 15"], "types": {"Affects": ["Self"], "Ability": ["No Target"]}}}], "availability": ["SIDE_SHOP"], "cost": "200 ", "details": {"Active": ["Energy Charge"], "builds_from": [], "builds_into": ["Magic Wand"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "A simple wand used to channel magic energies, it is favored by apprentice wizards and great warlocks alike.", "type": "Arcane", "additional_info": ["Magic Sticks allows the user to get a quick burst of healing, or to use one last ability in a fight. Even during the midgame, when the boost is less noticeable, a Magic Stick can still save lives or ensure kills.", "The Magic Stick makes an excellent item against heroes that spam abilities while in the lane, as the charges can help to mitigate taken damage, or to cast more of own abilities. It is very versatile, and most of the time a good item to have."]}, "Radiance": {"abilities": [{"Burn": {"special_details": ["NO_PIERCE_SPELL_IMMUNE Blinds and attempts to damage if debuff was placed before spell immunity."], "modifiers": {"Item Radiance Debuff: Undispellable.": "red"}, "description": "When active, scorches nearby enemies for 50 damage per second and blinds them, causing them to miss 17% of their attacks.", "Mana": "", "ability_special": ["ILLUSIONS_CAN_USE", "NO_PIERCE_SPELL_IMMUNE"], "notes": ["Does not interrupt the owner's channeling spells upon toggling.", "The burn damage and blind effect are provided by an aura, its debuff lingers for 0.5 seconds.", ["This means after leaving the radius, enemies can still be damaged by up to one tick."], "Deals damage in 1 second intervals, starting 1 second after the debuff is placed.", "The burn damage and blind effect of multiple Radiance do not stack. Only the first applied debuff applies the effects.", "Does not affect buildings, ancient creeps and Roshan."], "Cooldown": "", "data": ["Radius: 700", "Damage per Second: 50", "Miss Chance: 17%"], "types": {"Affects": ["Enemies"], "Ability": ["Toggle  /  Aura"], "Damage": ["Magical"]}}}], "availability": [], "cost": "5150 (1350)", "details": {"Bonus": ["+65 Attack damage"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Burn"], "Disassemble?": ["No"], "builds_from": ["Sacred Relic", "Recipe"]}, "lore": "A divine weapon that causes damage and a bright burning effect that lays waste to nearby enemies.", "type": "Weapons", "additional_info": ["Special case: Radiance is a core item on Lone Druid's Spirit Bear."]}, "Poor Man's Shield": {"abilities": [{"Damage Block": {"special_details": [], "modifiers": {}, "description": "Blocks physical attack damage based on whether the equipped hero is ranged or melee. Poor Man's Shield will always block attacks from enemy Heroes, but has a 53% chance to block damage from creeps.", "Mana": "", "ability_special": ["ILLUSIONS_CAN_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["Does not work against wards ( Plague Ward,  Mass Serpent Ward,  Death Ward).", "Does not reduce physical damage from spells, except from  Moon Glaive and  The Swarm.", "Damage Block uses pseudo-random distribution.", "For more details, see Damage Block.", "Treats illusions as heroes and creep-heroes as creeps."], "Cooldown": "", "data": ["Hero Proc Chance: 100%", "Non-Hero Proc Chance: 53%", "Blocked Damage (Melee): 20", "Blocked Damage (Ranged): 10"], "types": {"Affects": ["Self"], "Ability": ["Passive"]}}}], "availability": ["SIDE_SHOP"], "cost": "500 ", "details": {"Bonus": ["+6 Agility"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Damage Block"], "Disassemble?": ["No"], "builds_from": ["Stout Shield", "Slippers of Agility", "Slippers of Agility"]}, "lore": "A busted old shield that seems to block more than it should.", "type": "Common", "additional_info": ["One Poor Man's Shield grants a total of 0.86 armor and 6 attack speed (and 6 attack damage to agility heroes)."]}, "Necronomicon": {"abilities": [{"Demonic Summoning": {"special_details": [], "modifiers": {}, "description": "Summons a Warrior and an Archer to fight for you for 40 seconds, whose strength and abilities increase as Necronomicon is upgraded. Warrior gains True Sight at level 3.", "Mana": "", "ability_special": [], "notes": ["Interrupts the user's channeling spells upon cast.", "The summons always spawn in front of the caster.", "All 3 levels of Necronomicon share cooldown.", "Recasting this with the same Necronomicon replaces the summons from the previous cast, no matter under whose control they are.", ["However, recasting it with a second Necronomicon (or the same with a different level) creates two new summons."], "The summons cannot be targeted by  Helm of the Dominator and  Hand of Midas.", ["However, they can be targeted by other converting or instantly killing spells like  Death Pact,  Holy Persuasion or  Devour."]], "Cooldown": "", "data": ["Duration: 40"], "types": {"Ability": ["No Target"], "Damage": ["Physical"]}}}, {"Mana Break": {"special_details": [], "modifiers": {}, "description": "Mana burned per hit, a portion of which is dealt as damage.", "Mana": "", "ability_special": ["NOT_UNIQUE_ATTACK_MODIFIER", "NOT_DISABLED_BY_BREAK", "NO_PIERCE_SPELL_IMMUNE"], "notes": ["The damage is directly added to the warrior's attack damage.", "Deals up to 15/30/45 damage per hit (before reductions).", "The damage is directly added to the warrior's attack damage, so it can lifesteal off of it. However, it still cannot crit or cleave.", "The damage can be reduced with e.g.  Enfeeble, but it cannot be amplified with e.g.  Empower.", "Applies the mana loss first, and then the damage."], "Cooldown": "", "data": ["Mana Burned per Hit: 25/50/75", "Burned Mana as Damage: 60%"], "types": {"Affects": ["Enemies"], "Ability": ["Passive"], "Damage": ["Physical"]}}}, {"Last Will": {"special_details": [], "modifiers": {}, "description": "Deals damage to the unit that kills the Necronomicon Warrior.", "Mana": "", "ability_special": ["NOT_DISABLED_BY_BREAK", "NO_PIERCE_SPELL_IMMUNE"], "notes": ["Does not affect allied units, so it can be denied without taking damage.", "The distance between the Necronomicon Warrrior and the killing unit does not matter.", "Does not affect wards and buildings."], "Cooldown": "", "data": ["Damage: 550/675/800"], "types": {"Affects": ["Enemies"], "Ability": ["Passive"], "Damage": ["Magical"]}}}, {"True Sight": {"special_details": [], "modifiers": {"Truesight: Undispellable.": "red"}, "description": "Reveals invisible units.", "Mana": "", "ability_special": ["NOT_DISABLED_BY_BREAK", "PIERCE_SPELL_IMMUNE"], "notes": ["Available for level 3 Necronomicon Warriors only.", "The True Sight is provided within the whole area, regardless of the warrior's actual vision. It is fully unobstructed.", "The True Sight is provided by an aura which affects enemies. Its effect lingers for 0.5 seconds.", "Cannot detect units under the effect of  Shadow Dance,  Smoke of Deceit and  Techies' mines within a 125 radius of an  Aghanim's Scepter upgraded  Minefield Sign."], "Cooldown": "", "data": ["Radius: 1000"], "types": {"Affects": ["Enemies"], "Ability": ["Aura"]}}}, {"Mana Burn": {"special_details": [], "modifiers": {}, "description": "Launches an arrow that burns away the targeted unit's mana, dealing damage equal to the amount of mana burned.", "Mana": "", "ability_special": ["BLOCKED_BY_LINKEN", "NO_PIERCE_SPELL_IMMUNE"], "notes": ["Applies the damage first, and then the mana loss.", "Can be cast on units without mana with no effect, wasting the mana and cooldown.", "Despite the visual effects, the mana burn and damage are applied instantly."], "Cooldown": "", "data": ["Cast Animation: 0.5+0.13/0.2/0.23", "Cast Range: 600", "Mana Burned: 125/175/225", "Mana Burned as Damage: 100%"], "types": {"Affects": ["Enemies"], "Ability": ["Target Unit"], "Damage": ["Magical"]}}}, {"Archer Aura": {"special_details": ["ILLUSIONS_CAN_USE Illusions benefit from the movement and attack speed bonuses."], "modifiers": {"Necronomicon Archer Aura: Undispellable.": "green"}, "description": "Increases movement and attack speed of nearby units.", "Mana": "", "ability_special": ["ILLUSIONS_CAN_USE", "NOT_DISABLED_BY_BREAK", "PIERCE_SPELL_IMMUNE"], "notes": ["Fully stacks with other sources of movement and attack speed, except for other Archer Auras.", "The aura's buff lingers for 0.5 seconds."], "Cooldown": "", "data": ["Radius: 900", "Move Speed Bonus: 5%/7%/9%", "Attack Speed Bonus: 5/7/9"], "types": {"Affects": ["Allies"], "Ability": ["Aura"]}}}], "availability": [], "cost": "2650 (1200)", "details": {"Bonus": ["+8/12/16 Strength", "+15/21/24 Intelligence"], "Alert allies?": ["No"], "builds_into": ["Necronomicon"], "Disassemble?": ["No"], "Active": ["Demonic Summoning"], "builds_from": ["Staff of Wizardry", "Belt of Strength", "Recipe"]}, "lore": "Considered the ultimate in necromancy and demonology, a powerful malefic force is locked within its pages.", "type": "Caster", "additional_info": ["Upgrading the item improves its stats and strengthens the summons from Demonic Summoning. Can be upgraded twice.", "The total gold cost for each level is 2650/3850/5050.", "One Necronomicon grants the following on each level:\n Level 1: 160 health, 0.24 health regeneration, 180 mana, 0.6 mana regeneration and 0.9375% spell damage (and 8 attack damage to strength heroes, or 15 attack damage to intelligence heroes).\n Level 2: 240 health, 0.36 health regeneration, 252 mana, 0.84 mana regeneration and 1.3125% spell damage (and 12 attack damage to strength heroes, or 21 attack damage to intelligence heroes).\n Level 3: 320 health, 0.48 health regeneration, 288 mana, 0.96 mana regeneration and 1.5% spell damage (and 16 attack damage to strength heroes, or 24 attack damage to intelligence heroes).", "Level 1: 160 health, 0.24 health regeneration, 180 mana, 0.6 mana regeneration and 0.9375% spell damage (and 8 attack damage to strength heroes, or 15 attack damage to intelligence heroes).", "Level 2: 240 health, 0.36 health regeneration, 252 mana, 0.84 mana regeneration and 1.3125% spell damage (and 12 attack damage to strength heroes, or 21 attack damage to intelligence heroes).", "Level 3: 320 health, 0.48 health regeneration, 288 mana, 0.96 mana regeneration and 1.5% spell damage (and 16 attack damage to strength heroes, or 24 attack damage to intelligence heroes)."]}, "Sacred Relic": {"abilities": [], "availability": ["SECRET_SHOP"], "cost": "3800 ", "details": {"Bonus": ["+60 Attack damage"], "builds_from": [], "builds_into": ["Divine Rapier", "Radiance"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "An ancient weapon that often turns the tides of war.", "type": "Secret Shop", "additional_info": ["When having a Demon Edge and a Radiance recipe in the inventory, buying Sacred Relic results in a finished Radiance, and not a Divine Rapier."]}, "Power Treads": {"abilities": [{"Switch Attribute": {"special_details": [], "modifiers": {}, "description": "Changes selected attribute between Strength, Agility and Intelligence.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Interrupts the user's channeling spells upon cast.", "Switches from strength to intelligence, from intelligence to agility, or from agility to strength.", "Current health and mana percentages stay unchanged upon switching attributes.", "When having multiple Power Treads, each of them can be switched individually. The attribute bonuses fully stack."], "Cooldown": "", "data": ["Selected Attribute Bonus: 9"], "types": {"Affects": ["Self"], "Ability": ["No Target"]}}}], "availability": ["SIDE_SHOP"], "cost": "1350 ", "details": {"Bonus": ["+25 Attack speed", "+45 Movement Speed"], "Alert allies?": ["No"], "builds_into": [], "Disassemble?": ["No"], "Active": ["Switch Attribute"], "builds_from": ["Boots of Speed", "Gloves of Haste", "Belt of Strength"]}, "lore": "A pair of tough-skinned boots that change to meet the demands of the wearer.", "type": "Common", "additional_info": ["Movement speed bonuses from multiple pairs of boots do not stack.", "Stacks with all other movement speed bonuses.", "Attack speed bonuses of multiple Power Treads do not stack.", "There are three ways to assemble Power Treads. Based on which item is chosen, the boot's initial status is different. The status can be switched freely after purchase.", "Disassembling Power Treads returns the items which were originally used to build it. It is not based on the currently selected attribute.", "One pair of Power Treads grants a total of:"]}, "Rod of Atos": {"abilities": [{"Cripple": {"special_details": ["NO_PIERCE_SPELL_IMMUNE Slow persists if debuff was placed before spell immunity and when not dispelled."], "modifiers": {"Rod Of Atos Debuff: Dispellable with any dispel.": "red"}, "description": "Slows the target's movement speed.", "Mana": "", "ability_special": ["BLOCKED_BY_LINKEN", "NO_PIERCE_SPELL_IMMUNE"], "notes": ["Successive casts on the same target do not stack, but refresh the duration instead."], "Cooldown": "", "data": ["Cast Range: 1200", "Move Speed Slow: 60%", "Duration: 4"], "types": {"Affects": ["Enemies"], "Ability": ["Target Unit"]}}}], "availability": [], "cost": "3100 ", "details": {"Bonus": ["+30 Intelligence", "+350 Health"], "Alert allies?": ["No"], "builds_into": [], "Disassemble?": ["No"], "Active": ["Cripple"], "builds_from": ["Staff of Wizardry", "Staff of Wizardry", "Vitality Booster"]}, "lore": "Atos, the Lord of Blight, has his essence stored in this deceptively simple wand.", "type": "Caster", "additional_info": ["One Rod of Atos grants a total of 350 health, 360 mana, 1.2 mana regeneration and 1.875% spell damage (and 30 attack damage to intelligence heroes)."]}, "Boots of Speed": {"abilities": [], "availability": ["SIDE_SHOP"], "cost": "400 ", "details": {"Bonus": ["+45 Movement Speed"], "builds_from": [], "builds_into": ["Arcane Boots", "Boots of Travel", "Tranquil Boots", "Phase Boots", "Power Treads"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "Fleet footwear, increasing movement.", "type": "Arcane", "additional_info": ["Movement speed bonuses from multiple pairs of boots do not stack.", "Stacks with all other movement speed bonuses."]}, "Clarity": {"abilities": [{"Regenerate Mana": {"special_details": [], "modifiers": {"Clarity Potion: Undispellable.": "green"}, "description": "Restores mana to the target unit over time. If the unit is attacked, the effect is lost.", "Mana": "", "ability_special": ["PIERCE_SPELL_IMMUNE"], "notes": ["Double clicking the item casts it on self.", "If the target is more than 500 range away, the caster moves to the target until it is within 250 range before casting.", "Can only target heroes (including illusions) and creep-heroes.", "The owner does not have to face the target to use this on it.", "Successive casts on the same target do not stack, but refresh the duration instead.", "Restores mana in the form of mana regeneration, so it restores 0.38 mana in 0.1 second intervals, which is 3.8 mana per second.", "Is dispelled by any damage equal to or greater than 20 (before reductions), including self-inflicted damage.", "Is not dispelled by damage flagged as HP Removal.", "Is always dispelled by attacks, even when the attack dealt no damage.", "Fully stacks with other mana regeneration increasing effects."], "Cooldown": "", "data": ["Cast Range: 500", "Total Mana Restored: 190", "Duration: 50"], "types": {"Affects": ["Allied Heroes"], "Ability": ["Target Unit"]}}}], "availability": [], "cost": "50 ", "details": {"Charges": ["1"], "Alert allies?": ["No"], "builds_into": [], "Disassemble?": ["No"], "Active": ["Regenerate Mana"], "builds_from": []}, "lore": "Clear water that enhances the ability to meditate.", "type": "Consumables", "additional_info": ["Stacks with itself in inventory, there is no stack limit. The sell-back price adapts based on the number of Clarities in a stack.", "Clarities are not shareable, however, they can be cast on allies."]}, "Bloodstone": {"abilities": [{"Pocket Deny": {"special_details": [], "modifiers": {}, "description": "Instantly causes you to die.", "Mana": "", "ability_special": [], "notes": ["Deals damage in the form of HP Removal equal to the owner's current health to the owner upon cast.", "Dying this way counts as a deny.", "Can be cast and can kill the caster while invulnerable."], "Cooldown": "", "data": ["Cast Range: 100"], "types": {"Affects": ["Self"], "Ability": ["Target Point"], "Damage": ["Pure", "HP Removal"]}}}, {"Bloodpact": {"special_details": [], "modifiers": {}, "description": "Begins with 12 charges, and gains a charge each time an enemy hero dies within 1675 range. Each charge grants 1 mana regeneration per second and reduces respawn time by 3 seconds. If the bearer dies, 500 + 30 health per charge is restored to all allies within a 1675 radius, while the Bloodstone loses a third of its charges.", "Mana": "", "ability_special": ["ILLUSIONS_CANNOT_USE", "PIERCE_SPELL_IMMUNE"], "notes": ["When having multiple Bloodstones, the one in the higher inventory slot gains charges.", ["The top left inventory slot has the highest priority, the bottom left one the lowest."], "The effects of Bloodstone charges from all Bloodstones a hero owns fully stack.", "Gains a charge whenever an enemy hero dies within the radius, or whenever the owner makes a kill from any distance.", "When multiple heroes in a team have Bloodstones, each hero can gain a charge from the same enemy death.", "Each charge directly increases mana regeneration, so each charge regenerates 0.1 mana in 0.1 second intervals.", "The number of charges lost on death (including denies, e.g. Pocket Deny) is rounded up.", "Despite the visual effects, the area heal is applied instantly in the entire radius.", "The area heal upon death does not affect invulnerable and hidden allies.", "When the charges reduce the owner's death time to 0 or lower, he instantly respawns.", ["This can cause still ongoing spells to affect the owner (e.g.  Timber Chain)."]], "Cooldown": "", "data": ["Charge Gain Radius: 1675", "Death Heal Radius: 1675", "Charge Gain per Enemy Death: 1", "Mana Regeneration per Charge: 1", "Death Respawn Timer Reduction: 3", "Death Base Area Heal: 500", "Death Bonus Area Heal per Charge: 30"], "types": {"Affects": ["Self / Allies"], "Ability": ["Passive"]}}}], "availability": [], "cost": "4875 (900)", "details": {"Charges": ["12"], "Alert allies?": ["No"], "builds_into": [], "Passive": ["Bloodpact"], "Bonus": ["+475 Health", "+425 Mana", "+9 Health regeneration", "+200% Mana regeneration"], "Disassemble?": ["No"], "Active": ["Pocket Deny"], "builds_from": ["Soul Booster", "Soul Ring", "Recipe"]}, "lore": "The Bloodstone's bright ruby color is unmistakable on the battlefield, as the owner seems to have infinite vitality and spirit.", "type": "Armor", "additional_info": ["The bloodmark left at the owner's death location (unused)", "Bloodstone replenishing allies' health"]}, "Hyperstone": {"abilities": [], "availability": ["SECRET_SHOP"], "cost": "2000 ", "details": {"Bonus": ["+55 Attack speed"], "builds_from": [], "builds_into": ["Assault Cuirass", "Mjollnir", "Moon Shard"], "Alert allies?": ["No"], "Disassemble?": ["No"]}, "lore": "A mystical, carved stone that boosts the fervor of the holder.", "type": "Secret Shop", "additional_info": ["Hyperstone is featured in the Dota 2 Gamescom trailer as an item for \"swift\" heroes that gives you \"speed beyond measure\"."]}}